{
    "patch_notes": [
        {
            "version": "2.0",
            "title": "Anko Localization Reborn",
            "content": "<p>Complete rewrite from scratch. New UI based on UITK, parsing via Roslyn, Quality of Life (QoL) improvements, increased stability, and MVVM implementation. Faster, smarter, safer.</p><h3>Core & Logic</h3><ul><li><strong>Parsing & Keys:</strong><ul><li>Implementation of Roslyn for script parsing (replacing Regex).</li><li><strong>Manual Key Override</strong> for components.</li><li>Improved logic for \"Soft keys\" and generation priorities.</li><li>Option to bind empty components even to text that is ignored by Regex rules.</li></ul></li><li><strong>Scanning & References:</strong><ul><li>Use of <code>GlobalID</code> to preserve object references between scenes.</li><li>Unification of ignore lists (objects and paths) into a single mechanism.</li></ul></li><li><strong>Localization:</strong><ul><li>Atomic field definition to prevent double localization.</li><li>Font fallback chain for UITK, Legacy Text, and TMP (Language → Parent → Default).</li><li><strong>Asynchrony:</strong> Asset scanning and language statistics loading are now performed asynchronously.</li></ul></li></ul><h3>UI/UX (Interface \"Next\")</h3><ul><li><strong>Architecture:</strong><ul><li>Full transition to UITK and MVVM (ViewModel + Presenter).</li><li><code>IEditorViewService</code> abstraction (decoupling from Unity Editor API).</li><li>Use of <code>SerializedObject</code> for reactive bindings.</li></ul></li><li><strong>Main Window:</strong><ul><li>New structure: Sidebar, Tabs, Sections.</li><li>Global search across the entire tool with Regex support.</li><li>Localization of the editor interface itself.</li><li><strong>Safe Mode</strong> with visual indication.</li></ul></li><li><strong>Toolbar:</strong> New actions — \"Check Dependencies\", \"Find Settings Asset\", \"Leave Feedback\".</li><li><strong>Styling:</strong><ul><li>Global CSS variables.</li><li>Utility classes (USS) for layout, padding, and colors.</li><li><strong>Vector Icons:</strong> Replacement of all emojis with CSS icon classes for consistency.</li><li>Forced use of system fonts in the editor (for CJK/Cyrillic support).</li></ul></li><li><strong>Components:</strong><ul><li>Virtualized lists (<code>DynamicHeight</code>) for performance.</li><li>Documentation, Discord, and Support buttons in the header.</li><li>Progress bars and status bar in the footer.</li></ul></li></ul><h3>Translation Table Editor</h3><ul><li><strong>Functions:</strong><ul><li>Column Pinning.</li><li>Rich Text display toggle.</li><li><strong>Source Editing:</strong> The source language column is now available for editing.</li><li><strong>Locking:</strong> Ability to \"Lock\" individual cells from auto-translation.</li></ul></li><li><strong>Interaction:</strong><ul><li>Context menus for cells and headers (including AI Assistant for the source column).</li><li>Visual indicators: errors, text length, unsaved changes, audio status.</li><li>Opening the source script from the context menu (Open in IDE).</li><li><strong>Batch Operations:</strong> Bulk clear, \"Fill from Source\", Audio/Translation generation.</li></ul></li></ul><h3>AI & Audio</h3><ul><li><strong>AI:</strong><ul><li><strong>Presets:</strong> Built-in configurations for OpenAI, Google Gemini, and Anthropic Claude.</li></ul></li><li><strong>Audio:</strong><ul><li><strong>Smart Sync:</strong> Audio hash synchronization to update metadata without regenerating files.</li><li><strong>Voice ID:</strong> Support for specific Voice IDs (e.g., for ElevenLabs).</li><li><strong>Deep Scan:</strong> Search for override paths across all audio profiles.</li></ul></li></ul><h3>Preview & Simulation</h3><ul><li><strong>Integration:</strong> Embedded preview in the main window header, in the \"debugging\" section, and as an overlay on the Scene tab.</li><li><strong>Component Support:</strong><ul><li>\"Text-Key\" mapping for accurate previewing.</li></ul></li><li><strong>Safety:</strong><ul><li><strong>Auto-Revert:</strong> Improved automatic rollback upon saving, closing a scene, or entering PlayMode.</li><li><strong>Crash Recovery:</strong> Improved preview state backup in case of an editor crash.</li></ul></li></ul><h3>Integrations & Formats</h3><ul><li><strong>TMS (Translation Management Services):</strong><ul><li>Asynchronous operations (Push/Pull) with logging.</li><li>Loading metadata and comments from JSON.</li><li>Input sanitization and redirect handling.</li></ul></li></ul><h3>Assets & Migration</h3><ul><li><strong>Assets:</strong><ul><li>Path validation and warnings.</li><li><strong>Custom Asset Providers:</strong> Plugin system for loading assets.</li><li>Assembly Definition reference checks.</li><li>Runtime availability of localization profiles.</li></ul></li><li><strong>Migration:</strong><ul><li>Migration tool (I2 loc | Unity loc | custom) with conversion rules.</li><li><strong>Dry-Run:</strong> Migration preview with a detailed report.</li><li>Import of legacy data (I2 CSV, Unity XLIFF).</li><li><strong>Backup Manager:</strong> Create, restore, and delete backups (subfolder support).</li><li><strong>Standalone Installer:</strong> For dependency isolation during migration.</li></ul></li></ul><h3>Refactoring & Optimization</h3><ul><li><strong>Structure:</strong><ul><li>Namespace reorganization (<code>Ankonoanko.Localization.Next</code>).</li><li>Layer separation: Domain, Presentation, Infrastructure.</li><li>Removal of legacy code (IMGUI, old parsers).</li></ul></li><li><strong>Performance:</strong><ul><li><code>BulkObservableCollection</code> for list optimization.</li><li>Asynchronous filtering and search using precompiled matchers.</li><li>Resource loading optimization by GUID with fallbacks.</li></ul></li><li><strong>Infrastructure:</strong><ul><li>Bootstrapper for Dependency Injection.</li><li>Centralized logger with error categories.</li><li><strong>Project Isolator:</strong> To prevent DLL conflicts.</li></ul></li></ul>"
        },
        {
            "version": "1.4.7",
            "title": "TMS Integration",
            "content": "<h3>🌐 Translation Management Systems (TMS)</h3><ul><li>Implemented universal TMS integration architecture</li><li>Added separate settings sections for each provider (individual API keys, Project IDs, network timeout settings)</li></ul><p><strong>Supported services:</strong></p><ul><li><strong>Transifex</strong><br>Full API v3 integration, asynchronous upload/download, resource creation, reliable job polling</li><li><strong>Phrase</strong><br>API v2 support, XLIFF/XML format, input sanitization, proper handling of multi-language merges</li><li><strong>Loco</strong><br>Smart ID replacement (mapping hash IDs back to source text), language list retrieval, anti-cache filtering</li><li><strong>Crowdin</strong><br>Advanced translation upload with XLIFF zip merging, auto-approval flags support, better filename management</li></ul><h3>🔢 Advanced Pluralization & Logic</h3><ul><li>Complete rewrite of pluralization system</li><li>Implemented <strong>Universal CLDR Rules</strong> engine</li><li>Full support for parsing fractional and localized operands: n, i, v, w, f, t</li><li>Verified correct behavior with complex plural rules for:<br>Russian, Polish, Welsh, Romanian, Slovenian, Arabic and many others</li><li>Added flexible fallback systems:<ul><li>Culture fallback (e.g. en-GB → en) — toggleable</li><li>\"Follow System Language\" option on initialization</li><li>Return source string when translation is missing — configurable</li></ul></li></ul><h3>📊 Reporting and Analysis</h3><ul><li>New toolbar filter: sort and view entries by source type</li><li>Implemented <strong>IsSourceIgnored</strong> logic<br>→ scripts and keys marked as ignored are now excluded from duplicate checks and parsing reports (no more false-positive warnings)</li></ul><h3>📥 Import/Export & XLIFF</h3><ul><li>Significantly improved XLIFF handling:<ul><li>Import now prioritizes <strong>resname</strong> attribute over <strong>id</strong> for more reliable key mapping</li><li>Export creates separate files per language + master source file</li></ul></li></ul><h3>🚀 Performance and Stability</h3><ul><li>Unified <strong>PerformRequest</strong> method for all HTTP operations<br>→ better 303 redirect handling<br>→ more detailed error reporting with full WebResponse information</li><li>Added input sanitization for API keys and Project IDs<br>(protection against whitespace and invalid characters)</li></ul>"
        },
        {
            "version": "1.3.2",
            "title": "HotFix",
            "content": "<h3>🛠 Core & Logic</h3><ul><li><strong>Script Ignoring Overhaul:</strong> completely rewrote <code>IsScriptIgnored</code> to reliably handle project-relative paths. Added recursive support for ignoring entire folders.</li><li><strong>Prefab Key Stability:</strong> Refactored key generation to strictly distinguish between Prefab Assets and Instances, preventing key conflicts in scenes.</li><li><strong>Legacy Cleanup:</strong> Removed hardcoded Regex protection for plural/gender keys (use <em>Dynamic Key Prefixes</em> for manual keys instead).</li><li><strong>Optimization:</strong> Eliminated redundant processing of prefab instances during text collection.</li></ul><h3>🎨 UI / UX</h3><ul><li><strong>Drag & Drop:</strong> Added support for dragging scripts and folders directly into the <em>Scripts to Ignore</em> list.</li><li><strong>UX Improvements:</strong> Improve UI by adding helpful labels and filtering for ignored scripts list.</li></ul>"
        },
        {
            "version": "1.3",
            "title": "Audio & Addressables",
            "content": "<h3>🎧 Audio & Text-to-Speech (TTS)</h3><ul><li><strong>Full TTS Integration:</strong><br>Support for generating audio via Text-to-Speech with configuration of voices, services, and presets in Translation Profiles (including audio-specific presets and voice mapping rules).</li><li><strong>Smart Caching and Stable Filenames:</strong><br>Content-based hashing (MD5 of text) to avoid unnecessary regeneration. Reliable file tracking via centralized meta-file (<code>translations_meta.json</code>) even when keys or text change.</li><li><strong>Batch Audio Generation:</strong><br>Bulk creation of audio for selected rows, columns, or the entire project. Support for forced regeneration, statistics calculation (existing/missing/outdated), and progress bars.</li><li><strong>Preview Playback in Editor:</strong><br>Play audio directly in the Translation Table by clicking the icon. Color-coded indication (audio status: up-to-date/outdated/missing).</li><li><strong>Audio Filters:</strong><br>New filtering modes: <em>Has Audio</em>, <em>Missing Audio</em>, <em>Outdated Audio</em>.</li></ul><h3>📦 Addressables & Asset/Prefab Localization</h3><ul><li><strong>Native Addressables Support:</strong><br>Asynchronous loading of localizable assets (Sprite, AudioClip, Prefab, etc.). Automatic creation of groups <code>Loc_{Category}_{Lang}</code>. Full compatibility without the package installed (conditional compilation with fallback to Resources). Reference counting to prevent memory leaks.</li><li><strong>Advanced Prefab Localization Modes:</strong><ul><li><strong>Smart Swap</strong> — Direct replacement of mesh, sprite, audio on the same object (preserving physics, references, and state).</li><li><strong>Compound Child</strong> — Instantiate localized version as child while disabling original components.</li></ul>Editor preview support and safe revert functionality.</li></ul><h3>📥 Data Import and Migration</h3><ul><li><strong>Reliable CSV/XLIFF Import:</strong><br>Preview before import with statistics (added/updated/skipped/filtered). Smart CSV parsing (handles quotes and commas inside text). Auto-detection of languages, filtering of non-text assets (AudioClip, Sprite, etc.) with cleanup of asset keys from the database.</li></ul><h3>🔑 Keys and Generation</h3><ul><li><strong>New Manual Key Generation Mode:</strong><br>Full control — auto-path generation is ignored; only explicitly defined keys are used. Validation of empty/missing keys with red icon in hierarchy.</li><li><strong>Preserved Original Casing:</strong><br>Keys and text are no longer forced to lowercase — complete control over casing in all modes.</li><li><strong>Placeholder Mismatch Detection:</strong><br>Red highlighting of cells with differing placeholder count/type ({0}, %s, etc.) with tooltip \"Placeholder Mismatch!\".</li><li><strong>Reverse Key Lookup from Component to Table:</strong><br>Quick focus on key in Translation Table: select an object or component in Hierarchy/Scene/Prefab — the tool automatically finds the corresponding key and scrolls the table to the relevant row (expanding groups as needed).</li></ul><h3>🛠 Translation Editor and UX</h3><ul><li><strong>Improved Translation Table:</strong><br>Fast search and focus on key (scroll + group expansion). Advanced filters (including audio and text length), context menus for audio and translations. Full integration with Unity's native Undo/Redo.</li><li><strong>In-Tool Documentation:</strong><br>Added panels with detailed descriptions of Live Updates, Folder Generation, Asset Loading, Addressables, and other features.</li><li><strong>New Assets Tab:</strong><br>Convenient categorized settings for loading (Addressables/Resources), storage, folder generation, and automation.</li><li><strong>Optimized Table Performance:</strong><br>Virtualization, caching of row heights, GUIContent, placeholders, text length, and audio status. O(1) key index lookup.</li></ul><h3>🚀 Performance and Stability</h3><ul><li><strong>General Improvements:</strong><br>Asynchronous JSON deserialization, Addressables reference management (reference counting), background processing, enhanced progress bars.</li><li><strong>Automatic Settings Validation:</strong><br>LocalizationSettings is created and validated automatically when needed. Pre-build checks with BuildFailedException on errors.</li><li><strong>Removal of Legacy Features:</strong><br>Experimental features removed (component migration, old test center, duplicate key modes, redundant UI elements) for cleaner code and greater stability.</li></ul><p>This version is designed for large-scale projects: full-featured audio support, Addressables integration, advanced prefab handling, high editor performance, and rock-solid reliability.</p>"
        },
        {
            "version": "1.2.5",
            "title": "Workflow & Safety",
            "content": "<h3>New Features</h3><ol><li><strong>Partial Scanning:</strong> Added support for scanning specific assets/folders. Implemented \"Safe Mode\" to merge new keys without deleting existing ones.</li><li><strong>Auto-Language:</strong> Added automatic system language detection on startup with a default fallback.</li><li><strong>Font & Glyph Manager:</strong> Redesigned UI with glyph pagination, global character reports, and advanced export filters.</li><li><strong>Default Settings:</strong> Added a \"Default Language\" option and a button to clear saved player preferences.</li></ol><h3>Improvements & Fixes</h3><ol><li><strong>Cleanup Tool:</strong> Completely refactored component removal logic with progress bars, safety prompts, and single-pass execution.</li><li><strong>Key Migration:</strong> Optimized logic to preserve translations for unchanged text and prevent key duplication.</li><li><strong>Stability:</strong> Fixed <code>LocalizationSettings</code> reference loss during Unity Domain Reloads.</li><li><strong>Menu:</strong> Reorganized \"Anko Localization Tool\" menu items for better accessibility.</li></ol>"
        },
        {
            "version": "1.2",
            "title": "QoL & Performance",
            "content": "<h3>User Interface & Editor Experience</h3><ol><li><strong>New 2-Panel UI:</strong> Upgraded Settings and Actions tabs with a split-panel layout for better navigation and workflow.</li><li><strong>Scene View Labels:</strong> Added interactive labels for localized components (smart positioning, hover/click-to-select, toggle in Editor Settings).</li><li><strong>Hierarchy Status Icons:</strong> Added green/yellow indicators showing localization status of GameObjects.</li><li><strong>Regex & Pseudo-localization UI:</strong> Improved Regex list with color legends and adaptive height; added pseudo-localization config panel with live preview.</li><li><strong>Table Editor:</strong> Added button to quickly open the translation file’s folder in the table editor header.</li></ol><h3>New Features</h3><ol><li><strong>Ignored Regex Patterns:</strong> Added customizable Regex exclusion for URLs, code, variables etc., with presets and live tester.</li><li><strong>Undo Support:</strong> Full Unity Undo for localized component changes; safe material previews using temporary instances.</li><li><strong>Font Glyph Checker:</strong> Integrated directly into the main Localization Window.</li></ol><h3>Performance & Core Optimization</h3><ol><li><strong>Memory Management:</strong> Fixed OutOfMemoryException in large projects via stream reading and periodic GC unloading during searches.</li><li><strong>Global Search:</strong> Rewritten with coroutines and dynamic path collection – full coverage without editor freezes.</li><li><strong>Rendering Optimization:</strong> Added UI virtualization for large tables and cached GUIStyles to reduce allocations.</li><li><strong>Text Parsing:</strong> Replaced Regex control-character removal with manual loops (10-100x faster).</li></ol><h3>Fixes & Refactoring</h3><ol><li><strong>Preview Stability:</strong> Fixed prefab preview errors on save/close; added safe editor state reset.</li><li><strong>UITK Localization:</strong> Switched to event-driven updates (no polling).</li><li><strong>Regex Safety:</strong> Added timeouts to prevent hangs on complex patterns.</li><li><strong>Prefab Ignore List:</strong> Fixed an issue where child objects in prefabs were not being ignored correctly.</li></ol>"
        },
        {
            "version": "1.1.1",
            "title": "Hotfix Update",
            "content": "<p>This package updates a single script (<code>TextParser.cs</code>).</p><h3>Fixes:</h3><ol><li><strong>Prefab Ignore List:</strong> Fixed an issue where child objects in prefabs were not being ignored correctly. This was caused by the hidden temporary <code>Canvas (Environment)</code> object created by Unity.</li><li><strong>Text Filtering:</strong> The parser now automatically ignores prices (e.g., <code>$100</code>), percentages (<code>50%</code>), and standalone numbers.</li></ol>"
        },
        {
            "version": "1.1",
            "title": "AI integration",
            "content": "<h3>AI System & Profiles</h3><ol><li>Translation Profiles: Settings moved to ScriptableObject assets for quick configuration switching.</li><li>Custom AI Support: Added REST API support for OpenAI, Gemini, Claude, and local Ollama models.</li><li>Contextual Translation: AI now uses developer notes and object hierarchy paths for better context.</li><li>Glossary: Added CSV glossary support to force specific terminology.</li><li>AI Commands: Context menu actions (e.g., Fix Grammar, Shorten) added to the editor.</li><li>Preset Generator: Tool to automatically generate AI connection presets.</li></ol><h3>Main Window</h3><ol><li>Content Tab: Redesigned with search, type filtering, and pagination.</li><li>Report Tab: Detailed parsing stats and an object \"Ping\" feature.</li><li>Prefab Mode: Localization preview now works while editing prefabs in isolation.</li></ol><h3>Table Editor(rework)</h3><ol><li>Selection: Support for selecting individual cells, rows, or columns.</li><li>Bulk Actions: Mass translate, clear, or delete keys via right-click.</li><li>Length Check: Filter highlights translations exceeding original length to prevent UI breaks.</li><li>Navigation: Added keyboard navigation and hotkeys.</li></ol><h3>Fixes & Optimization</h3><ol><li>RTL Support: Rewritten using reflection to prevent errors if \"Arabic Support\" is missing.</li><li>Crash Recovery: Editor crash recovery now supports Prefab Mode.</li><li>Async Operations: Optimized loading to prevent editor freezes with large data.</li></ol>"
        }
    ]
}