{
  "page_title": "Unity Localization Tool Dokumentation",
  "toc_title": "Inhaltsverzeichnis",
  "toc_search_placeholder": "Dokumentation durchsuchen...",
  "nav_introduction": "1. Einführung",
  "nav_quick_start": "2. Schnellstart",
  "nav_components": "3. Kernkomponenten",
  "nav_loc_tool_window": "4. Das „Localization Tool“-Fenster",
  "nav_translation_editor": "5. Übersetzungseditor",
  "nav_ai_profiles": "6. KI & Übersetzungsprofile (Neu v1.1)",
  "nav_usage_examples": "7. Anwendungsbeispiele",
  "nav_important_notes": "8. Wichtige Hinweise",
  "nav_extending": "9. Erweiterung der Funktionalität",
  "nav_faq": "10. FAQ & Fehlerbehebung",
  "nav_migration_tool": "11. Migrationstool",
  "nav_font_glyph_manager": "12. Font & Glyph Manager",
  "nav_pseudo_tool": "13. Pseudo-Lokalisierungstool",
  "nav_ai_audio": "14. KI Audio / Text-to-Speech",
  "nav_key_features": "Schlüsselmerkmale",
  "nav_installation": "2.1. Installation",
  "nav_initial_setup": "2.2. Erstes Setup",
  "nav_localizedtext": "3.1. LocalizedText",
  "nav_localizedasset": "3.2. LocalizedAsset",
  "nav_localizedprefab": "3.3. LocalizedPrefab",
  "nav_uitklocalization": "3.4. UITKLocalization",
  "nav_localizeddropdown": "3.5. LocalizedDropdown",
  "nav_localizedbehaviour": "3.6. LocalizedBehaviour",
  "nav_context_menu": "3.7. Kontextmenü",
  "nav_in_editor_preview": "4.1. In-Editor & Prefab-Vorschau",
  "nav_tab_settings": "4.2. Tab „Einstellungen“",
  "nav_tab_content": "4.3. Tab „Inhalt“ (Überarbeitet)",
  "nav_tab_actions": "4.4. Tab „Aktionen“",
  "nav_tab_assets": "4.5. Tab „Assets“",
  "nav_tab_report": "4.6. Tab „Bericht“",
  "nav_ai_profiles_overview": "6.1. Übersetzungsprofile",
  "nav_custom_ai": "6.2. Benutzerdefinierte KI & Modelle",
  "nav_ai_context": "6.3. Kontext & Glossar",
  "nav_ai_assistant": "6.4. KI-Assistenten-Befehle",
  "nav_example_components": "7.1. Vorgefertigte Komponenten",
  "nav_example_attribute": "7.2. [LocalizableField] Attribut",
  "nav_example_function": "7.3. _() Funktion",
  "nav_example_plurals": "7.4. Plurale & Geschlecht",
  "nav_custom_parser": "9.1. Erstellen eines Parsers",
  "nav_faq_installation": "10.1. Installation & Schnellstart",
  "nav_faq_components": "10.2. Kernkomponenten",
  "nav_faq_window": "10.3. Das „Localization Tool“-Fenster",
  "nav_faq_window_actions": "10.3. Das „Localization Tool“-Fenster - Tab „Aktionen“",
  "nav_faq_window_assets": "10.3. Das „Localization Tool“-Fenster - Tab „Assets“",
  "nav_faq_window_report": "10.3. Das „Localization Tool“-Fenster - Tab „Bericht“",
  "nav_faq_editor": "10.4. Übersetzungseditor",
  "nav_faq_examples": "10.5. Anwendungsbeispiele & Code",
  "nav_faq_notes": "10.6. Wichtige Nuancen & Warnungen",
  "nav_faq_extending": "10.7. Erweiterung der Funktionalität",
  "h1_introduction": "Einführung",
  "p_intro_1": "Dieses Tool ist eine umfassende Lösung zur Lokalisierung von Spielen und Anwendungen in Unity. Es automatisiert den Prozess der Sammlung von Text und Assets, der Verwaltung von Übersetzungen über eine leistungsstarke Benutzeroberfläche, der Integration mit maschinellen Übersetzungsdiensten (einschließlich Custom AI) und der dynamischen Aktualisierung lokalisierter Inhalte im Spiel.",
  "h2_key_features": "Schlüsselmerkmale",
  "li_feature_1": "<strong>Erweitertes Parsing:</strong> Automatisches Scannen von Szenen, Prefabs, UI Toolkit (UXML) und C#-Skripten, einschließlich Feldern, die mit dem Attribut <code>[LocalizableField]</code> markiert sind, sowie verschachtelten Klassen und Listen.",
  "li_feature_2": "<strong>Lokalisierung beliebiger Assets:</strong> Verwalten Sie Sprites, Audio, Prefabs, Materialien usw.",
  "li_feature_3": "<strong>Leistungsstarker Übersetzungseditor:</strong> Eine zentralisierte Benutzeroberfläche mit Auto-Speichern, vollständiger Unterstützung für Rückgängig/Wiederherstellen (Undo/Redo), intelligenter Schlüsselgruppierung und <strong>Neu in v1.1:</strong> Aktionen für Mehrfachauswahl.",
  "li_feature_4": "<strong>KI & Maschinelle Übersetzung (v1.1):</strong> Neues Profilsystem, das DeepL, Google, Microsoft und <strong>Benutzerdefinierte KI (OpenAI, Gemini, Claude, Ollama)</strong> mit Kontextbewusstsein unterstützt.",
  "li_feature_5": "<strong>Flexibler Import/Export:</strong> Unterstützung für CSV, XML, YAML, XLIFF und direkten Import aus Google Sheets.",
  "li_feature_6": "<strong>Live-Vorschau:</strong> Zeigen Sie jede Sprache in der Szenenansicht oder im <strong>Prefab-Modus</strong> an, ohne das Spiel zu starten.",
  "li_feature_7": "<strong>Unterstützung für Plurale & Geschlecht:</strong> Korrekte Handhabung von Pluralformen (mit Regeln für slawische, arabische und andere Sprachen) und Geschlecht.",
  "li_feature_8": "<strong>Volle RTL-Unterstützung:</strong> Korrekte Anzeige von Sprachen, die von rechts nach links geschrieben werden.",
  "li_feature_9": "<strong>Live-Updates:</strong> Laden Sie aktuelle Übersetzungen von einem Remote-Server beim Spielstart.",
  "li_feature_10": "<strong>Backup-Manager:</strong> Ein integriertes Tool zum Erstellen und Wiederherstellen von Backups.",
  "li_feature_11": "<strong>KI-gestützt:</strong> Unterstützung für OpenAI, Anthropic (Claude), Google Gemini und lokale LLMs (Ollama) über anpassbare Profile.",
  "li_feature_12": "<strong>Text-to-Speech (TTS):</strong> Generierung von Audiodateien für lokalisierte Zeichenketten mithilfe von KI (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Migrationstools:</strong> Tools für den automatischen Übergang von I2 Localization- und Unity Localization-Plugins.",
  "li_feature_14": "<strong>Font & Glyph Manager:</strong> Tool zur Analyse verwendeter Zeichen und zum Auffinden fehlender Glyphen in Schriftarten.",
  "li_feature_15": "<strong>Visuelles Debugging:</strong> Symbole in der Hierarchie und Beschriftungen in der Szenenansicht zur schnellen Fehlerbehebung.",
  "h1_quick_start": "Schnellstart und Setup",
  "h2_installation": "2.1. Installation",
  "li_install_1": "Kopieren Sie das Asset in Ihren Unity-Projektordner.",
  "li_install_2": "Das Tool überprüft automatisch die notwendigen Abhängigkeiten. Bestätigen Sie die Installation in dem erscheinenden Dialogfeld.",
  "li_install_3": "Erforderliche Abhängigkeiten (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) sind für die grundlegende Funktionalität notwendig.",
  "li_install_4": "Optionale Abhängigkeiten (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) ermöglichen zusätzliche Funktionen.",
  "li_install_5": "Klicken Sie auf <strong>Install Selected</strong>, um die empfohlenen Pakete zu installieren.",
  "li_install_6": "Öffnen Sie nach der Installation das Haupttool-Fenster über das Menü <strong>Tools -> Localization Tool</strong>.",
  "li_install_7": "Wenn Sie die asynchrone Asset-Ladung verwenden möchten, installieren Sie das <strong>Addressables</strong>-Paket über den Paket-Manager.",
  "h2_initial_setup": "2.2. Erstes Setup",
  "li_setup_1": "<strong>Einstellungen erstellen:</strong> Beim ersten Öffnen erstellt das Tool eine Datei <code>LocalizationSettings.asset</code> im Ordner <code>Assets/Resources</code>.",
  "li_setup_2": "<strong>Sprachen konfigurieren:</strong> Stellen Sie im Tab <strong>Settings</strong> unter <strong>Language Management</strong> sicher, dass Ihre Hauptsprache (z. B. <code>en</code> für Englisch) als <strong>Source Language</strong> ausgewählt ist. Aktivieren Sie alle Sprachen, die Sie unterstützen möchten.",
  "li_setup_3": "<strong>Inhalt für das Parsing angeben:</strong> Fügen Sie im Tab <strong>Content</strong> alle Szenen zur Analyse zur Liste <strong>Scenes to Parse</strong> hinzu. Wenn Sie Prefabs mit Text verwenden, stellen Sie sicher, dass deren Ordner zu <strong>Prefab Folders</strong> hinzugefügt werden.",
  "li_setup_4": "<strong>Erster Parser-Lauf:</strong> Gehen Sie zum Tab <strong>Actions</strong> und klicken Sie auf die Schaltfläche <code>Update Keys</code>. Das Tool scannt Ihr Projekt, erstellt Übersetzungsdateien und fügt automatisch die notwendigen Komponenten (<code>LocalizedText</code>, <code>LocalizedAsset</code> usw.) zu Spielobjekten hinzu.",
  "li_setup_5": "<strong>Einstellungen & Builds (KRITISCH):</strong> Das Tool fügt <code>LocalizationSettings.asset</code> automatisch zu <code>Project Settings -> Player -> Preloaded Assets</code> hinzu. <br>⚠️ <strong>Sicherheitsprüfung:</strong> Wenn die Einstellungen bei Preloaded Assets fehlen und sich nicht in einem Resources-Ordner befinden, **blockiert** das Tool den Build mit einer <code>BuildFailedException</code>, um zu verhindern, dass das Spiel beim Start abstürzt.",
  "h1_components": "Kernkomponenten (automatisch zugewiesen)",
  "warning_box_components": "<strong>Wichtiger Hinweis:</strong> Alle unten beschriebenen Komponenten werden Spielobjekten automatisch während des Parsings hinzugefügt (wenn Sie auf die Schaltfläche <code>Update Keys</code> klicken). Sie müssen sie nicht manuell hinzufügen.",
  "p_components_intro": "Diese Komponenten sind die „Brücke“ zwischen Ihren Objekten in der Szene und der Übersetzungsdatenbank. Sie „lauschen“ auf Sprachänderungen und ersetzen automatisch den korrekten Text oder das korrekte Asset.",
  "h2_localizedtext": "3.1. LocalizedText",
  "p_localizedtext_1": "Die Hauptkomponente zur Anzeige von übersetztem Text. Sie wird auf Objekten mit <code>Text</code>, <code>TMP_Text</code> und <code>TextMesh</code> platziert.",
  "li_localizedtext_1": "<code>localizationKey</code>: Der Schlüssel, der zum Auffinden der Übersetzung verwendet wird. Wird automatisch generiert.",
  "li_localizedtext_2": "<code>isStyleOnly</code>: Wenn <code>true</code>, wendet die Komponente nur Stile (Schriftart, RTL) an, ändert jedoch nicht den Text selbst. Nützlich für Elemente, deren Text von einem anderen Skript verwaltet wird (z. B. <code>LanguageSelector</code>).",
  "li_localizedtext_3": "<code>originalSourceText</code>: Der Originaltext in der Basissprache. Wird als Fallback verwendet.",
  "h2_localizedasset": "3.2. LocalizedAsset",
  "p_localizedasset_1": "Wird verwendet, um Assets basierend auf der Sprache auszutauschen. Erkennt den Komponententyp automatisch. Unterstützt: <ul><li><strong>2D:</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Texturen (<code>RawImage</code>).</li><li><strong>Audio/Video:</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animation:</strong> <code>MeshFilter</code> (Meshes), <code>Renderer</code> (Materialien), <code>Animator</code> (Controller), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "Bei Komponenten mit der Option <strong>Play on Awake</strong> (wie <code>AudioSource</code>, <code>VideoPlayer</code>) fängt <code>LocalizedAsset</code> das Auto-Play korrekt ab, tauscht das Asset aus und startet dann die Wiedergabe, um die Wiedergabe nicht lokalisierter Inhalte zu vermeiden.",
  "h2_localizedprefab": "3.3. LocalizedPrefab",
  "p_localizedprefab_1": "Eine Komponente zur Lokalisierung ganzer Prefabs. Sie funktioniert nicht-destruktiv: Sie ändert das Original-Prefab nicht, sondern erstellt eine Instanz der lokalisierten Version als Kindobjekt und deaktiviert alle Skripte (<code>MonoBehaviour</code>), Renderer (<code>Renderer</code>) und Collider (<code>Collider</code>) auf dem Originalobjekt. Dies verhindert doppelte Logikausführung und visuelle Artefakte. Für den korrekten Betrieb zur Laufzeit ist ihre Ausführungsreihenfolge auf -100 (<code>[DefaultExecutionOrder(-100)]</code>) eingestellt, um sicherzustellen, dass sie vor anderen Skripten ausgeführt wird.",
  "h2_uitklocalization": "3.4. UITKLocalization",
  "p_uitklocalization_1": "Wird Objekten mit einem <code>UIDocument</code> hinzugefügt. Unterstützt die Lokalisierung von Labels, Buttons, <strong>TextField Placeholdern, DropdownField-Auswahlen, RadioButtonGroup- und ToggleButtonGroup-Optionen</strong>. Identifikatoren sind über Umbenennungen hinweg stabil, wenn IDs im UI Builder festgelegt werden.",
  "h2_localizeddropdown": "3.5. LocalizedDropdown",
  "p_localizeddropdown_1": "Wird zu <code>Dropdown</code> und <code>TMP_Dropdown</code> hinzugefügt, um deren Optionen zu übersetzen.",
  "h2_localizedbehaviour": "3.6. LocalizedBehaviour",
  "p_localizedbehaviour_1": "Eine Dienstprogrammkomponente, die es Ihren Skripten ermöglicht, auf Sprachänderungen zu reagieren. Sie findet und ruft automatisch Methoden auf, die mit dem Attribut <code>[OnLanguageChange]</code> markiert sind.",
  "h2_context_menu": "3.7. Kontextmenü „Analyze for Localization“",
  "p_context_menu_1": "Um schnell ein <code>LocalizedAsset</code> zu einem Objekt hinzuzufügen, können Sie mit der rechten Maustaste auf die gewünschte Komponente (z. B. <code>Image</code>, <code>AudioSource</code>) im Inspektor klicken und <strong>Analyze for Localization</strong> auswählen. Das Tool fügt die Komponente selbst hinzu und konfiguriert sie. (Dies ist optional, kann aber für die manuelle Hinzufügung verwendet werden).",
  "h1_loc_tool_window": "Das „Localization Tool“-Fenster",
  "h2_in_editor_preview": "4.1. In-Editor & Prefab-Vorschau",
  "p_preview_1": "Direkt unterhalb des Headers befindet sich die Dropdown-Liste <strong>Preview Language</strong>. Diese leistungsstarke Funktion ermöglicht es Ihnen, zu sehen, wie die Lokalisierung in jeder Sprache direkt im <strong>Scene</strong>-Fenster oder im <strong>Prefab-Modus</strong> aussehen wird, ohne das Spiel zu starten.",
  "li_preview_1": "<strong>Funktionsweise:</strong> Wählen Sie eine Sprache aus der Liste, und das Tool wendet sofort die entsprechenden Übersetzungen, Schriftarten, RTL-Einstellungen und Assets auf alle lokalisierbaren Objekte in der aktiven Szene oder dem geöffneten Prefab an.",
  "li_preview_2": "<strong>Platzhalter:</strong> Wenn im Tab <strong>Settings</strong> ein Platzhalterstil (z. B. <strong>Accents</strong> oder <strong>Brackets</strong>) ausgewählt ist, werden diese Platzhalter im Vorschaumodus anstelle der tatsächlichen Übersetzungen angezeigt. Dies ist ideal zum Testen des Layouts und zum Auffinden nicht lokalisierter Elemente.",
  "li_preview_3": "<strong>Sicherheit:</strong> Alle im Vorschaumodus vorgenommenen Änderungen sind temporär. Das Tool setzt automatisch alles in den Originalzustand zurück, wenn Sie „<strong>Revert to Original</strong>“ auswählen, das Fenster schließen, die Szene wechseln oder bevor eine Szene/ein Prefab gespeichert wird (dank der Komponente <code>LocalizationPreviewProtector</code>).",
  "li_preview_4": "<strong>Absturzsicherung:</strong> Das System sichert den Szenenzustand automatisch im Ordner <code>Library</code>, bevor eine Vorschau angezeigt wird. Wenn Unity abstürzt oder Sie es während der Vorschau zwangsweise beenden, erkennt das Tool die Wiederherstellungsdatei beim nächsten Start und bietet an, den ursprünglichen Szenenzustand wiederherzustellen.",
  "h2_tab_settings": "4.2. Tab „Einstellungen“",
  "p_settings_1": "Ihr Kontrollzentrum. Hier definieren Sie globale Regeln für den gesamten Lokalisierungsprozess.",
  "li_settings_1": "<strong>Key Generation Mode:</strong> Wählen Sie, wie Schlüssel erstellt werden sollen.<ul><li><code>UseTextAsKey</code>: Der Text selbst wird zum Schlüssel. Ideal für Prototypen.</li><li><code>AutoGenerateKeysOnly</code>: Der Schlüssel wird basierend auf der Hierarchie und dem Namen des Objekts generiert. Zuverlässig für die Produktion.</li><li><code>Manual</code>: Der Parser generiert **KEINE** Schlüssel automatisch. Er aktualisiert nur Objekte, denen bereits ein Schlüssel zugewiesen ist.</li><li><code>UseTextAsKeyWithCustomPriority</code> / <code>AutoGenerateWithCustomKeys</code>: Hybridmodi, die benutzerdefinierte Schlüssel über Code-Attribute ermöglichen.</li><li><strong>Sichere Migration:</strong> Sie können den Modus jederzeit ändern; das Tool versucht, vorhandene Übersetzungen zu migrieren.</li></ul>",
  "li_settings_2": "<strong>Language Management:</strong><ul><li><strong>Source Language:</strong> Die Sprache, die in Ihren Unity-Szenen/Prefabs verwendet wird (Entwicklungssprache).</li><li><strong>Default Language:</strong> Die Sprache, die beim ersten Spielstart ausgewählt wird, wenn die Systemsprache des Benutzers nicht unterstützt wird.</li><li><strong>Liste:</strong> Verwalten Sie unterstützte Sprachen, weisen Sie spezifische <strong>Font Assets</strong> zu und aktivieren Sie die <strong>RTL</strong>-Unterstützung.</li></ul>",
  "li_settings_3": "<strong>General Settings:</strong><ul><li><code>Parse Prefabs</code>: Aktiviert das Parsen von Prefabs.</li><li><code>Split files by language</code>: Legt fest, wie Übersetzungen gespeichert werden (eine große Datei oder eine Datei pro Sprache).</li><li><code>Translations Path</code>: Der Pfad zum Speichern von <code>.json</code> Übersetzungsdateien. Wichtig: Der Ordner muss sich innerhalb von <code>Assets/StreamingAssets/</code> befinden.</li></ul>",
  "li_settings_4": "<strong>Debugging & Testing:</strong><ul><li><code>Placeholder Style</code>: Wählen Sie den Stil für die Anzeige von Platzhaltern im Vorschaumodus.</li></ul>",
  "li_settings_5": "<strong>Live Updates:</strong> Einstellungen zum Laden von Übersetzungen von einem Remote-Server.",
  "li_settings_6": "<strong>Runtime API Key:</strong> Speichert Ihren API-Schlüssel für die automatische In-Game-Übersetzung sicher. Der Schlüssel wird im Build **obfuskiert** (verschlüsselt), um eine einfache Extraktion über die Zeichenkettensuche zu verhindern, aber denken Sie daran: Kein clientseitiges Geheimnis ist zu 100 % sicher.",
  "li_settings_7": "<strong>Asset Loading Strategy:</strong> Wahl zwischen <code>Resources (Legacy)</code> (synchrone Ladung, alte Methode) und <code>Addressables (Async)</code> (asynchrone Ladung, empfohlen für große Projekte).",
  "li_settings_8": "<strong>Auto-Translation:</strong> Verwendet jetzt das <strong>Translation Profiles</strong>-System. Sie sollten ein Profil-Asset erstellen (Rechtsklick -> Create -> Localization -> Translation Profile) oder ein Preset im Ordner <code>Localization/Presets</code> auswählen. Profile unterstützen: Google Translate, DeepL, Microsoft, OpenAI, Claude, Gemini, Ollama. Wählen Sie in den Einstellungen <strong>Active Text Profile</strong> (für Text) und <strong>Active Audio Profile</strong> (für TTS) aus.",
  "li_settings_9": "<strong>Debugging-Verbesserungen:</strong><ul><li><code>Show Hierarchy Icons</code>: Zeigt Status-Symbole (Grüner Haken / Gelbe Warnung) in der Hierarchie an. <strong>Leistungsoptimiert:</strong> Verwendet Caching, um selbst in großen Szenen keine Verzögerung zu gewährleisten.</li><li><code>Show Scene View Labels</code>: Visuelles Debugging direkt in der Szenenansicht. Beschriftungen sind interaktiv: Klicken Sie mit der rechten Maustaste auf eine Szenenbeschriftung, um den Lokalisierungsschlüssel sofort in die Zwischenablage zu kopieren.</li><li><code>Pseudo-Localization</code>: Testen Sie die UI-Layout-Erweiterung ohne Übersetzungen.</li></ul>",
  "li_settings_10": "<strong>Dev Tools:</strong> Am unteren Rand des Settings-Tabs finden Sie Dienstprogramm-Schaltflächen wie <strong>Clear Saved Language Pref</strong> (setzt die gespeicherte Sprache in PlayerPrefs zurück, sodass das Spiel wieder mit der Standardsprache startet).",
  "li_settings_11": "<strong>Technische Dropdown-Optionen:</strong> Eine Liste von Zeichenkettenwerten (Standard: 'Option A', 'Option B', 'Option C'), die der Parser beim Scannen von Dropdowns **ignoriert**. Dadurch bleibt Ihre Übersetzungstabelle frei von Unitys Standard-UI-Platzhaltertext.",
  "li_assistant_3": "<strong>Benutzerdefinierte Befehle:</strong> Sie sind nicht auf Presets beschränkt! Öffnen Sie den Inspektor Ihres <strong>Translation Profile</strong>-Assets, um Ihre eigenen Prompts hinzuzufügen (z. B. 'Rewrite in pirate style', 'Check spelling'). Diese werden automatisch im Kontextmenü des Editors angezeigt.",
  "li_font_glyph_workflow": "<strong>Workflow für TMP:</strong> 1. Scan ausführen. 2. Eine Sprache mit fehlenden Glyphen auswählen. 3. Auf <strong>'Copy Character Set'</strong> klicken. 4. Window -> TextMeshPro -> Font Asset Creator öffnen. 5. Den Inhalt der Zwischenablage in das Feld 'Character Sequence (Custom Range)' einfügen, um einen Atlas zu generieren, der genau die Zeichen enthält, die Ihr Spiel benötigt.",
  "li_assets_addressables_naming": "<strong>Namenskonvention:</strong> Beim Scannen setzt das Tool die Addressable Adressen automatisch auf das Format <code>{Category}/{Language}/{Key}</code>. **Benennen Sie** diese Adressen nicht manuell um, da der LocalizationManager auf dieses spezifische Format angewiesen ist, um Assets zur Laufzeit zu laden.",
  "p_ai_audio_economy": "<strong>Kostenersparnis:</strong> Das Tool berechnet einen MD5-Hash Ihres Textes und generiert Audiodateien nur neu, wenn sich der Quelltext geändert hat, wodurch Ihre API-Gutschriften gespart werden. Wenn Sie eine Übersetzung ändern, markiert das System nur diese spezifische Audiodatei als 'Veraltet'. Verwenden Sie 'Generate Missing/Outdated', um nur das zu regenerieren, was sich geändert hat, wodurch API-Gutschriften gespart werden. Das Tool hashiert Ihren Text und generiert Audiodateien nur neu, wenn sich der Quelltext geändert hat, wodurch Ihre API-Gutschriften durch intelligentes Batching gespart werden.",
  "li_content_regex_example": "<strong>Benutzerdefiniertes Wrapper-Beispiel:</strong> Wenn Sie eine benutzerdefinierte Funktion wie <code>MyGame.Loc(\"KEY\")</code> verwenden, fügen Sie eine Skript-Parsing-Regel mit dem Regex hinzu: <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>. Der Parser erfasst nun Schlüssel aus Ihrem benutzerdefinierten Code.",
  "li_settings_icons_legend": "<strong>Legende der Hierarchie-Symbole:</strong><br>🟢 (Grüner Haken): Lokalisiert & Schlüssel gesetzt.<br>🔴 (Roter Fehler): Lokalisierte Komponente vorhanden, aber <strong>Schlüssel fehlt</strong>.<br>🟡 (Gelbe Warnung): Text-/Bildkomponente gefunden, aber <strong>keine Lokalisierungskomponente</strong> angehängt.<br>🐛 (Bug): Objekt wird von den Einstellungen <strong>ignoriert</strong>.",
  "h2_tab_content": "4.3. Tab „Inhalt“ (Überarbeitet in v1.1)",
  "p_content_1": "Hier teilen Sie dem Tool mit, wo genau nach Text gesucht werden soll. Die Benutzeroberfläche wurde für eine bessere Benutzerfreundlichkeit komplett überarbeitet.",
  "li_content_1": "<strong>Scenes to Parse:</strong> Ziehen Sie alle Szenen zur Analyse hierher.",
  "li_content_2": "<strong>Prefab Folders:</strong> Geben Sie Ordner mit Prefabs an. Unterstützt jetzt Paginierung und Suche für große Projekte.",
  "li_content_3": "<strong>Dynamic Texts:</strong> Geben Sie hier Zeichenketten ein, die ausschließlich im Code erstellt werden (z. B. „Game Over“).",
  "li_content_4": "<strong>Parsing Configuration:</strong> Geben Sie Skripte/Objekte an, die ignoriert werden sollen. Unter <strong>Attributes to Scan</strong> können Sie benutzerdefinierte Attributnamen hinzufügen (z. B. <code>[Header]</code>, <code>[TermsPopup]</code>), damit der Parser diese Felder als lokalisierbaren Text behandelt.",
  "li_content_5": "<strong>Pin:</strong> Mit dieser Funktion können Sie ein Objekt aus der Szene an die Ignorierliste „anheften“. Anstelle einer temporären Referenz auf das Objekt speichert das Tool seinen vollständigen Pfad in der Hierarchie, wodurch das Ignorieren zwischen Sitzungen persistent wird.",
  "li_content_6": "<strong>Script Parsing Rules:</strong> Definieren Sie benutzerdefinierte Regex-Regeln, um Schlüssel in Ihrem Code zu finden. <br>🔥 <strong>Neu:</strong> Verwenden Sie die Schaltfläche <strong>'Add Preset'</strong>, um sofort Regeln für Drittanbieter-Assets (I2 Localization, Unity Localization) oder Standard-Wrapper hinzuzufügen.",
  "li_content_7": "<strong>Dynamic Key Prefixes:</strong> Liste der Präfixe für Schlüssel (z. B. <code>Item_</code>), die während der Bereinigung (Remove Missing Keys) **nicht** gelöscht werden, auch wenn der Parser sie nicht in der Szene gefunden hat.",
  "h2_tab_actions": "4.4. Tab „Aktionen“",
  "p_actions_1": "Der Haupt-Arbeits-Tab.",
  "li_actions_1": "<strong>Parsing:</strong><ul><li><strong>Update Keys:</strong> Vollständiger Projekt-Scan, definiert durch die Einstellungen des Tabs 'Content'.</li><li><strong>Scan Selected Assets:</strong> Scannt **NUR** die Dateien/Ordner, die aktuell in der Projektansicht ausgewählt sind. Sicherer für Teilaktualisierungen, da 'Remove Missing Keys' automatisch deaktiviert wird.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor:</strong> Öffnet ein separates, bequemeres Fenster zum Bearbeiten aller Übersetzungen.",
  "li_actions_3": "<strong>Data Management:</strong> Wird für den Datenaustausch mit Übersetzern verwendet (Export/Import nach CSV/XML/YAML/XLIFF, Import aus Google Sheets).",
  "li_actions_4": "<strong>Auto-Translation:</strong> Füllt alle leeren Übersetzungszeichenketten automatisch mithilfe des aktiven <strong>Translation Profile</strong>.",
  "li_actions_5": "<strong>Danger Zone:</strong> Enthält Schaltflächen zum vollständigen Entfernen aller Lokalisierungskomponenten aus dem Projekt. Mit Vorsicht verwenden!",
  "h2_tab_assets": "4.5. Tab „Assets“",
  "p_assets_1": "Dieser Tab ist vollständig der Lokalisierung von Nicht-Text-Ressourcen gewidmet.",
  "li_assets_1": "<strong>Erstellen Sie eine Ordnerstruktur (optional):</strong> Klicken Sie in Abschnitt <strong>2. Asset Folder Generation</strong> auf <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Kategorien und Benennungsregeln konfigurieren:</strong> Stellen Sie in Abschnitt <strong>3. Asset Categories & Scanning</strong> sicher, dass die <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) mit Ihren Dateien übereinstimmt (z. B. <code>button_ok_en.png</code>).",
  "li_assets_3": "<strong>Platzieren Sie Ihre Assets:</strong> Legen Sie die lokalisierten Assets in die Ordner.",
  "li_assets_4": "<strong>Assets scannen:</strong> Klicken Sie in Abschnitt <strong>4. Automation</strong> auf <strong>Scan Assets & Update Tables</strong>. Der Bereinigungsprozess ist sicherer geworden: Jetzt werden nur alte Tabellendateien (<code>.asset</code>) gelöscht, nicht der gesamte Ordner.",
  "li_assets_5": "<strong>Assets mit Objekten verknüpfen:</strong> Klicken Sie auf <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Addressables-Integration:</strong> Wenn der <strong>Addressables</strong>-Modus aktiviert ist, werden Assets während des Scannens automatisch in Addressables-Gruppen mit Adressen in der Form <code>{Category}/{Language}/{Key}</code> registriert.",
  "h2_tab_report": "4.6. Tab „Bericht“",
  "p_report_1": "Nach jedem Parsing zeigt dieser Bericht das vollständige Bild Ihres Lokalisierungsstatus.",
  "li_report_1": "<strong>Kategorien:</strong> Alle Schlüssel, Hinzugefügt, Aktualisiert (Text geändert), Entfernt, Duplikate, Migriert, Übersprungen (unverändert).",
  "li_report_2": "<strong>Erweiterte Suche:</strong> Klicken Sie neben einem beliebigen Eintrag auf die Schaltfläche <strong>Find</strong>, um das entsprechende Objekt im Projekt sofort zu finden. Die Suche funktioniert asynchron, blockiert den Editor nicht und durchsucht alle Szenen und Prefabs.",
  "h1_translation_editor": "Übersetzungstabellen-Editor",
  "p_editor_1": "Wird über <strong>Tools -> Localization -> Translation Table Editor</strong> geöffnet. Dies ist das Hauptwerkzeug zum manuellen Bearbeiten von Übersetzungen.",
  "li_editor_1": "<strong>Intelligente Gruppierung:</strong> Schlüssel für Plurale und Geschlecht (z. B. <code>apple_count_one</code>, <code>apple_count_few</code>) werden automatisch zu einklappbaren Gruppen zusammengefasst.",
  "li_editor_2": "<strong>Erweiterte Bearbeitung:</strong> Klicken Sie auf eine Zelle, um das Popup <strong>MultiLineEditWindow</strong> zu öffnen. Es zeigt den Quelltext zum Vergleich an und validiert Platzhalter.",
  "li_editor_3": "<strong>Erweiterte Auswahl (Neu):</strong> Unterstützt die Auswahl einzelner Zellen, Zeilen oder ganzer Spalten (Sprachen).",
  "li_editor_4": "<strong>Massenaktionen (Neu):</strong> Klicken Sie mit der rechten Maustaste auf eine Auswahl, um Massenvorgänge durchzuführen: Ausgewählte Zellen automatisch übersetzen, Inhalt löschen oder Schlüssel löschen.",
  "li_editor_5": "<strong>Intelligente Navigation (Neu):</strong> Navigieren Sie in der Tabelle mithilfe von Tastaturpfeilen und Tastenkombinationen (Strg+S zum Speichern, Strg+Z/Y für Rückgängig/Wiederherstellen).",
  "li_editor_6": "<strong>Validierungsfilter:</strong> Verwenden Sie erweiterte Filter, um Ihr Projekt zu prüfen: <ul><li><strong>Has Length Issues:</strong> Warnung, wenn die Übersetzung signifikant länger als die Quelle ist (+X%).</li><li><strong>Outdated Audio:</strong> Zeigt Schlüssel an, bei denen sich der Text geändert hat, das Audio aber nicht neu generiert wurde.</li><li><strong>Missing Placeholders:</strong> Erkennt, ob {0} in der Quelle vorhanden, aber in der Übersetzung fehlt.</li></ul>",
  "li_editor_7": "<strong>Audio-Status:</strong> Die Tabelle zeigt jetzt den Status von Audiodateien an. Wenn sich der Text geändert hat, die Audiodatei aber alt bleibt (Hash-Fehlübereinstimmung), wird eine Warnung (gelbes Symbol) angezeigt.",
  "li_editor_8": "<strong>Erweitertes Kontextmenü:</strong> Befehle hinzugefügt: <strong>Generate Audio</strong> (Sprachausgabe für ausgewählte Zellen erstellen) und <strong>AI Assistant</strong> (Befehle wie „Fix Grammar“ oder „Shorten“ mithilfe des ausgewählten KI-Profils ausführen).",
  "h1_ai_profiles": "KI & Übersetzungsprofile (Neu v1.1)",
  "h2_ai_profiles_overview": "6.1. Übersetzungsprofile",
  "p_ai_intro": "Version 1.1 führt ein neues <strong>Translation Profile</strong>-System (ScriptableObject) ein. Dadurch werden die Einstellungen für Übersetzungsdienste aus den globalen Einstellungen in einzelne Profil-Assets verschoben, sodass Sie Konfigurationen einfach wechseln können.",
  "li_ai_1": "<strong>Profil erstellen:</strong> Rechtsklick in der Projektansicht -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Dienste:</strong> Unterstützt DeepL, Google Translate, Microsoft Azure und <strong>Custom AI</strong>.",
  "li_ai_3": "<strong>Einstellungen:</strong> Jedes Profil speichert seinen eigenen API-Schlüssel, Limits (Batch-Größe, maximale Zeichen) und Modelleinstellungen.",
  "li_ai_4": "<strong>AIPresetsGenerator:</strong> Verwenden Sie den integrierten Generator, um schnell Profile für gängige Dienste (OpenAI, Gemini, Claude, Ollama) zu erstellen.",
  "h2_custom_ai": "6.2. Benutzerdefinierte KI & Modelle",
  "p_custom_ai": "Der Diensttyp <strong>Custom AI</strong> ermöglicht es Ihnen, jedes LLM über die REST-API zu verbinden.",
  "li_custom_ai_1": "<strong>GenericAIService:</strong> Eine flexible Implementierung, die mit OpenAI-kompatiblen APIs (einschließlich lokaler LLMs über Ollama) kommunizieren kann.",
  "li_custom_ai_2": "<strong>Vorlagen:</strong> Passen Sie die JSON-Vorlage des Anforderungstextes an die Anforderungen Ihrer API an.",
  "li_custom_ai_3": "<strong>Integrierte Sicherheitsfunktionen:</strong> Repariert automatisch fehlerhafte Formatierungs-Tags (wie <ph0>), die häufig von KI-Modellen zurückgegeben werden, um zuverlässige und konsistente Übersetzungen zu gewährleisten.",
  "h2_ai_context": "6.3. Kontext & Glossar",
  "p_ai_context": "Um die Übersetzungsqualität zu verbessern, erhält die KI nun zusätzlichen Kontext:",
  "li_context_1": "<strong>Entwicklerhinweise:</strong> Kommentare aus der Übersetzungstabelle werden als Kontext an die KI weitergegeben.",
  "li_context_2": "<strong>Objektpfad:</strong> Wenn kein Kommentar existiert, wird der Hierarchiepfad des Objekts (z. B. <code>MainMenu/Canvas/StartButton</code>) als Fallback-Kontext verwendet.",
  "li_context_3": "<strong>Glossar:</strong> Sie können ein CSV-Glossar in das Profil laden, um spezifische Übersetzungen für Begriffe und Namen zu erzwingen.",
  "h2_ai_assistant": "6.4. KI-Assistenten-Befehle",
  "p_ai_assistant": "Im Übersetzungstabellen-Editor können Sie jetzt benutzerdefinierte KI-Befehle für ausgewählte Zellen über das Kontextmenü ausführen (Rechtsklick -> AI: ...).",
  "li_assistant_1": "<strong>Konfigurierbar:</strong> Definieren Sie Befehle in Ihrem Übersetzungsprofil (z. B. „Fix Grammar“, „Make Formal“, „Shorten for UI“).",
  "li_assistant_2": "<strong>Stapelverarbeitung:</strong> Wählen Sie mehrere Zellen aus, um den Befehl auf alle gleichzeitig anzuwenden.",
  "h1_usage_examples": "Anwendungsbeispiele",
  "h2_example_components": "7.1. Vorgefertigte Komponenten und Beispiele",
  "p_example_components_1": "Das Projekt enthält vorgefertigte Skripte, die als ausgezeichnete Beispiele dienen.",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code>:</strong> Eine vorgefertigte Komponente zum Erstellen einer UI-Dropdown-Liste für den Sprachwechsel. Sie findet automatisch alle verfügbaren Sprachen und verwaltet deren Umschaltung.<br><strong>Anwendung:</strong> Fügen Sie die Komponente <code>LanguageSelector</code> einfach Ihrer Szene hinzu (z. B. auf einem leeren GameObject) und geben Sie Ihre <code>TMP_Dropdown</code> im Inspektor an.",
  "li_example_components_2": "<strong>Code-Beispiele:</strong> Um erweiterte Techniken wie die Arbeit mit <code>[LocalizableField]</code>, der <code>_()</code>-Funktion, Pluralen und Geschlecht zu erlernen, studieren Sie die Dateien <code>StatPurchaseTest.cs</code> und <code>TestLocalization.cs</code>. Sie demonstrieren klar die Implementierung aller Hauptfunktionen des Tools im Code.",
  "h2_example_attribute": "7.2. [LocalizableField] Attribut",
  "p_example_attribute_1": "The most powerful way to localize script variables. It works with <strong>private, protected, and public</strong> fields. The parser recursively handles <strong>Arrays, Lists</strong>, and <strong>Nested Serializable Classes</strong>. It can even generate keys for other attributes (like <code>[Header]</code> or <code>[Tooltip]</code>) if configured in Settings.",
  "code_example_attribute": "using Ankonoanko.Localization;\nusing UnityEngine;\nusing System.Collections.Generic;\n\npublic class HeroDialog : MonoBehaviour\n{\n    // 1. Private fields work perfectly\n    [LocalizableField]\n    private string secretWhisper = \"It's a secret to everybody.\";\n\n    // 2. Custom Key Override\n    [LocalizableField(\"hero_greeting_main\")]\n    public string greeting = \"Welcome, traveler!\";\n\n    // 3. Lists and Arrays (Keys become: inventory_header_0, inventory_header_1...)\n    [LocalizableField]\n    public string[] inventoryHeaders = new string[] { \"Weapons\", \"Potions\", \"Armor\" };\n\n    // 4. Nested Serializable Classes (Recursion supported)\n    [System.Serializable]\n    public class BossInfo\n    {\n        [LocalizableField] public string name;\n        [LocalizableField] public string title;\n    }\n    public BossInfo currentBoss; // Parser drills down into this\n\n    // 5. List of Nested Objects\n    [LocalizableField]\n    public List<BossInfo> bossList = new List<BossInfo>();\n\n    // 6. Custom Key on List (Keys: dungeon_hints_list_0, dungeon_hints_list_1...)\n    [LocalizableField(\"dungeon_hints_list\")]\n    public List<string> dungeonHints = new List<string>\n    {\n        \"Beware of traps.\",\n        \"Use fire against trolls.\"\n    };\n\n    // 7. Interpolated Strings (Parser reads the raw format string)\n    [LocalizableField(\"fire_sword_name\")]\n    public string ItemName1 = $\"Fire Sword {0}\";\n}",
  "h2_example_function": "7.3. _() Funktion und [OnLanguageChange] Attribut",
  "p_example_function_1": "Verwenden Sie die Funktion <code>_()</code> für dynamischen Text, der sich während des Spiels ändert. Die Methode, die die Benutzeroberfläche aktualisiert, sollte mit dem Attribut <code>[OnLanguageChange]</code> markiert werden, damit sie beim Wechsel der Sprache automatisch aufgerufen wird. Zu diesem Zweck wird dem Objekt automatisch eine Komponente <code>LocalizedBehaviour</code> hinzugefügt.",
  "code_example_function": "// Um den kurzen _()-Aufruf zu verwenden, fügen Sie diese Zeilen hinzu\nusing static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization; // Erforderlich für [OnLanguageChange]\nusing UnityEngine;\nusing TMPro;\nusing System.Collections.Generic;\npublic class PlayerHUD : MonoBehaviour\n{\n    [SerializeField] private TMP_Text scoreText;\n    private int score = 100;\n    private string playerName = \"Alex\";\n    \n    void Start()\n    {\n        UpdateUI(); // Erstes Update\n    }\n    \n    // Diese Methode wird automatisch aufgerufen, wenn sich die Sprache ändert\n    [OnLanguageChange]\n    void UpdateUI()\n    {\n        // 1. Indizierte Platzhalter (wie in string.Format)\n        // Schlüssel: \"score_label\", Text in Datei: \"Score: {0}\"\n        scoreText.text = _(\"score_label\", score); // Ergebnis: \"Score: 100\"\n        \n        // 2. Benannte Platzhalter (empfohlen für bessere Lesbarkeit)\n        // Schlüssel: \"welcome_message\", Text: \"Welcome, {username}!\"\n        string welcomeText = _(\"welcome_message\", new { username = playerName });\n        \n        // Für komplexe Fälle oder hohe Leistung\n        var args = new Dictionary<string, object> { { \"username\", playerName } };\n        string welcomeText2 = _(\"welcome_message\", args);\n    }\n}",
  "h2_example_plurals": "7.4. Plurale und Geschlecht",
  "p_example_plurals_1": "Das Tool verwendet jetzt genauere Regeln für verschiedene Sprachgruppen.",
  "code_example_plurals": "using static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Schlüssel: \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Texte: \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Wählt automatisch die korrekte Form\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Schlüssel: \"user_greeted_male\", \"user_greeted_female\"\n        // Texte: \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "h1_important_notes": "Wichtige Hinweise und Warnungen",
  "li_notes_1": "<strong>Backups:</strong> Erstellen Sie immer ein Backup über <strong>Translation Table Editor -> Manage Backups</strong>, bevor Sie größere Änderungen vornehmen. Backups werden im Ordner <code>LocalizationBackups</code> **im Projektstammverzeichnis (außerhalb des Assets-Ordners)** gespeichert, um Ihr Unity-Projekt sauber zu halten und die Importzeiten zu reduzieren.",
  "li_notes_2": "<strong>API-Schlüsselsicherheit:</strong> Der Schlüssel für die Arbeit im Editor wird lokal auf Ihrem Computer gespeichert (in <code>EditorPrefs</code>) und gelangt nicht in das Repository. Für Schlüssel, die im Spiel-Build benötigt werden, verwenden Sie den Abschnitt <strong>Runtime API Key</strong>.",
  "li_notes_3": "<strong><code>StreamingAssets</code> Ordner:</strong> Übersetzungsdateien müssen sich in einem Unterordner von <code>Assets/StreamingAssets/</code> befinden, um in den Spiel-Build aufgenommen zu werden.",
  "li_notes_4": "<strong>„Idiotensicherheit“:</strong> Das Tool schützt Sie automatisch davor, temporäre Daten aus dem Vorschaumodus versehentlich in einer Szene oder einem Prefab zu speichern.",
  "li_notes_5": "<strong>Leistung:</strong> Der <code>_()</code>-Aufruf ist schnell, aber in Schleifen, die in jedem Frame ausgeführt werden (z. B. in <code>Update</code>), versuchen Sie, das Ergebnis in einer Variablen zwischenzuspeichern.",
  "li_notes_6": "<strong>Ausschließen von <code>LanguageSelector</code> vom Parsing:</strong> Das Objekt mit der Komponente <code>LanguageSelector</code> und sein <code>TMP_Dropdown</code> müssen zur Liste <strong>Ignore Specific Objects</strong> im Tab <strong>Content</strong> hinzugefügt werden. Dies ist notwendig, um zu verhindern, dass der Parser zusätzliche Schlüssel für die Dropdown-Optionen erstellt, da das <code>LanguageSelector</code>-Skript diese zur Laufzeit dynamisch füllt. Das Ignorieren verhindert Konflikte und hält die Übersetzungsdateien sauber.",
  "li_notes_7": "<strong>Schriftarten für <code>LanguageSelector</code>:</strong> Damit die ausgewählte Sprache im <code>TMP_Dropdown</code> ihre Schriftart korrekt aktualisiert, fügen Sie dem untergeordneten <strong>Label</strong>-Objekt des Dropdown manuell eine leere <code>LocalizedText</code>-Komponente hinzu und aktivieren Sie das Kontrollkästchen <code>isStyleOnly</code>.",
  "li_notes_addressables_code": "<strong>Code & Addressables:</strong> Wenn Sie in den Modus <strong>Addressables (Async)</strong> wechseln, **MÜSSEN** Sie <code>GetLocalizedAssetAsync<T>()</code> in Ihren Skripten verwenden. Der Aufruf des synchronen <code>GetLocalizedAsset<T>()</code> gibt null zurück und protokolliert eine Warnung, um das Einfrieren des Hauptthreads zu verhindern.",
  "li_content_regex_presets": "<strong>Ignorierte Regex-Muster:</strong> Klicken Sie auf <strong>'Add Common Pattern'</strong>, um dynamische Inhalte wie *URLs, E-Mails, Daten, Preise und UUIDs* schnell von der Übersetzung auszuschließen, ohne Regex manuell schreiben zu müssen.",
  "li_notes_addressables_sync_warning": "<strong>Sync vs Async:</strong> Wenn Sie in den Modus <strong>Addressables (Async)</strong> wechseln, **MÜSSEN** Sie Ihren Code aktualisieren, um <code>GetLocalizedAssetAsync<T>()</code> zu verwenden. Der Aufruf der synchronen Methode gibt null zurück und protokolliert eine Warnung, um das Einfrieren des Hauptthreads zu vermeiden.",
  "q_faq_custom_keys_attribute": "Kann ich mein eigenes Attribut für Schlüssel anstelle von [LocalizableField] verwenden?",
  "a_faq_custom_keys_attribute": "Ja. Im <strong>Content Tab</strong> unter 'Attributes to Scan' können Sie jeden Attributnamen hinzufügen (z. B. <code>[Header]</code>, <code>[TermsPopup]</code>). Der Parser behandelt jedes Zeichenkettenfeld mit diesem Attribut als lokalisierbar.",
  "q_faq_tts_voices": "Wie weise ich bestimmten Charakteren bestimmte Stimmen zu?",
  "a_faq_tts_voices": "Verwenden Sie in Ihrem <strong>Translation Profile</strong> (Inspektor) die Liste 'Voice Mappings'. Sie können ein Regex-Muster (z. B. <code>^hero_.*</code>) einer bestimmten Voice-ID zuordnen. Der Generator wählt automatisch die korrekte Stimme basierend auf dem Schlüsselnamen aus.",
  "h1_extending": "Erweiterung der Funktionalität",
  "h2_custom_parser": "9.1. Erstellen eines benutzerdefinierten Parsers",
  "p_custom_parser_1": "Sie können das System ganz einfach erweitern, um benutzerdefinierte Komponenten zu unterstützen, indem Sie Ihre eigene Parser-Klasse erstellen.",
  "li_custom_parser_1": "Erstellen Sie ein neues C#-Skript im Ordner <strong>Editor</strong> Ihres Projekts.",
  "li_custom_parser_2": "Kopieren Sie die folgende Vorlage hinein.",
  "li_custom_parser_3": "Passen Sie die Logik an Ihre Komponente an.",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing UnityEngine;\nusing Ankonoanko.Localization;\n\n// VORLAGE zum Erstellen eines Parsers für eine benutzerdefinierte Komponente.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings)\n    {\n        // 1. Prüfen Sie, ob das Objekt die benötigte benutzerdefinierte Komponente hat.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Beenden, wenn die Komponente nicht gefunden wird\n        }\n        \n        // 2. Holen Sie den Text aus den Feldern der benutzerdefinierten Komponente.\n        string titleText = component.Title;\n        \n        // 3. Prüfen Sie, ob der Text für die Lokalisierung gültig ist.\n        if (TextParser.IsValidLocalizableText(titleText))\n        {\n            // 4. Generieren Sie den Schlüssel und die Quelle mithilfe von Helfern von TextParser.\n            string key = TextParser.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode);\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            \n            // 5. Geben Sie das Ergebnis zurück.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Wiederholen Sie dies für andere Felder...\n        // (ein Suffix kann hinzugefügt werden, um Schlüssel eindeutig zu machen)\n        string descriptionText = component.Description;\n        if (TextParser.IsValidLocalizableText(descriptionText))\n        {\n            string key = TextParser.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode) + \"_description\";\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "h1_faq": "FAQ & Fehlerbehebung",
  "h1_migration_tool": "Migrationstool",
  "p_migration_tool_desc": "Tool für den Übergang von anderen Lokalisierungssystemen (I2 Localization, Unity Localization).",
  "p_migration_tool_access": "Zugriff über <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "h2_migration_tool_features": "Merkmale",
  "li_migration_tool_setup": "<strong>Schritt 0: Setup:</strong> Konfigurieren Sie Komponentennamen (z. B. <code>Localize</code> für I2) und Felder, in denen der Schlüssel gespeichert ist. Presets sind verfügbar.",
  "li_migration_tool_import": "<strong>Schritt 1: Datenimport:</strong> Importieren Sie CSV (I2) oder XLIFF (Unity Loc) Dateien, um eine Schlüsseldatenbank zu erstellen.",
  "li_migration_tool_converter": "<strong>Schritt 2: Komponentenkonverter:</strong> Scannen Sie Szenen und Prefabs. Ersetzt automatisch alte Komponenten (z. B. <code>Localize</code>) durch <code>LocalizedText</code> / <code>LocalizedAsset</code> und überträgt Schlüssel.",
  "li_migration_tool_safemode": "<strong>Safe Mode & Emergency Stubs:</strong> Komponenten werden deaktiviert anstatt gelöscht. Enthält die kritische Funktion **Emergency Stubs** (aktiviert über das Define-Symbol ANKO_ENABLE_MIGRATION_STUBS): generiert gefälschte Platzhalterklassen für I2 Localization oder Unity Localization, sodass Ihr Projekt sofort nach dem Entfernen dieser Plugins kompiliert werden kann. Dies verhindert Fehler wie \"Der Typname 'Localize' konnte nicht gefunden werden\" und gibt Ihnen Zeit, Ihren Code ordnungsgemäß auf das neue System umzustellen. Enable Stubs ermöglicht es Ihnen, Kompilierungsfehler nach dem Löschen des alten Lokalisierungs-Plugins zu beheben.",
  "h1_font_glyph_manager": "Font & Glyph Manager",
  "p_font_glyph_manager_access": "Zugriff über <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "h2_font_glyph_manager_features": "Merkmale",
  "li_font_glyph_analyze": "Analysiert alle Übersetzungen und prüft, ob die zugewiesene Schriftart (TMP_FontAsset) alle verwendeten Zeichen unterstützt.",
  "li_font_glyph_missing": "Zeigt eine Liste fehlender Glyphen an.",
  "li_font_glyph_copy": "Ermöglicht das Kopieren aller eindeutigen Sprachzeichen für die Generierung des Schriftart-Atlas.",
  "h1_pseudo_tool": "Pseudo-Lokalisierungstool",
  "p_pseudo_tool_desc": "Tool zum Testen von UI-Layouts mit erweitertem Text, um Sprachen mit längerem Text zu simulieren.",
  "p_pseudo_tool_access": "Zugriff über <strong>Tools -> Anko Localization Tool -> Pseudo-Localization Generator</strong>.",
  "h2_pseudo_tool_features": "Merkmale",
  "li_pseudo_tool_setup": "<strong>Pseudo-Localization Generator:</strong> Generieren Sie eine gefälschte Sprache (z. B. [E-r-w-e-i-t-e-r-t]), um Ihr UI-Layout einem Stresstest zu unterziehen. Unterstützt die Erweiterung der Textlänge um einen Faktor (z. B. +40%), um die Texterweiterung von Deutsch/Russisch zu simulieren.",
  "h1_ai_audio": "KI Audio / Text-to-Speech",
  "h2_ai_audio_setup": "Setup",
  "li_ai_audio_profile": "Wählen Sie in den <strong>Settings</strong> das <strong>Active Audio Profile</strong> aus (z. B. OpenAI TTS oder ElevenLabs).",
  "h2_ai_audio_usage": "Anwendung",
  "li_ai_audio_generate": "Wählen Sie im <strong>Translation Table Editor</strong> Zeilen/Zellen aus -> Rechtsklick -> <strong>Generate Audio</strong>.",
  "li_ai_audio_save": "Dateien werden in dem im Profil angegebenen Ordner gespeichert.",
  "li_ai_audio_hash": "<strong>Smart Update & Hashing:</strong> Das Tool berechnet einen MD5-Hash Ihres Textinhalts und generiert Audiodateien nur neu, wenn sich der Quelltext geändert hat, wodurch Ihre API-Gutschriften gespart werden. Es erkennt, ob sich die Übersetzung seit der letzten Audio-Generierung geändert hat. Der Editor hebt diese Zeilen mit einem 'Outdated'-Symbol (gelb) hervor, sodass Sie NUR geänderte Zeilen aktualisieren können. Diese intelligente Stapelverarbeitungsfunktion verhindert unnötige API-Aufrufe und reduziert Kosten beim Regenerieren von Audio. Das Tool hashiert Ihren Text und generiert Audiodateien nur neu, wenn sich der Quelltext geändert hat, wodurch Ihre API-Gutschriften gespart werden.",
  "li_ai_audio_voice_mapping": "<strong>Voice Mapping (Multi-Speaker):</strong> Weisen Sie verschiedenen Charakteren automatisch unterschiedliche KI-Stimmen zu. Verwenden Sie in Ihrem <strong>Translation Profile</strong> die Liste 'Voice Mappings', um ein Regex-Muster (z. B. <code>^hero_.*</code>) mit einer bestimmten Voice-ID zu verknüpfen. Das Tool verwendet automatisch die korrekte Stimme basierend auf dem Schlüsselnamen.",
  "h2_example_components_updated": "Aktualisierte LanguageSelector.cs",
  "p_example_components_updated": "Der Code hat sich geändert. Das Laden der Sprache (insbesondere bei Verwendung von Addressables) ist jetzt asynchron.",
  "li_example_components_old": "<strong>Alt:</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (synchron/void).",
  "li_example_components_new": "<strong>Neu:</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code> (asynchron/Coroutine).",
  "h2_localizedasset_updated": "Asynchrone Ladung von LocalizedAsset",
  "p_localizedasset_updated": "Die Komponente unterstützt jetzt die asynchrone Ladung. Beachten Sie, dass beim Wechsel der Sprache eine leichte Verzögerung auftreten kann, wenn Assets von Cloud/Disk geladen werden (Addressables).",
  "h2_faq_installation": "10.1. Installation & Schnellstart",
  "q_faq_installation_1": "Was passiert, wenn mein Projekt das Paket com.unity.nuget.newtonsoft-json bereits von einem anderen Asset enthält? Versucht der Abhängigkeits-Installer, es zu aktualisieren oder zu ignorieren?",
  "a_faq_installation_1": "Der Installer prüft auf das Vorhandensein des Typs Newtonsoft.Json.JsonConvert. Wenn der Typ existiert, betrachtet er die Abhängigkeit als erfüllt und versucht nicht, das Paket zu installieren oder zu aktualisieren. Dies geschieht, um Versionskonflikte zu vermeiden.",
  "q_faq_installation_2": "Ich habe versehentlich auf \"Skip for Now\" geklickt und \"Don't ask again\" für optionale Abhängigkeiten (z. B. für CSV-Unterstützung) aktiviert. Wie kann ich das Installer-Fenster erneut aufrufen, um sie zu installieren?",
  "a_faq_installation_2": "Sie können jederzeit manuell eine Abhängigkeitsprüfung über das Menü Tools -> Localization -> Check Dependencies auslösen. Dadurch wird das Flag \"Don't ask again\" zurückgesetzt und das Fenster mit allen fehlenden optionalen Paketen erneut angezeigt.",
  "q_faq_installation_3": "Das Tool hat LocalizationSettings.asset nicht in Assets/Resources erstellt. Warum könnte das passiert sein, und kann ich es manuell über das Menü Assets -> Create erstellen?",
  "a_faq_installation_3": "Dies kann passieren, wenn Sie keinen Ordner Assets/Resources haben. Das Tool versucht, ihn zu erstellen, aber Dateisystemberechtigungen könnten dies verhindern. Ja, Sie können das Asset manuell erstellen: Rechtsklick im Resources-Ordner, wählen Sie Create -> Localization -> Settings. Das Tool findet es automatisch.",
  "q_faq_installation_4": "Kann ich die Datei LocalizationSettings.asset in einen anderen Resources-Ordner verschieben, z. B. Assets/MyGame/Resources? Wird das Tool sie trotzdem finden?",
  "a_faq_installation_4": "Ja. Das Tool verwendet Resources.Load(), das in allen Ordnern mit dem Namen Resources in Ihrem Projekt nach einem Asset anhand des Namens sucht. Wichtig ist, dass die Datei ihren Namen LocalizationSettings.asset behält.",
  "q_faq_installation_5": "Der Abhängigkeits-Installer ist eingefroren oder hat einen Fehler ausgegeben. Kann ich die Abhängigkeiten (Newtonsoft Json, Editor Coroutines) manuell über den Unity Package Manager installieren?",
  "a_faq_installation_5": "Ja. Sie können Window -> Package Manager öffnen, auf das \"+\"-Symbol klicken und \"Add package by name...\" auswählen. Geben Sie die Paketnamen ein: com.unity.nuget.newtonsoft-json und com.unity.editorcoroutines.",
  "h2_faq_components": "10.2. Kernkomponenten",
  "q_faq_components_1": "Die Komponente LocalizedPrefab deaktiviert MonoBehaviours auf dem Originalobjekt. Was passiert, wenn das Originalobjekt ein Skript hat, das andere Objekte erstellt oder sich in Awake() für Ereignisse anmeldet? Wird dieser Code ausgeführt?",
  "a_faq_components_1": "Nein, das wird er nicht. Das Deaktivieren eines MonoBehaviour verhindert, dass alle \"magischen\" Methoden von Unity aufgerufen werden, einschließlich Awake(), OnEnable() und Start(). Dies ist beabsichtigt, um doppelte Logikausführung zu vermeiden. Die gesamte Initialisierung sollte in Skripten auf den lokalisierten Versionen des Prefabs erfolgen.",
  "q_faq_components_2": "Wenn das Original-Prefab (LocalizedPrefab) ein Rigidbody oder eine andere Physikkomponente hat, wird diese deaktiviert? Wirkt sich dies auf die Physik aus, wenn das lokalisierte Prefab diese nicht hat?",
  "a_faq_components_2": "Ja, das Physikverhalten des Originalobjekts wird neutralisiert. Die Komponente LocalizedPrefab findet alle Rigidbody- und Rigidbody2D-Komponenten auf seinem GameObject und setzt deren isKinematic-Eigenschaft auf true. Dies entfernt sie effektiv aus dynamischen Physikberechnungen und verhindert unerwünschtes Verhalten wie ein unsichtbares Objekt, das fällt oder auf Kollisionen reagiert. Es wird weiterhin empfohlen, dass die lokalisierte Version des Prefabs alle notwendigen Physikkomponenten für das korrekte Verhalten enthält.",
  "q_faq_components_3": "Die Komponente LocalizedAsset speichert den Zielkomponentennamen als Zeichenkette (_targetComponentTypeName). Was passiert, wenn ich ein benutzerdefiniertes Komponentenskript umbenenne oder in eine andere Assembly (Assembly Definition) verschiebe? Funktioniert LocalizedAsset dafür nicht mehr?",
  "a_faq_components_3": "Ja, es wird nicht mehr funktionieren. Die Komponente speichert den vollständigen Typnamen, einschließlich Namespace und Assembly. Das Umbenennen des Skripts oder das Verschieben in eine andere .asmdef ändert diesen Namen, und LocalizedAsset kann die Zielkomponente nicht finden. Sie müssen eine erneute Analyse über Analyze Project & Attach Components durchführen, damit der Name aktualisiert wird.",
  "q_faq_components_4": "Wenn sich zwei Image-Komponenten auf demselben GameObject befinden, woher weiß LocalizedAsset, welche es lokalisieren soll? Funktioniert es mit beiden oder nur mit der ersten, die es findet?",
  "a_faq_components_4": "Ein LocalizedAsset wird für eine bestimmte Komponenteninstanz erstellt. Es enthält eine Referenz auf diese Komponente im Code. Wenn Sie manuell ein zweites LocalizedAsset hinzufügen und das Kontextmenü \"Analyze for Localization\" verwenden, um auf das zweite Image abzuzielen, haben Sie zwei LocalizedAsset-Komponenten, die jeweils ihr eigenes Image verwalten. Der automatische Analysator erstellt nur eine Komponente für das erste Image mit einem lokalisierbaren Asset, das er findet.",
  "q_faq_components_5": "Die Dokumentation besagt, dass LocalizedPrefab eine Ausführungsreihenfolge von -100 hat. Was passiert, wenn ich ein anderes Skript mit einer Ausführungsreihenfolge von -110 habe, das versucht, in seinem Awake() ein von LocalizedPrefab erstelltes Kindobjekt zu finden? Wird LocalizedPrefab seine Instanz rechtzeitig instanziiert haben?",
  "a_faq_components_5": "Ja, das wird es. LocalizedPrefab erstellt die Instanz des lokalisierten Prefabs in seiner OnEnable()-Methode. Unitys Ausführungsreihenfolge garantiert, dass alle Awake()-Methoden vor allen OnEnable()-Methoden ausgeführt werden. Ihr Skript mit der Reihenfolge -110 führt also sein Awake() aus, dann führt LocalizedPrefab mit der Reihenfolge -100 sein Awake() aus, und erst danach werden ihre OnEnable()-Methoden in der Reihenfolge aufgerufen. Ihr Skript findet das Objekt nicht, da es noch nicht erstellt wurde.",
  "q_faq_components_6": "Die Komponente LocalizedText hat eine Option isStyleOnly. Wenn ich sie aktiviere und dann myLocalizedText.SetFormattedText(\"new_key\") im Code aufrufe, ändert sich der Text oder nur der Stil (Schriftart/RTL)?",
  "a_faq_components_6": "Sowohl der Schlüssel als auch der Text ändern sich. Der programmatische Aufruf von SetFormattedText überschreibt das isStyleOnly-Verhalten für dieses spezifische Update. Die Option isStyleOnly soll verhindern, dass die Komponente auf globale Sprachänderungen reagiert, aber sie reagiert immer auf eine direkte Schlüsseländerung durch Code.",
  "q_faq_components_7": "LocalizedBehaviour findet automatisch Methoden mit dem Attribut [OnLanguageChange]. Findet es private und geschützte Methoden, oder müssen diese öffentlich sein?",
  "a_faq_components_7": "Es findet Methoden mit jedem Zugriffsmodifikator (public, private, protected, internal). Reflection in Unity ermöglicht die Erkennung aller Instanzmethoden, unabhängig von ihrer Zugriffsebene.",
  "q_faq_components_8": "Die Komponente LocalizedAsset fängt Play on Awake ab. Was passiert, wenn ein anderes Skript auf demselben Objekt versucht, in Awake() oder Start() auf das Asset zuzugreifen (z. B. audioSource.clip.length), bevor LocalizedAsset es ausgetauscht hat? Ist eine NullReferenceException oder die Verwendung des alten Assets möglich?",
  "a_faq_components_8": "Die Verwendung des alten (nicht lokalisierten) Assets ist möglich. LocalizedAsset führt den Austausch in seiner OnEnable() durch. Die Awake()-Methoden aller Skripte werden vor OnEnable() ausgeführt. Wenn Ihr Skript in Awake() auf audioSource.clip zugreift, erhält es den ursprünglichen Clip. Wenn es in Start() darauf zugreift, hängt das Ergebnis von der Skript-Ausführungsreihenfolge ab. Um den Zugriff auf das lokalisierte Asset zu gewährleisten, legen Sie entweder eine spätere Ausführungsreihenfolge für Ihr Skript fest oder greifen Sie in einer Methode, die mit [OnLanguageChange] markiert ist, auf das Asset zu.",
  "h2_faq_window": "10.3. Das „Localization Tool“-Fenster",
  "h3_faq_window_preview": "In-Editor-Vorschau",
  "q_faq_window_preview_1": "Ich habe ein Prefab im Prefab-Modus geöffnet, die In-Editor-Vorschau angewendet und Strg+S gedrückt. Werden die temporären Vorschaudaten im Prefab-Asset gespeichert? Wie handhabt LocalizationPreviewProtector diesen Fall?",
  "a_faq_window_preview_1": "Nein, es wird nicht gespeichert. LocalizationPreviewProtector fängt das Asset-Speicherereignis (OnWillSaveAssets) ab und ruft automatisch RevertEditorPreview() auf, bevor Unity die Änderungen auf die Festplatte schreibt. Das Prefab wird somit in seinem ursprünglichen, nicht lokalisierten Zustand gespeichert.",
  "q_faq_window_preview_2": "Wenn ich die In-Editor-Vorschau aktiviere und der Unity-Editor abstürzt und die Datei Temp/localization_preview_recovery.json beschädigt wird (z. B. leer oder ungültiges JSON), was passiert beim nächsten Start?",
  "a_faq_window_preview_2": "PreviewCrashProtector ist in einem try-catch-Block verpackt. Wenn die JSON-Deserialisierung fehlschlägt, wird ein Fehler in der Konsole protokolliert, dass die Wiederherstellung nicht möglich ist, und der Prozess wird leise beendet. Ihre Szene bleibt in dem \"kaputten\" Zustand, in dem sie sich zum Zeitpunkt des Absturzes befand. In diesem Fall müssen Sie manuell \"Revert to Original\" im Tool-Fenster auswählen, um ein Zurücksetzen der Änderungen zu erzwingen.",
  "q_faq_window_preview_3": "Im In-Editor-Vorschaumodus für LocalizedPrefab wird eine temporäre Instanz erstellt. Werden die Awake()- und Start()-Methoden auf dieser Instanz ausgeführt? Könnte dies Fehler verursachen, wenn sie nicht für die Ausführung im Edit-Modus konzipiert sind?",
  "a_faq_window_preview_3": "Ja, das werden sie. PrefabUtility.InstantiatePrefab im Edit-Modus ruft Awake() und OnEnable() auf. Wenn diese Methoden Logik enthalten, die nicht im Editor ausgeführt werden sollte (z. B. Zugriff auf Singletons, die nur im Play-Modus existieren), könnte dies Fehler verursachen. Es wird empfohlen, if (Application.isPlaying) oder #if UNITY_EDITOR zu verwenden, um solchen Code zu schützen.",
  "h3_faq_window_settings": "Tab „Einstellungen“",
  "q_faq_window_settings_1": "Ich kann den Key Generation Mode mitten im Projekt von UseTextAsKey auf AutoGenerateKeysOnly ändern. Was genau passiert mit meinen vorhandenen Übersetzungen? Werden sie auf die neuen Schlüssel abgebildet?",
  "a_faq_window_settings_1": "Ja, das werden sie. Beim Ändern des Modus führt das Tool eine \"sichere Migration\" durch: Es parst das gesamte Projekt erneut, erstellt neue Schlüssel gemäß den neuen Regeln, ordnet die alten und neuen Schlüssel jedoch über den Originaltext zu. Anschließend überträgt es alle Ihre vorhandenen Übersetzungen und Kommentare von den alten auf die neuen Schlüssel. Ihre Übersetzungen gehen nicht verloren.",
  "q_faq_window_settings_2": "Wenn ich eine Sprache mit einem Code, der keine Pluralisierungsregeln hat (z. B. \"kz\" für Kasachisch), zur Liste der Supported Languages hinzufüge, welche Regel wird standardmäßig verwendet?",
  "a_faq_window_settings_2": "Die DefaultPluralRule wird verwendet, die für Englisch und die meisten europäischen Sprachen geeignet ist (Formen für „one“ und „other“).",
  "q_faq_window_settings_3": "Was passiert, wenn ich den Translations Path nicht in StreamingAssets, sondern in einem regulären Ordner wie Assets/MyTranslations angebe? Werden die json-Dateien in den Spiel-Build aufgenommen?",
  "a_faq_window_settings_3": "Nein, das werden sie nicht. Nur Assets, die sich in einem StreamingAssets- oder Resources-Ordner befinden, werden garantiert in den Build aufgenommen. Wenn Sie einen anderen Pfad angeben, funktioniert die Lokalisierung im Editor, aber nicht im kompilierten Spiel, da die Übersetzungsdateien nicht Teil des Builds sind.",
  "q_faq_window_settings_4": "Der Auto-Übersetzungs-API-Schlüssel wird in EditorPrefs gespeichert. Wenn ich an dem Projekt auf zwei verschiedenen Computern arbeite, muss ich den Schlüssel auf jedem Computer separat eingeben?",
  "a_faq_window_settings_4": "Ja. EditorPrefs ist ein lokaler Speicher für jeden Computer. Sie müssen den API-Schlüssel auf jedem Computer eingeben, von dem aus Sie die Auto-Übersetzungsfunktion verwenden möchten.",
  "h3_faq_window_content": "Tab „Inhalt“",
  "q_faq_window_content_1": "Was passiert, wenn ich eine Szene zu Scenes to Parse hinzufüge, die nicht in den Build Settings enthalten ist? Wirkt sich dies auf etwas anderes als den Parsing-Prozess selbst aus?",
  "a_faq_window_content_1": "Nein, das wird es nicht. Die Liste Scenes to Parse wird ausschließlich verwendet, um das Tool darüber zu informieren, welche Szenen geöffnet und auf Text analysiert werden sollen. Sie steht in keiner Weise in Bezug zu den Szenen, die letztendlich im finalen Build Ihres Spiels landen.",
  "q_faq_window_content_2": "Ich habe ein Objekt zu Ignore Specific Objects (der temporären Liste) hinzugefügt. Wenn ich aus diesem Objekt ein Prefab erstelle, wird die Instanz dieses Prefabs ebenfalls ignoriert?",
  "a_faq_window_content_2": "Nein, das wird sie nicht. Die temporäre Liste speichert eine direkte Referenz auf das Objekt in der Szene. Wenn Sie ein Prefab erstellen, handelt es sich um ein neues Asset. Seine Instanzen sind andere Objekte, und die Ignorierregel gilt nicht für sie. Um Prefabs dauerhaft zu ignorieren, müssen sie als Prefab-Asset zur Ignorierliste hinzugefügt werden.",
  "q_faq_window_content_3": "Wenn ich die Komponente TMPro.TMP_Text zu Parsing Ignores -> Ignore Component Types hinzufüge, aber ein Objekt in der Szene mit einem LocalizedText vorhanden ist, der bereits auf diesen TMP_Text verweist, was passiert beim nächsten Update Keys? Wird der Schlüssel gelöscht?",
  "a_faq_window_content_3": "Ja, das wird er. Wenn Sie auf Update Keys klicken, scannt der Parser das gesamte Projekt erneut. Er wird sehen, dass der Typ TMPro.TMP_Text ignoriert werden soll, und generiert keinen Schlüssel dafür. Während des Vergleichs alter und neuer Schlüssel wird er feststellen, dass der alte Schlüssel nicht mehr verwendet wird, und ihn als \"Removed\" markieren.",
  "q_faq_window_content_4": "Die Dokumentation besagt, dass \"Pin\" den vollständigen Pfad zum Objekt speichert und unterbrochen wird, wenn es umbenannt wird. Was passiert, wenn ich aus dem Objekt ein Prefab erstelle und dann das Originalobjekt umbenenne - funktioniert \"Pin\" weiterhin für die Prefab-Instanzen?",
  "a_faq_window_content_4": "Nein, das wird es nicht. \"Pin\" speichert den absoluten Pfad in der Szenenhierarchie in dem Moment, in dem auf die Schaltfläche geklickt wird (z. B. Canvas/Panel/Button). Dieser Pfad steht in keinem Zusammenhang mit der Prefab-Logik. Prefab-Instanzen haben denselben Pfad, aber wenn Sie das übergeordnete Objekt in der Szene umbenennen, funktioniert \"Pin\" sowohl für das Original als auch für die Instanzen nicht mehr.",
  "q_faq_window_content_5": "Wenn ich \"Pin\" für ein Kindobjekt innerhalb einer Prefab-Instanz verwende, welcher Pfad wird gespeichert: relativ zur Prefab-Wurzel oder zur Szenen-Wurzel? Funktioniert es in anderen Szenen?",
  "a_faq_window_content_5": "Der vollständige Pfad von der Szenen-Wurzel wird gespeichert. Zum Beispiel MyPrefab(Clone)/Content/Icon. Dieser \"angeheftete\" Pfad funktioniert nur in der Szene, in der Sie ihn erstellt haben. In anderen Szenen ist es unwahrscheinlich, dass ein solcher Pfad gefunden wird.",
  "h3_faq_window_actions": "Tab „Aktionen“",
  "h3_faq_window_assets": "Tab „Assets“",
  "h3_faq_window_report": "Tab „Bericht“",
  "h2_faq_editor": "10.4. Übersetzungseditor",
  "h2_faq_examples": "10.5. Anwendungsbeispiele & Code",
  "h2_faq_notes": "10.6. Wichtige Nuancen & Warnungen",
  "h2_faq_extending": "10.7. Erweiterung der Funktionalität",
  "q_faq_window_actions_1": "Was passiert, wenn die Internetverbindung während einer automatischen Stapelübersetzung unterbrochen wird? Versucht das Tool, den fehlgeschlagenen Stapel gemäß der Wiederholungsrichtlinie erneut zu senden, oder wird der Prozess vollständig unterbrochen?",
  "a_faq_window_actions_1": "Das Tool versucht, den exakten fehlgeschlagenen Stapel gemäß den Einstellungen der Wiederholungsrichtlinie (Anzahl der Versuche und Verzögerung) erneut zu senden. Wenn alle Versuche für diesen Stapel fehlschlagen, wird der Übersetzungsprozess für die aktuelle Sprache unterbrochen, und ein Fehler wird in der Konsole protokolliert. Die Übersetzung für die nächsten Sprachen in der Warteschlange wird nicht gestartet.",
  "q_faq_window_actions_2": "Wenn ich eine CSV-Datei importiere, die Schlüssel enthält, die bereits im Projekt existieren, aber mit leeren Werten für einige Sprachen, werden diese leeren Werte meine vorhandenen Übersetzungen ersetzen oder ignoriert?",
  "a_faq_window_actions_2": "Leere Werte ersetzen vorhandene Übersetzungen. Der Importprozess betrachtet die CSV-Datei als \"Wahrheitsquelle\". Wenn der Wert für den Schlüssel welcome_message in der Spalte ru leer ist, wird die aktuelle russische Übersetzung für diesen Schlüssel überschrieben.",
  "q_faq_window_actions_3": "Der Abschnitt \"Danger Zone\" ermöglicht das Löschen aller Komponenten. Werden Komponenten aus Prefabs entfernt, die sich in Ordnern befinden, die nicht in den Prefab Folders im Content-Tab angegeben sind?",
  "a_faq_window_actions_3": "Ja, das werden sie. Die Funktionen in der \"Danger Zone\" scannen alle Prefabs im Projekt (AssetDatabase.FindAssets(\"t:Prefab\")), nicht nur die in der Parsing-Liste angegebenen, um die größtmögliche Bereinigung zu gewährleisten.",
  "q_faq_window_actions_4": "Wie soll ich beim Import aus Google Sheets die Kommentarspalte formatieren, damit die Platzhaltervalidierung mithilfe der Direktive @placeholders: funktioniert?",
  "a_faq_window_actions_4": "In Ihrem Google Sheets-Dokument muss die Spalte den Titel \"Developer Notes\" tragen. In den Zellen dieser Spalte können Sie wie gewohnt Kommentare schreiben. Um Platzhalter anzugeben, fügen Sie einfach eine Zeile wie @placeholders: {username}, {score} in den Kommentartext ein. Das Tool erkennt diese Direktive beim Import automatisch.",
  "q_faq_window_actions_5": "Kann das Tool Daten aus mehreren Blättern eines einzigen Google Sheets-Dokuments importieren, oder funktioniert es nur mit einem Blatt pro GID?",
  "a_faq_window_actions_5": "Das Tool funktioniert nur mit einem Blatt gleichzeitig. Die Import-URL enthält einen Parameter gid=..., der ein bestimmtes Blatt im Dokument eindeutig identifiziert. Um Daten aus einem anderen Blatt zu importieren, müssen Sie dessen URL (mit einer anderen gid) kopieren und den Import erneut durchführen.",
  "q_faq_window_assets_1": "Was passiert, wenn ich zwei Assets mit demselben Schlüssel, aber unterschiedlichen Typen im selben Scan-Ordner habe (z. B. sound_effect_en.mp3 und sound_effect_en.wav)? Welches landet in der Asset-Tabelle?",
  "a_faq_window_assets_1": "Der Asset-Scanner lädt sie unter Angabe des erwarteten Typs (AssetDatabase.LoadAssetAtPath(path, expectedType)). Für die Kategorie AudioClip sucht und lädt er nur Dateien, die Unity als AudioClips erkennt. Wenn beide Dateien gültige Audioclips sind, wird diejenige in die Tabelle aufgenommen, die zuletzt verarbeitet wird, wodurch die vorherige effektiv überschrieben wird. Es wird empfohlen, solche Duplikate zu vermeiden.",
  "q_faq_window_assets_2": "Wenn ich Scan Assets & Analyze Project klicke und ein Image-Objekt in der Szene vorhanden ist, für das bereits ein lokalisiertes Sprite existiert, das Image-Objekt selbst aber noch keine LocalizedAsset-Komponente hat, wird das Tool die Komponente hinzufügen und den Schlüssel automatisch einfügen?",
  "a_faq_window_assets_2": "Ja, genau so funktioniert es. \"Analyze Project\" findet die Image-Komponente, betrachtet den Namen des ihr zugewiesenen Sprites (z. B. icon_play_en), extrahiert daraus den Schlüssel (icon_play) und die Sprache (en) und fügt dann dem GameObject eine LocalizedAsset-Komponente hinzu und schreibt den Schlüssel icon_play hinein.",
  "q_faq_window_assets_3": "Kann ich dieselbe Naming Rule für verschiedene Asset-Kategorien verwenden, wenn diese unterschiedliche Scan Folders haben? Verursacht dies Konflikte?",
  "a_faq_window_assets_3": "Ja, das können Sie. Es wird keine Konflikte geben, da für jede Kategorie eine separate Asset-Tabelle (LocalizedAssetTable) erstellt wird. Schlüssel aus der Kategorie \"Sprites\" überschneiden sich nicht mit Schlüsseln aus der Kategorie \"AudioClips\", selbst wenn sie denselben Namen haben.",
  "q_faq_window_assets_4": "Wenn sich ein lokalisierbares Asset (z. B. button_ok_en.png) nicht im Stammverzeichnis des Scan Folders, sondern in einem Unterordner befindet, wird der Scanner es finden?",
  "a_faq_window_assets_4": "Ja, das wird er. Der Scanner verwendet die Option SearchOption.AllDirectories, was bedeutet, dass er alle Unterordner innerhalb des von Ihnen angegebenen Scan Folders rekursiv überprüft.",
  "q_faq_window_report_1": "Die Schaltfläche \"Find\" sucht das Objekt asynchron. Was passiert, wenn ich eine Suche starte und dann sofort Update Keys klicke? Wird die Suche unterbrochen?",
  "a_faq_window_report_1": "Ja, sie wird unterbrochen. Jede neue Aktion, die eine UI-Blockierung erfordert (wie Update Keys), stoppt die aktuelle Such-Coroutine. Es erscheint ein Dialogfeld, in dem Sie aufgefordert werden, die aktuelle Suche zu beenden, um eine neue zu starten.",
  "q_faq_window_report_2": "Wenn ein Schlüssel an mehreren Stellen verwendet wird (z. B. auf zwei verschiedenen Schaltflächen in verschiedenen Szenen), wie wird dies im Bericht unter der Kategorie \"Duplicates\" angezeigt?",
  "a_faq_window_report_2": "Die Kategorie \"Duplicates\" zeigt alle Quellen für diesen Schlüssel an. Sie sehen einen Eintrag für den Schlüssel, und das Feld \"Source\" listet alle Pfade (in Szene 1 und Szene 2) auf. Die Schaltfläche \"Find\" öffnet in diesem Fall eine Dropdown-Liste, in der Sie auswählen können, zu welchem Objekt navigiert werden soll.",
  "q_faq_window_report_3": "Wenn ich auf \"Find\" für einen Schlüssel klicke, der nur im Code verwendet wird (über die _()-Funktion), was passiert dann? Kann das Tool das C#-Skript finden und hervorheben?",
  "a_faq_window_report_3": "Ja. Das Suchsystem ist speziell darauf trainiert, Quellen wie Skript MyScript.cs zu erkennen. Wenn Sie auf \"Find\" klicken, sucht es nach dem Asset MyScript.cs im Projekt und hebt es im Projektfenster hervor (ping).",
  "q_faq_editor_1": "Was hat eine höhere Priorität für die Platzhaltervalidierung: die Direktive @placeholders: im Kommentar oder die im Quellsprachentext gefundenen Platzhalter? Zum Beispiel, wenn der Quelltext {name} und der Kommentar @placeholders: {username} enthält.",
  "a_faq_editor_1": "Die Direktive @placeholders: im Kommentar hat Priorität. Sie wird als explizite Anweisung des Entwicklers und als \"Wahrheitsquelle\" betrachtet. In Ihrem Beispiel erfordert der Editor {username} in der Übersetzung und ignoriert {name} aus dem Quelltext.",
  "q_faq_editor_2": "Wenn ich einen Tippfehler in der Direktive mache (z. B. @placeholder: anstelle von @placeholders:), wird dieser ignoriert oder gibt das Tool eine Warnung aus?",
  "a_faq_editor_2": "Er wird einfach ignoriert. Das Tool sucht nach einer exakten Übereinstimmung von @placeholders:. Wenn die Direktive falsch geschrieben ist, wird sie als Teil eines regulären Kommentars behandelt, und die Validierung funktioniert auf die alte Weise - basierend auf den Platzhaltern aus dem Quelltext.",
  "q_faq_editor_3": "Das Auto-Speicher-System erstellt Dateien im Ordner Backups/AutoSaves. Werden diese Dateien nach einem erfolgreichen manuellen Speichern oder Schließen des Fensters automatisch gelöscht?",
  "a_faq_editor_3": "Ja. Nach einem erfolgreichen manuellen Speichern oder normalem Schließen des Fensters (wenn Sie Änderungen speichern) werden alle Auto-Speicher-Dateien gelöscht, um eine Wiederherstellungsaufforderung beim nächsten Start zu vermeiden. Sie bleiben nur im Falle eines Editor-Absturzes erhalten.",
  "q_faq_editor_4": "Wenn ich die Spaltenbreiten im Editor ändere, werden diese Einstellungen zwischen den Unity-Sitzungen gespeichert?",
  "a_faq_editor_4": "Ja. Die Spaltenbreiten werden jedes Mal, wenn Sie das Übersetzungseditor-Fenster schließen, in EditorPrefs gespeichert und beim nächsten Öffnen wiederhergestellt.",
  "q_faq_editor_5": "Unterstützt das Textbearbeitungs-Popup-Fenster (MultiLineEditWindow) einen eigenen Rückgängig/Wiederherstellen-Stapel (über Strg+Z) für darin vorgenommene Änderungen?",
  "a_faq_editor_5": "Ja. Das MultiLineEditWindow verfügt über einen eigenen temporären Rückgängig/Wiederherstellen-Stapel, der funktioniert, während das Fenster geöffnet ist. Dadurch können Sie Textänderungen innerhalb dieses Fensters rückgängig machen und wiederherstellen. Sobald Sie das Ergebnis speichern (durch Schließen des Fensters), wird diese Änderung als einzelne Aktion im globalen Rückgängig/Wiederherstellen-Stapel des Haupteditors aufgezeichnet.",
  "q_faq_examples_1": "Was passiert, wenn die Eigenschaftsnamen im an die _()-Funktion übergebenen anonymen Typ nicht mit den Platzhaltern in der Zeichenkette übereinstimmen? Zum Beispiel _(\"Hello, {username}\", new { user_name = \"Bob\" }). Gibt es einen Fehler, oder wird der Platzhalter einfach nicht ersetzt?",
  "a_faq_examples_1": "Es wird keinen Fehler geben. Der Platzhalter {username} wird einfach nicht ersetzt, und Sie erhalten die Zeichenkette \"Hello, {username}\" als Ergebnis. Die Ersetzung erfolgt nur bei einer exakten Namensübereinstimmung.",
  "q_faq_examples_2": "Das Attribut [LocalizableField] funktioniert für private Felder. Funktioniert es für statische Felder?",
  "a_faq_examples_2": "Ja, das wird es. Der Parser verwendet Reflection, um Felder mit den Flags BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static zu finden, sodass er statische Felder findet und verarbeitet.",
  "q_faq_examples_3": "Wenn ich das Attribut [OnLanguageChange] auf eine Methode mit Parametern setze (z. B. void UpdateUI(string newLang)), was passiert dann? Gibt es einen Kompilierungsfehler oder eine Laufzeitwarnung?",
  "a_faq_examples_3": "Es gibt keinen Kompilierungsfehler, aber eine Warnung von LocalizedBehaviour wird zur Laufzeit in der Unity-Konsole angezeigt. Sie meldet, dass sie eine Methode mit dem Attribut gefunden, diese aber ignoriert hat, weil die Methode Parameter hat. Eine solche Methode wird nicht aufgerufen.",
  "q_faq_examples_4": "Ich verwende _(\"apple_count\", count). Wenn für die aktuelle Sprache (für count = 1) kein Schlüssel apple_count_one vorhanden ist, welche Form wählt das System? Wird es apple_count_other als Fallback verwenden?",
  "a_faq_examples_4": "Ja. Wenn eine bestimmte Form (_one, _few usw.) nicht gefunden wird, versucht das System, den Schlüssel mit dem Suffix _other als Fallback zu verwenden. Wenn auch dieser nicht gefunden wird, wird die Übersetzung für den Basisschlüssel apple_count verwendet.",
  "q_faq_examples_5": "Die Funktion _(\"key\", new { username = \"Alex\" }) verwendet einen anonymen Typ. Erzeugt dies nicht eine übermäßige \"Belastung\" für den Garbage Collector (GC) bei häufigen Aufrufen in einer Update()-Methode im Vergleich zur Übergabe eines vorab erstellten Dictionary<string, object>?",
  "a_faq_examples_5": "Ja, das wird es. Jeder Aufruf von new { ... } reserviert Speicher auf dem verwalteten Heap, was zusätzliche Arbeit für den Garbage Collector bedeutet. Für Text, der in jedem Frame aktualisiert wird (in Update oder LateUpdate), ist es deutlich performanter, ein Dictionary<string, object> einmal in Start() zu erstellen und in Update() nur seine Werte zu aktualisieren, bevor es an die _()-Funktion übergeben wird.",
  "q_faq_examples_6": "Meine mit [OnLanguageChange] markierte Methode wird nicht aufgerufen. Warum?",
  "a_faq_examples_6": "Prüfen Sie, ob Ihre Methode Parameter hat. Das Attribut <code>[OnLanguageChange]</code> funktioniert nur bei Methoden **ohne Parameter** (z. B. <code>void UpdateUI()</code>). Wenn Ihre Methode Argumente erfordert, umschließen Sie sie in einer parameterlosen Methode.",
  "q_faq_notes_1": "Die Dokumentation empfiehlt, LanguageSelector zur Ignorierliste hinzuzufügen. Was genau wird kaputt gehen, wenn ich das vergesse? Werden zusätzliche Schlüssel für \"Option A, Option B\" erstellt?",
  "a_faq_notes_1": "Ja. Wenn Sie LanguageSelector nicht zur Ignorierliste hinzufügen, behandelt der Parser seinen TMP_Dropdown als reguläres Dropdown. Er findet die Standardwerte \"Option A, Option B, Option C\", die Unity erstellt, und fügt Schlüssel dafür zu Ihren Übersetzungsdateien hinzu. Dies überfrachtet Ihre Dateien mit unnötigen Schlüsseln, da LanguageSelector diese Optionen zur Laufzeit sowieso entfernt und seine eigenen erstellt.",
  "q_faq_notes_2": "Wenn ich vergesse, ein leeres LocalizedText mit aktiviertem isStyleOnly-Kontrollkästchen auf dem Label innerhalb des von LanguageSelector verwendeten TMP_Dropdown hinzuzufügen, ändert sich die Schriftart dann nicht? Warum ist das notwendig?",
  "a_faq_notes_2": "Ja, die Schriftart ändert sich nicht. Dies ist notwendig, weil LanguageSelector die Eigenschaft label.text direkt ändert. Ohne ein LocalizedText auf diesem Objekt weiß das Lokalisierungssystem nicht, dass dieses Element beim Sprachwechsel Stile (Schriftart, RTL) erhalten muss. Ein leeres LocalizedText mit isStyleOnly dient als \"Marker\" für das System, der besagt: \"Beobachte dieses Objekt und wende Stile darauf an, aber berühre seinen Text nicht\".",
  "q_faq_notes_3": "Der Aufruf von _() in der Update()-Methode wird nicht empfohlen. Aber was ist, wenn ich Text in jedem Frame aktualisieren muss (z. B. einen Timer)? Was ist der performanteste Weg dafür, wobei nur die Formatzeichenkette zwischengespeichert wird?",
  "a_faq_notes_3": "Der performanteste Ansatz besteht darin, die Formatzeichenkette in Start() oder in einer [OnLanguageChange]-Methode zwischenzuspeichern und in Update() das reguläre string.Format zu verwenden. Beispiel: private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } Dadurch wird vermieden, dass der Schlüssel in jedem Frame im Wörterbuch nachgeschlagen wird, was erheblich schneller ist.",
  "q_faq_extending_1": "Wird mein benutzerdefinierter Parser nach jedem Update Keys automatisch aufgerufen? Muss ich ihn irgendwo registrieren, oder reicht es aus, einfach eine Klasse zu haben, die ITextComponentParser im Projekt implementiert?",
  "a_faq_extending_1": "Es reicht aus, die Klasse zu haben. Wenn TextParser ausgeführt wird, verwendet es Reflection, um alle Klassen im Projekt zu finden, die die Schnittstelle ITextComponentParser implementieren, und ruft automatisch deren Parse()-Methode für jedes GameObject auf. Es ist keine manuelle Registrierung erforderlich.",
  "q_faq_extending_2": "Was passiert, wenn in meinem benutzerdefinierten Parser eine Ausnahme auftritt? Wird der gesamte Parsing-Prozess unterbrochen, oder fährt das Tool sicher mit anderen Parsern fort?",
  "h2_faq_addressables": "Addressables & Migration",
  "q_faq_addressables_1": "Ich habe den Addressables-Modus aktiviert, aber Assets werden nicht geladen. Was soll ich überprüfen?",
  "a_faq_addressables_1": "Stellen Sie sicher, dass das Addressables-Paket installiert und Einstellungen erstellt wurden und Sie auf \"Scan Assets & Generate Tables\" geklickt haben, um Schlüssel in Gruppen zu registrieren.",
  "q_faq_addressables_2": "Wie füge ich Unterstützung für DeepL/Google hinzu?",
  "a_faq_addressables_2": "Erstellen Sie ein <code>Translation Profile</code> im Assets-Ordner, wählen Sie den Diensttyp aus, geben Sie den API-Schlüssel ein und weisen Sie dieses Profil im <code>Settings</code>-Fenster zu.",
  "q_faq_addressables_3": "Der Migrator zeigt Kompilierungsfehler an, nachdem I2/UnityLoc entfernt wurde. Wie kann ich das beheben?",
  "a_faq_addressables_3": "Im Migrationsfenster (Tab 0) gibt es eine Schaltfläche \"Enable Stubs\", die die Funktion Emergency Stubs aktiviert. Dadurch werden gefälschte Platzhalterklassen für I2 Localization oder Unity Localization erstellt, sodass Ihr Projekt sofort nach dem Entfernen dieser Plugins kompiliert werden kann. Die Funktion funktioniert durch Umschalten des Define-Symbols ANKO_ENABLE_MIGRATION_STUBS. Dies verhindert Fehler wie \"Der Typname 'Localize' konnte nicht gefunden werden\" und gibt Ihnen Zeit, Ihren Code ordnungsgemäß auf das neue System umzustellen. Enable Stubs ermöglicht es Ihnen, Kompilierungsfehler nach dem Löschen des alten Lokalisierungs-Plugins zu beheben.",
  "a_faq_extending_2": "Eine Ausnahme in Ihrem benutzerdefinierten Parser unterbricht den Prozess. Die Haupt-Parsing-Schleife umschließt Aufrufe an benutzerdefinierte Parser nicht in einem try-catch-Block. Wenn Ihre Parse()-Methode eine unbehandelte Ausnahme auslöst,",
  "h2_faq_audio": "KI Audio / Text-to-Speech",
  "q_faq_audio_smart_update": "Wie spart das Tool API-Gutschriften beim Regenerieren von Audiodateien?",
  "a_faq_audio_smart_update": "Das Tool verwendet intelligentes Batching mit MD5-Hashing, um Audiodateien nur dann neu zu generieren, wenn sich der Quelltext geändert hat. Es berechnet einen MD5-Hash Ihres Textinhalts und vergleicht ihn mit zuvor generierten Audiodateien. Wenn sich der Text nicht geändert hat, wird die Regenerierung übersprungen, wodurch Ihre API-Gutschriften gespart werden. Dies verhindert unnötige API-Aufrufe und reduziert Kosten beim Regenerieren von Audio. Das Tool hashiert Ihren Text und generiert Audiodateien nur neu, wenn sich der Quelltext geändert hat, wodurch Ihre API-Gutschriften gespart werden.",
  "toggle_notes_title": "Hinweise umschalten",
  "mindmap_toggle_title": "Mind Map anzeigen",
  "on_this_page_title": "Auf dieser Seite",
  "my_notes_title": "Meine Notizen",
  "no_notes_message_new": "Fahren Sie mit der Maus über den Text, um eine Notiz hinzuzufügen.",
  "notes_add_title": "Eine Notiz zu diesem Block hinzufügen",
  "notes_placeholder": "Ihre Notiz...",
  "notes_close_title": "Schließen",
  "notes_goto_title": "Zum Text gehen",
  "notes_edit_title": "Notiz bearbeiten",
  "notes_delete_title": "Notiz löschen",
  "notes_edit_text": "Bearbeiten",
  "copy_code_copy": "Kopieren",
  "copy_code_copied": "Kopiert!",
  "copy_code_error": "Fehler",
  "error_loading_title": "Ladefehler",
  "error_loading_message": "Bitte überprüfen Sie Ihre Verbindung und aktualisieren Sie die Seite.",
  "lightbox_aria_close": "Bildbetrachter schließen",
  "lightbox_image_alt": "Vergrößerte Ansicht",
  "mindmap_preset_full": "Vollansicht",
  "mindmap_preset_quick_start": "Schnellstart",
  "mindmap_preset_dev": "Entwickler-Workflow",
  "mindmap_preset_translator": "Übersetzer-Workflow",
  "mindmap_edge_configure": "1. Konfigurieren",
  "mindmap_edge_specify_content": "2. Inhalt angeben",
  "mindmap_edge_parse_project": "3. Projekt parsen",
  "mindmap_edge_creates_components": "Erstellt Komponenten",
  "mindmap_edge_generates": "Generiert",
  "mindmap_edge_opens": "Öffnet",
  "mindmap_edge_manages_assets": "Verwaltet Assets für",
  "mindmap_edge_defines_rules": "Definiert Regeln für",
  "mindmap_edge_reports_on": "Berichtet über",
  "mindmap_edge_enables_reaction": "Ermöglicht Reaktion über",
  "mindmap_edge_processed_by": "Verarbeitet durch",
  "mindmap_edge_edited_in": "Bearbeitet in",
  "mindmap_edge_extends": "Erweitert",
  "mindmap_edge_warns_about": "Warnt vor",
  "mindmap_edge_relates_to": "Bezieht sich auf",
  "mindmap_edge_recommends_for": "Empfiehlt für",
  "mindmap_edge_see_faq": "Siehe FAQ",
  "h3_attribute_features": "Unterstützte Typen & Funktionen",
  "li_attr_feat_1": "<strong>Sammlungen:</strong> Unterstützt <code>List&lt;string&gt;</code> und <code>string[]</code>. Schlüssel werden mit Suffixen wie <code>_0</code>, <code>_1</code> usw. generiert. Sie können sogar einen benutzerdefinierten Schlüssel auf das Listenfeld selbst anwenden, um alle Elemente zu präfixen.",
  "li_attr_feat_2": "<strong>Zugriffsmodifikatoren:</strong> Funktioniert mit <code>private</code>, <code>protected</code>, <code>internal</code> und <code>public</code> Feldern.",
  "li_attr_feat_3": "<strong>Benutzerdefinierte Attribute:</strong> In den Einstellungen des <em>Content Tabs</em> können Sie <code>HeaderAttribute</code>, <code>TooltipAttribute</code> oder jeden beliebigen benutzerdefinierten Attributnamen hinzufügen. Der Parser behandelt Felder mit diesen Attributen (z.B. <code>[Header(\"Text\")]</code>) dann als lokalisierbare Zeichenketten!",
  "li_attr_feat_4": "<strong>Verschachtelte Objekte:</strong> Rekursives Scannen von Feldern innerhalb von Klassen oder Strukturen, die mit <code>[System.Serializable]</code> markiert sind. Dies umfasst einzelne Instanzen und Listen von verschachtelten Objekten.",
  "li_attr_feat_5": "<strong>Formatierte Zeichenketten:</strong> Unterstützt interpolierte Zeichenketten (<code>$\"Text {0}\"</code>) und Verbatim-Strings (<code>@\"Text\"</code>). Der Parser extrahiert das rohe Formatmuster.",
  "h3_attribute_limitations": "Einschränkungen",
  "li_attr_limit_1": "<strong>Eigenschaften werden ignoriert:</strong> Der Parser scannt nur <code>Felder</code>. Code wie <code>[LocalizableField] public string Name { get; set; }</code> <strong>funktioniert nicht</strong>.",
  "li_attr_limit_2": "<strong>Wörterbücher:</strong> <code>Dictionary&lt;T, string&gt;</code> wird nicht direkt für das Parsing unterstützt.",
  "li_attr_limit_3": "<strong>Statische Felder:</strong> Unterstützt durch statische Analyse (Regex) in Codedateien, aber im Allgemeinen wird empfohlen, Instanzfelder für eine robuste Erkennung auf GameObjects zu verwenden.",
  "h3_attribute_cheat_sheet": "Kurzübersicht: Was funktioniert und was nicht",
  "lbl_supported": "Vollständig unterstützt",
  "lbl_not_supported": "NICHT unterstützt",
  "li_cheat_private": "<code>private</code> / <code>protected</code> Felder (Parser verwendet Reflection)",
  "li_cheat_collections": "<code>List&lt;string&gt;</code>, <code>string[]</code> Arrays",
  "li_cheat_serializable": "Verschachtelte <code>[Serializable] class</code> (Inventargegenstände, Dialogknoten)",
  "li_cheat_headers": "Attribute wie <code>[Header(\"...\")]</code> (wenn in den Einstellungen hinzugefügt)",
  "li_cheat_properties": "<strong>Eigenschaften</strong> <code>{ get; set; }</code> (Nur Felder!)",
  "li_cheat_dictionaries": "<strong>Wörterbücher</strong> (Nicht von Unitys Inspector serialisierbar)",
  "li_cheat_scriptable_objects": "<strong>ScriptableObjects</strong> (Müssen von einem MonoBehaviour referenziert werden)",
  "li_cheat_structs": "<strong>Strukturen</strong> (Nur Klassen werden für Rekursion unterstützt)",
  "li_cheat_nested_lists": "<strong>Listen verschachtelter Objekte</strong> (z.B. <code>List&lt;ItemData&gt;</code>)",
  "tip_best_practice": "<strong>Profi-Tipp:</strong> Wenn Sie eine Eigenschaft lokalisieren müssen, erstellen Sie ein Sicherungsfeld mit <code>[LocalizableField]</code> und machen Sie die Eigenschaft separat zugänglich.",
  "li_cheat_concatenation": "<strong>String-Verkettung:</strong> <code>\"A\" + \"B\"</code> (Regex erfasst nur den ersten Teil: \"A\")",
  "li_cheat_non_literals": "<strong>Variablen & Konstanten:</strong> Zuweisungen wie <code>string s = MyConst;</code> (Muss ein String-Literal sein)",
  "li_cheat_ternary": "<strong>Logik/Ternär:</strong> <code>cond ? \"A\" : \"B\"</code> (Der Parser kann den Wert nicht bestimmen)",
  "li_cheat_constructor_args": "<strong>Komplexe Konstruktor-Argumente:</strong> <code>new Item(\"Name\" + index)</code>",
  "li_cheat_static": "<strong>Statische Felder:</strong> <code>public static string</code> (Der Parser scannt nur Instanzen)",
  "li_cheat_unattached": "<strong>Nicht zugewiesene Skripte:</strong> Skripte müssen sich auf einem GameObject in einer Szene oder einem Prefab befinden",
  "li_cheat_base_private": "<strong>Private Felder der Basisklasse:</strong> <code>private</code> Felder in einer übergeordneten Klasse (Vererbungseinschränkung)",
  "code_example_attribute_limitations": "[LocalizableField] \npublic string Prop { get; set; } // FAIL: Property\n\n[LocalizableField]\npublic static string St = \"X\"; // FAIL: Static\n\n[LocalizableField]\npublic string Head = \"A\" + \"B\"; // FAIL: Concatenation"
}