{
  "a_faq_addressables_1": "Ensure the Addressables package is installed, settings are created, and you clicked \"Scan Assets & Generate Tables\" to register keys in groups.",
  "a_faq_addressables_2": "Create a <code>Translation Profile</code> in the assets folder, select the service type, enter the API key, and assign this profile in the <code>Settings</code> window.",
  "a_faq_addressables_3": "In the Migration window (Components / Import tabs), there is an \"Enable Stubs\" button that activates the Emergency Stubs feature. This creates fake placeholder classes for I2 Localization or Unity Localization so your project can compile immediately after removing those plugins. The feature works by toggling the ANKO_ENABLE_MIGRATION_STUBS define symbol. This prevents \"The type name 'Localize' could not be found\" errors and gives you time to properly refactor your code to use the new system. Enable Stubs allows you to fix compilation errors after deleting the old localization plugin. In v2.0, the migration system has been expanded with <strong>Migration Profiles</strong>, allowing for more robust transition rules from other plugins.",
  "a_faq_audio_smart_update": "The tool uses smart batching with MD5 hashing to only regenerate audio files when the source text has changed. It calculates an MD5 hash of your text content and compares it with previously generated audio files. If the text hasn't changed, it skips regeneration, saving your API credits. This prevents unnecessary API calls and reduces costs when regenerating audio. The tool hashes your text and only regenerates audio files if the source text has changed, saving your API credits.",
  "a_faq_components_1": "No, it will not. Disabling a MonoBehaviour prevents all of Unity's \"magic\" methods from being called, including Awake(), OnEnable(), and Start(). This is intentional to avoid duplicate logic execution. All initialization should occur in scripts on the localized versions of the prefab.",
  "a_faq_components_2": "Yes, the physics behavior of the original object will be neutralized. The LocalizedPrefab component finds all Rigidbody and Rigidbody2D components on its GameObject and sets their isKinematic property to true. This effectively removes them from dynamic physics calculations, preventing unwanted behavior like an invisible object falling or reacting to collisions. It is still recommended that the localized version of the prefab contains all the necessary physics components for correct behavior.",
  "a_faq_components_3": "Yes, it will. The component stores the full type name, including the namespace and assembly. Renaming the script or moving it to another .asmdef will change this name, and LocalizedAsset will not be able to find the target component. You will need to run another analysis via Analyze Project & Attach Components for it to update the name.",
  "a_faq_components_4": "A LocalizedAsset is created for a specific component instance. It holds a reference to that component in code. If you manually add a second LocalizedAsset and use the \"Analyze for Localization\" context menu to target the second Image, you will have two LocalizedAsset components, each managing its own Image. The automatic analyzer will only create a component for the first Image with a localizable asset it finds.",
  "a_faq_components_5": "Yes, it will. LocalizedPrefab creates the instance of the localized prefab in its OnEnable() method. Unity's execution order guarantees that all Awake() methods are executed before all OnEnable() methods. Thus, your script with order -110 will execute its Awake(), then LocalizedPrefab with order -100 will execute its Awake(), and only after that will their OnEnable() methods be called in order. Your script will not find the object because it will not have been created yet.",
  "a_faq_components_6": "Both the key and the text will change. Calling SetFormattedText programmatically overrides the isStyleOnly behavior for that specific update. The isStyleOnly option is intended to prevent the component from reacting to global language changes, but it will always react to a direct key change through code.",
  "a_faq_components_7": "It will find methods with any access modifier (public, private, protected, internal). Reflection in Unity allows for the discovery of all instance methods regardless of their access level.",
  "a_faq_components_8": "Usage of the old (unlocalized) asset is possible. LocalizedAsset performs the swap in its OnEnable(). The Awake() methods of all scripts are executed before OnEnable(). If your script accesses audioSource.clip in Awake(), it will get the original clip. If it accesses it in Start(), the result will depend on the script execution order. To guarantee access to the localized asset, either set a later execution order for your script or access the asset in a method marked with [OnLanguageChange].",
  "a_faq_custom_keys_attribute": "Yes. In the <strong>Content Tab</strong> under 'Attributes to Scan', you can add any attribute name (e.g., <code>[Header]</code>, <code>[TermsPopup]</code>). The parser will treat any string field with that attribute as localizable.",
  "a_faq_custom_provider_1": "Ensure your class implements <code>IAssetProvider</code>, is NOT abstract, and is marked with the <code>[AssetProviderPlugin]</code> attribute. Also, check the console for any reflection-related errors during startup, as the tool scans all assemblies for providers.",
  "a_faq_editor_1": "The @placeholders: directive in the comment has priority. It is considered an explicit instruction from the developer and the \"source of truth\". In your example, the editor will require {username} in the translation and will ignore {name} from the source text.",
  "a_faq_editor_2": "It will simply be ignored. The tool looks for an exact match of @placeholders:. If the directive is misspelled, it will be treated as part of a regular comment, and validation will work the old way - based on the placeholders from the source text.",
  "a_faq_editor_3": "Yes. Upon a successful manual save or normal window closure (when you save changes), all autosave files are deleted to avoid prompting for recovery on the next launch. They only remain in case of an editor crash.",
  "a_faq_editor_4": "Yes. Column widths are saved to EditorPrefs each time you close the translation editor window and will be restored the next time you open it.",
  "a_faq_editor_5": "Yes. The MultiLineEditWindow has its own temporary Undo/Redo stack that works while the window is open. This allows you to undo and redo text changes within that window. Once you save the result (by closing the window), this change is recorded as a single action in the global Undo/Redo stack of the main editor.",
  "a_faq_examples_1": "There will be no error. The {username} placeholder will simply not be replaced, and you will get the string \"Hello, {username}\" as a result. Replacement only occurs with an exact name match.",
  "a_faq_examples_2": "Yes, it will. The parser uses reflection to find fields with the flags BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static, so it will find and process static fields.",
  "a_faq_examples_3": "There will be no compile error, but a warning from LocalizedBehaviour will appear in the Unity console at runtime. It will report that it found a method with the attribute but ignored it because the method has parameters. Such a method will not be called.",
  "a_faq_examples_4": "Yes. If a specific form (_one, _few, etc.) is not found, the system will try to use the key with the _other suffix as a fallback. If that is also not found, the translation for the base key apple_count will be used.",
  "a_faq_examples_5": "Yes, it will. Each call to new { ... } allocates memory on the managed heap, which creates extra work for the garbage collector. For text that is updated every frame (in Update or LateUpdate), it is significantly more performant to create a Dictionary<string, object> once in Start(), and only update its values in Update() before passing it to the _() function.",
  "a_faq_examples_6": "Check if your method has parameters. The <code>[OnLanguageChange]</code> attribute only works on methods <strong>without parameters</strong> (e.g., <code>void UpdateUI()</code>). If your method requires arguments, wrap it in a parameterless method.",
  "a_faq_extending_1": "Just having the class is enough. When TextParser runs, it uses reflection to find all classes in the project that implement the ITextComponentParser interface and automatically calls their Parse() method for each GameObject. No manual registration is required.",
  "a_faq_extending_2": "An exception in your custom parser will interrupt the process. The main parsing loop does not wrap calls to custom parsers in a try-catch block. If your Parse() method throws an unhandled exception,",
  "a_faq_installation_1": "The installer checks for the existence of the Newtonsoft.Json.JsonConvert type. If the type exists, it considers the dependency satisfied and will not attempt to install or update the package. This is done to prevent version conflicts.",
  "a_faq_installation_2": "You can manually trigger a dependency check at any time via the Tools -> Localization -> Check Dependencies menu. This will reset the \"Don't ask again\" flag and show the window with all missing optional packages again.",
  "a_faq_installation_3": "This can happen if you do not have an Assets/Resources folder. The tool will try to create it, but file system permissions might prevent it. Yes, you can create the asset manually: right-click in the Resources folder, select Create -> Localization -> Settings. The tool will find it automatically.",
  "a_faq_installation_4": "Yes. The tool uses Resources.Load(), which searches for an asset by name in all folders named Resources in your project. The important thing is that the file keeps its name LocalizationSettings.asset.",
  "a_faq_installation_5": "Yes. You can open Window -> Package Manager, click the \"+\" icon, and select \"Add package by name...\". Enter the package names: com.unity.nuget.newtonsoft-json and com.unity.editorcoroutines.",
  "a_faq_notes_1": "Yes. If you don't add LanguageSelector to the ignore list, the parser will treat its TMP_Dropdown as a regular dropdown. It will find the default \"Option A, Option B, Option C\" that Unity creates and add keys for them to your translation files. This will clutter your files with unnecessary keys, as LanguageSelector will remove these options at runtime and create its own anyway.",
  "a_faq_notes_2": "Yes, the font will not change. This is necessary because LanguageSelector directly changes the label.text property. Without a LocalizedText on this object, the localization system does not know that this element needs styles (font, RTL) applied when the language changes. An empty LocalizedText with isStyleOnly serves as a \"marker\" for the system, saying: \"Watch this object and apply styles to it, but don't touch its text\".",
  "a_faq_notes_3": "The most performant approach is to cache the format string in Start() or in an [OnLanguageChange] method, and use regular string.Format in Update(). Example: private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } This avoids looking up the key in the dictionary every frame, which is significantly faster.",
  "a_faq_runtime_api_key_distinction": "<strong>Q: What is the difference between 'Translation Service Keys' and 'Runtime API Key'?</strong><br>A: <strong>Translation Service Keys</strong> (OpenAI, DeepL) are used in the <strong>Unity Editor</strong> to generate translations. They are stored in your computer's registry (EditorPrefs) and are NOT included in the build.<br>The <strong>Runtime API Key</strong> is used by the <strong>Game Build</strong> to fetch Live Updates. It IS included in the build (encrypted).",
  "a_faq_tts_voices": "In your <strong>Translation Profile</strong> (Inspector), use the 'Voice Mappings' list. You can map a Regex pattern (e.g. <code>^hero_.*</code>) to a specific Voice ID. The generator will automatically pick the correct voice based on the key name.",
  "a_faq_window_actions_1": "The tool will attempt to resend the exact batch that failed, according to the Retry Policy settings (number of attempts and delay). If all attempts for this batch fail, the translation process for the current language will be interrupted, and an error will be logged to the console. Translation for the next languages in the queue will not start.",
  "a_faq_window_actions_2": "Empty values will replace existing translations. The import process considers the CSV file as the \"source of truth\". If the value for the key welcome_message in the ru column is empty, the current Russian translation for this key will be overwritten.",
  "a_faq_window_actions_3": "Yes, it will. The functions in the \"Danger Zone\" scan all prefabs in the project (AssetDatabase.FindAssets(\"t:Prefab\")), not just those specified in the parsing list, to ensure the most complete cleanup possible.",
  "a_faq_window_actions_4": "In your Google Sheets document, the column must be titled \"Developer Notes\". In the cells of this column, you can write comments as usual. To specify placeholders, simply add a line like @placeholders: {username}, {score} in the comment text. The tool will automatically recognize this directive upon import.",
  "a_faq_window_actions_5": "The tool only works with one sheet at a time. The import URL includes a gid=... parameter, which uniquely identifies a specific sheet in the document. To import data from another sheet, you need to copy its URL (with a different gid) and perform the import again.",
  "a_faq_window_assets_1": "The asset scanner loads them specifying the expected type (AssetDatabase.LoadAssetAtPath(path, expectedType)). For the AudioClip category, it will only search for and load files that Unity recognizes as AudioClips. If both files are valid audio clips, the one that is processed last will be included in the table, effectively overwriting the previous one. It is recommended to avoid such duplicates.",
  "a_faq_window_assets_2": "Yes, that is exactly how it works. \"Analyze Project\" finds the Image component, looks at the name of the sprite assigned to it (e.g., icon_play_en), extracts the key (icon_play) and language (en) from it, and then adds a LocalizedAsset component to that GameObject and writes the key icon_play into it.",
  "a_faq_window_assets_3": "Yes, you can. There will be no conflicts, as a separate asset table (LocalizedAssetTable) is created for each category. Keys from the \"Sprites\" category do not overlap with keys from the \"AudioClips\" category, even if they are named the same.",
  "a_faq_window_assets_4": "Yes, it will. The scanner uses the SearchOption.AllDirectories option, which means it will recursively check all subfolders within the Scan Folder you specify.",
  "a_faq_window_content_1": "No, it will not. The Scenes to Parse list is used exclusively to let the tool know which scenes to open and analyze for text. It is in no way related to the scenes that will end up in the final build of your game.",
  "a_faq_window_content_2": "No, it will not. The temporary list stores a direct reference to the object in the scene. When you create a prefab, it is a new asset. Its instances are different objects, and the ignore rule will not apply to them. To permanently ignore prefabs, they must be added to the ignore list as a prefab asset.",
  "a_faq_window_content_3": "Yes, it will. When you click Update Keys, the parser rescans the entire project. It will see that the TMPro.TMP_Text type should be ignored and will not generate a key for it. During the process of comparing old and new keys, it will determine that the old key is no longer used and will mark it as \"Removed\".",
  "a_faq_window_content_4": "No, it will not. \"Pin\" saves the absolute path in the scene hierarchy at the moment the button is clicked (e.g., Canvas/Panel/Button). This path is not related to prefab logic. Prefab instances will have the same path, but if you rename the parent object in the scene, \"Pin\" will stop working for both the original and the instances.",
  "a_faq_window_content_5": "The full path from the scene root will be saved. For example, MyPrefab(Clone)/Content/Icon. This \"pinned\" path will only work in the scene where you created it. In other scenes, such a path is unlikely to be found.",
  "a_faq_window_preview_1": "No, it will not be saved. PreviewSafetyBridge intercepts the asset saving event (OnWillSaveAssets) and automatically calls RevertEditorPreview() before Unity writes the changes to disk. Thus, the prefab will be saved in its original, unlocalized state.",
  "a_faq_window_preview_2": "PreviewRecoveryService handles crash recovery. If Unity crashes, the service detects the backup file on the next launch and attempts to restore the scene state. If automatic recovery fails, you may need to manually select \"Revert to Original\" in the tool window.",
  "a_faq_window_preview_3": "Yes, they will. PrefabUtility.InstantiatePrefab in Edit Mode calls Awake() and OnEnable(). If these methods contain logic that should not run in the editor (e.g., accessing singletons that only exist in Play Mode), it could cause errors. It is recommended to use if (Application.isPlaying) or #if UNITY_EDITOR to protect such code.",
  "a_faq_window_report_1": "Yes, it will be interrupted. Any new action that requires UI blocking (like Update Keys) will stop the current search coroutine. A dialog box will appear, prompting you to stop the current search to start a new one.",
  "a_faq_window_report_2": "The \"Duplicates\" category will show all sources for that key. You will see one entry for the key, and the \"Source\" field will list all paths (in scene 1 and scene 2). The \"Find\" button in this case will open a dropdown list, allowing you to choose which object to navigate to.",
  "a_faq_window_report_3": "Yes. The search system is specifically trained to recognize sources like script MyScript.cs. When you click \"Find\", it will search for the MyScript.cs asset in the project and highlight (ping) it in the Project window.",
  "a_faq_window_settings_1": "Yes, they will. When changing the mode, the tool performs a \"safe migration\": it re-parses the entire project, creates new keys according to the new rules, but maps the old and new keys through the original text. It then transfers all your existing translations and comments from the old keys to the new ones. Your translations will not be lost.",
  "a_faq_window_settings_2": "The DefaultPluralRule will be used, which is suitable for English and most European languages (forms for \"one\" and \"other\").",
  "a_faq_window_settings_3": "No, they will not. Only assets located in a StreamingAssets or Resources folder are guaranteed to be included in the build. If you specify a different path, localization will work in the editor but will not work in the compiled game, as the translation files will not be part of the build.",
  "a_faq_window_settings_4": "Yes. EditorPrefs is local storage for each computer. You will need to enter the <strong>Translation Service API Key</strong> (for Editor usage like OpenAI/DeepL) on each machine. However, the <strong>Runtime API Key</strong> (used in builds) is stored in the project settings and shared via source control (encrypted).",
  "code_async_example": "using Ankonoanko.Localization.Next;\n\nprivate async void Start() {\n    // Correct way to load localized assets with Addressables\n    var sprite = await LocalizationManager.Instance.GetLocalizedAssetAsync<Sprite>(\"flag_icon\");\n    myImage.sprite = sprite;\n}",
  "code_bridge_example": "// Using the generated class (Strongly Typed)\nstring text = AnkoLoc.MyKey;\n\n// Instead of using strings\nstring text = _(\"MyKey\");",
  "code_custom_attribute_example": "// Using custom attributes for automatic scanning\npublic class MyScript : MonoBehaviour {\n    [LocalizableField]\n    public string npcName; // Automatically found\n\n    [Header(\"Title\")] \n    // If you add \"Header\" to Attributes to Scan, this will also be found!\n    public string sectionTitle;\n}",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing System.Text.RegularExpressions;\nusing UnityEngine;\nusing Ankonoanko.Localization.Next;\n\n// TEMPLATE for creating a parser for a custom component.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings,\n        string prefabContextPath,\n        Dictionary<string, string> textToKeyMap = null,\n        List<Regex> ignoreRegexes = null,\n        bool migrationActive = false)\n    {\n        // 1. Check if the object has the custom component we need.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Exit if the component is not found\n        }\n        \n        // 2. Get the text from the custom component's fields.\n        string titleText = component.Title;\n        \n        // 3. Check if the text is valid for localization.\n        // We use ParsingLogic helper to check against ignore patterns\n        if (ParsingLogic.IsValidLocalizableText(titleText, ignoreRegexes))\n        {\n            // 4. Generate the key and source using helpers from ParsingLogic.\n            string key = ParsingLogic.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode, prefabContextPath, null, textToKeyMap);\n            string source = ParsingLogic.GetSourceStringForObject(gameObject, prefabContextPath);\n            \n            // 5. Return the result.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Repeat for other fields...\n        string descriptionText = component.Description;\n        if (ParsingLogic.IsValidLocalizableText(descriptionText, ignoreRegexes))\n        {\n            string key = ParsingLogic.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode, prefabContextPath, null, textToKeyMap) + \"_desc\";\n            string source = ParsingLogic.GetSourceStringForObject(gameObject, prefabContextPath);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "code_custom_provider_example": "using System;\nusing System.Collections.Generic;\nusing System.Threading.Tasks;\nusing UnityEngine;\n\nnamespace Ankonoanko.Localization.Next\n{\n    [AssetProviderPlugin(\n        \"My Custom System\",  // ← Name visible to user\n        \"Description of your asset loading system\",  // ← Short description\n        Author = \"Your Name\",\n        Version = \"1.0\"\n    )]\n    public class MyCustomProvider : IAssetProvider\n    {\n        private Dictionary<string, UnityEngine.Object> _loadedAssets = new();\n        private string _currentLanguage;\n\n        public string ProviderName => \"My Asset System\";\n        public bool SupportsSyncLoading => true;\n        public bool SupportsAsyncLoading => true;\n\n        public void Initialize(LocalizationSettings settings) { /* Init system */ }\n\n        public T Load<T>(string key) where T : UnityEngine.Object {\n            if (_loadedAssets.TryGetValue(key, out var cached)) return (T)cached;\n            T asset = Resources.Load<T>(key); // Replace with your logic\n            if (asset != null) _loadedAssets[key] = asset;\n            return asset;\n        }\n\n        public async Task<T> LoadAsync<T>(string key) where T : UnityEngine.Object {\n            return await Task.Run(() => Load<T>(key));\n        }\n\n        public void Unload(string key) => _loadedAssets.Remove(key);\n        public void UnloadAll() => _loadedAssets.Clear();\n        public bool Exists(string key) => true;\n        public void Dispose() => UnloadAll();\n\n        public void SetCurrentLanguage(string lang) {\n            _currentLanguage = lang;\n            UnloadAll(); // Clear cache for new language\n        }\n    }\n}",
  "code_example_attribute": "using Ankonoanko.Localization.Next;\nusing UnityEngine;\nusing System.Collections.Generic;\n\n// 1. Unattached & Base Classes (No MonoBehaviour needed)\npublic class BaseData { \n    [LocalizableField] protected string rarity = \"Common\"; \n}\n\npublic class MegaTest : BaseData // Inherited fields are scanned!\n{\n    // 2. Basic Fields (Public, Private, Protected)\n    [LocalizableField] private string _private = \"Private Field\";\n    [LocalizableField] public string PublicField = \"Public Field\";\n\n    // 3. Properties (Auto & Full)\n    [LocalizableField] public string AutoProp { get; set; } = \"Auto Property\";\n    [LocalizableField] public string GetOnly { get; } = \"Get Only Property\";\n\n    // 4. Static & Constants (Global text)\n    public const string GLOBAL_CONST = \"Global Const Value\";\n    [LocalizableField] public static string StaticField = \"Static Global Text\";\n    \n    // Roslyn resolves these references during scan:\n    private const string LOCAL_CONST = \"LocalConst\";\n    [LocalizableField] public string ReferenceConst = LOCAL_CONST;\n    [LocalizableField] public string GlobalConstRef = GLOBAL_CONST;\n\n    // 5. String Concatenation & Interpolation (Calculated at parse time)\n    [LocalizableField] public string Concat1 = \"Hello \" + \"World\";\n    [LocalizableField] public string Concat2 = \"Prefix: \" + LOCAL_CONST;\n    \n    // 6. Custom Keys & Attributes\n    [LocalizableField(\"main_menu_title\")] public string Title = \"Game Title\";\n    [LocalizableField(key: \"custom_key_syntax\")] public string KeySyntax = \"Explicit Key\";\n    \n    [Header(\"Header Text\")] // Scanned if 'Header' added to Attributes to Scan\n    [Tooltip(\"Tooltip Text\")]\n    public string annotatedField;\n    \n    // 7. Collections (Arrays, Lists, Target-typed new)\n    [LocalizableField] public string[] Array1 = { \"A\", \"B\" };\n    [LocalizableField] public List<string> List1 = new List<string> { \"C\", \"D\" };\n    [LocalizableField] public List<string> ListNew = new() { \"E\", \"F\" }; // C# 9.0+\n    \n    // 8. Nested Objects (Deep Recursion)\n    [System.Serializable]\n    public class DialogStep {\n        [LocalizableField] public string actorName;\n        [LocalizableField] public string message;\n    }\n    [LocalizableField] public DialogStep introStep; \n    [LocalizableField] public List<DialogStep> dialogSelect; // List of objects!\n}",
  "code_example_attribute_limitations": "[LocalizableField]\npublic Dictionary<string, string> Dict; // FAIL: Dictionary (Use Lists)\n\n[LocalizableField]\npublic int Number = 5; // FAIL: Non-string types",
  "code_example_function": "// 1. Add Static Import for short syntax\nusing static Ankonoanko.Localization.Next.LocalizationManager; \n\npublic class RuntimeExample : MonoBehaviour {\n    void Demo() {\n        // 2. Simple Key/Text lookup\n        _(\"Hello World\");\n        \n        // 3. Indexed Formatting ({0}, {1})\n        _(\"Score: {0} / {1}\", 10, 20); \n\n        // 4. Named Arguments (Smart Formatting)\n        // Uses anonymous object. Key = \"welcome_user\"\n        _(\"welcome_user\", new { name = \"Hero\", level = 5 }); \n\n        // 5. Pluralization (Integer argument)\n        // Automatically finds key_one, key_few, key_many\n        _(\"coins_count\", 5); \n\n        // 6. Genderization (Gender enum)\n        // Automatically finds key_male, key_female\n        _(\"npc_greeting\", Gender.Female);\n\n        // 7. Manual Dictionary (High performance / Dynamic)\n        var args = new Dictionary<string, object> { { \"rank\", \"S\" } };\n        _(\"rank_msg\", args);\n\n        // 8. Nesting (Translating arguments recursively)\n        _(\"Element: {0}\", _(\"Fire\")); \n    }\n}",
  "code_example_plurals": "using static Ankonoanko.Localization.Next.LocalizationManager;\nusing Ankonoanko.Localization.Next;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Keys: \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Texts: \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Automatically selects the correct form\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Keys: \"user_greeted_male\", \"user_greeted_female\"\n        // Texts: \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "code_script_rule_example": "// Supporting custom or third-party functions\n// Before: The scanner only sees _(\"key\") calls\nstring text = MyLegacySystem.Translate(\"old_key\");\nstring i2Text = LocalizationManager.GetTranslation(\"I2_KEY\");\n\n// After: Add a Script Parsing Rule with regex pattern\n// These keys will now be automatically indexed and managed by the tool!",
  "copy_code_copied": "Copied!",
  "copy_code_copy": "Copy",
  "copy_code_error": "Error",
  "error_loading_message": "Please check your connection and refresh.",
  "error_loading_title": "Loading Error",
  "h1_ai_audio": "AI Audio / Text-to-Speech",
  "h1_ai_profiles": "AI & Translation Profiles",
  "h1_api_snippets": "API & Code Snippets",
  "h1_components": "Core Components (assigned automatically)",
  "h1_extending": "Extending Functionality",
  "h1_faq": "FAQ & Troubleshooting",
  "h1_font_glyph_manager": "Font & Glyph Manager",
  "h1_important_notes": "Important Notes and Warnings",
  "h1_introduction": "Introduction",
  "h1_loc_tool_window": "\"Localization Tool\" Window",
  "h1_migration_tool": "Migration Tool",
  "h1_quick_start": "Quick Start and Setup",
  "h1_tms": "External TMS Integration (Crowdin, Loco, Phrase, Transifex)",
  "h1_translation_editor": "Translation Table Editor",
  "h1_usage_examples": "Usage Examples",
  "h2_ai_assistant": "AI Assistant Commands",
  "h2_ai_audio_setup": "Setup",
  "h2_ai_audio_usage": "Usage",
  "h2_ai_context": "Context & Glossary",
  "h2_ai_profiles_overview": "Translation Profiles",
  "h2_async_api": "Asynchronous API (Addressables)",
  "h2_backup_manager": "Backup Manager",
  "h2_bridge_generation": "Generate C# Bridges (Strongly Typed Access)",
  "h2_custom_ai": "Custom AI & Models",
  "h2_custom_asset_provider": "Creating a Custom Asset Provider",
  "h2_custom_attributes": "Custom Attributes Scanning",
  "h2_custom_parser": "Creating a Custom Parser",
  "h2_example_attribute": "[LocalizableField] Attribute",
  "h2_example_components": "Ready-made Components and Examples",
  "h2_example_components_updated": "Updated LanguageSelector.cs",
  "h2_example_function": "_() Function and [OnLanguageChange] Attribute",
  "h2_example_plurals": "Plurals and Gender",
  "h2_faq_addressables": "Addressables & Migration",
  "h2_faq_audio": "AI Audio / Text-to-Speech",
  "h2_faq_components": "Core Components",
  "h2_faq_editor": "Translation Editor",
  "h2_faq_examples": "Usage Examples & Code",
  "h2_faq_extending": "Extending Functionality",
  "h2_faq_installation": "Installation & Quick Start",
  "h2_faq_notes": "Important Nuances & Warnings",
  "h2_faq_window": "\"Localization Tool\" Window",
  "h2_font_glyph_manager_features": "Features",
  "h2_in_editor_preview": "In-Editor & Prefab Preview",
  "h2_initial_setup": "Initial Setup",
  "h2_installation": "Installation",
  "h2_key_features": "Key Features",
  "h2_live_updates_guide": "Live Updates Guide",
  "h2_localizedasset": "LocalizedAsset",
  "h2_localizedasset_updated": "LocalizedAsset Asynchronous Loading",
  "h2_localizedbehaviour": "LocalizedBehaviour",
  "h2_localizeddropdown": "LocalizedDropdown",
  "h2_localizedprefab": "LocalizedPrefab",
  "h2_localizedtext": "LocalizedText",
  "h2_migration_custom": "Creating Custom Profiles",
  "h2_migration_google_sheets": "Google Sheets Key",
  "h2_migration_import_formats": "Import Formats (CSV & Google Sheets)",
  "h2_migration_stubs": "Safe Migration & Emergency Stubs",
  "h2_migration_tool_features": "Features",
  "h2_migration_workflow": "Migration Workflow Guide",
  "h2_preview_overlay": "Scene View Overlay",
  "h2_safety_caps": "Limits & Safety Quotas",
  "h2_script_parsing_rules": "Script Parsing Rules (Compatibility)",
  "h2_tab_actions": "\"Actions\" Tab",
  "h2_tab_assets": "\"Assets\" Tab",
  "h2_tab_content": "\"Content\" Tab",
  "h2_tab_report": "\"Report\" Tab",
  "h2_tab_settings": "\"Settings\" Tab",
  "h2_tab_tutorials": "\"Tutorials\" Tab",
  "h2_tms_setup": "Setup & Usage",
  "h2_tms_supported": "Supported Services",
  "h2_uitklocalization": "UITKLocalization",
  "h2_visual_debugging_guide": "Visual Debugging",
  "h2_window_footer": "Window Footer (Status Bar)",
  "h2_window_header": "Window Header & Toolbar",
  "h2_window_sidebar": "Main Menu (Sidebar)",
  "h3_actions_autotranslate": "Auto-Translation",
  "h3_actions_danger": "Danger Zone",
  "h3_actions_data": "Data Management",
  "h3_actions_editor": "Translation Editor",
  "h3_actions_parsing": "Parsing",
  "h3_actions_tms_integration": "External Services (TMS)",
  "h3_assets_automation": "Automation",
  "h3_assets_categories": "Asset Categories",
  "h3_assets_folder_gen": "Folder Generation",
  "h3_assets_loading": "Loading Strategy",
  "h3_assets_storage": "Storage Configuration",
  "h3_attribute_cheat_sheet": "Quick Reference: Do's and Don'ts",
  "h3_attribute_features": "Supported Types & Features",
  "h3_attribute_limitations": "Limitations",
  "h3_content_components_ignore": "Component Types to Ignore",
  "h3_content_dynamic_keys": "Dynamic Key Prefixes",
  "h3_content_dynamic_texts": "Dynamic Texts",
  "h3_content_objects_ignore": "Objects to Ignore",
  "h3_content_prefabs": "Prefab Folders",
  "h3_content_regex": "Ignored Regex Patterns",
  "h3_content_scenes": "Scenes to Parse",
  "h3_content_script_rules": "Script Parsing Rules",
  "h3_content_scripts_ignore": "Scripts to Ignore",
  "h3_custom_provider_steps": "Implementation Steps",
  "h3_faq_window_actions": "\"Actions\" Tab",
  "h3_faq_window_assets": "\"Assets\" Tab",
  "h3_faq_window_content": "\"Content\" Tab",
  "h3_faq_window_preview": "In-Editor Preview",
  "h3_faq_window_report": "\"Report\" Tab",
  "h3_faq_window_settings": "\"Settings\" Tab",
  "h3_mode_auto": "AutoGenerateKeysOnly (Standard)",
  "h3_mode_hybrid": "Hybrid Modes (Custom Priority)",
  "h3_mode_text": "UseTextAsKey (Simplified)",
  "h3_report_all_keys": "All Keys",
  "h3_settings_debugging": "Debugging",
  "h3_settings_general": "General Settings",
  "h3_settings_keygen": "Key Generation",
  "h3_settings_languages": "Language Management",
  "h3_settings_liveupdates": "Live Updates",
  "h3_settings_pseudo": "Pseudo-Localization Settings",
  "h3_settings_runtimeapi": "Runtime API",
  "h3_settings_tools": "General & Dev Tools",
  "h3_tutorials_list": "Tutorial List",
  "lbl_not_supported": "NOT Supported",
  "lbl_supported": "Fully Supported",
  "li_actions_1": "<strong>Parsing:</strong><ul><li><strong>Update Keys:</strong> Full project scan defined by the 'Content' tab settings.</li><li><strong>Scan Selected Assets:</strong> Scans ONLY the files/folders currently selected in the Project View. Safer for partial updates as it automatically disables 'Remove Missing Keys'.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor:</strong> Opens a separate, more convenient window for editing all translations.",
  "li_actions_3": "<strong>Data Management:</strong> Use for exchanging data with translators (Export/Import to CSV/XML/YAML/XLIFF, import from Google Sheets). <strong>Google Sheets:</strong> Supports both 'Edit' links and 'Publish to Web' URLs (check GID parameter).",
  "li_actions_4": "<strong>Auto-Translation:</strong> Automatically fills all empty translation strings using the active <strong>Translation Profile</strong>.",
  "li_actions_5": "<strong>Danger Zone:</strong> Contains buttons for completely removing all localization components from the project. Use with caution!",
  "li_ai_1": "<strong>Create Profile:</strong> Right-click in Project view -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Services:</strong> Supports DeepL, Google Translate, Microsoft Azure, and <strong>Custom AI</strong>.",
  "li_ai_3": "<strong>Settings:</strong> Each profile stores its own API Key, limits (batch size, max chars), and model settings.",
  "li_ai_4": "<strong>AIPresetsGenerator:</strong> Use the built-in generator to quickly create profiles for popular services (OpenAI, Gemini, Claude, Ollama).",
  "li_ai_audio_generate": "In <strong>Translation Table Editor</strong>, select rows/cells -> Right-click -> <strong>Generate Audio</strong>.",
  "li_ai_audio_hash": "<strong>Smart Update & Hashing:</strong> The tool calculates an MD5 hash of your text content and only regenerates audio files if the source text has changed, saving your API credits. It detects if the translation has changed since the last audio generation. The editor highlights these rows with an 'Outdated' icon (yellow), allowing you to update ONLY changed lines. This smart batching feature prevents unnecessary API calls and reduces costs when regenerating audio. The tool hashes your text and only regenerates audio files if the source text has changed, saving your API credits.",
  "li_ai_audio_profile": "In <strong>Settings</strong>, select the <strong>Active Audio Profile</strong> (e.g., OpenAI TTS or ElevenLabs).",
  "li_ai_audio_save": "Files are saved to the folder specified in the profile.",
  "li_ai_audio_voice_mapping": "<strong>Voice Mapping (Multi-Speaker):</strong> Assign different AI voices to different characters automatically. Use the <strong>Voice Mappings</strong> list to link Regex patterns (e.g. <code>^hero_.*</code>) to specific Voice IDs. The tool will automatically select the correct voice based on the key name during audio generation.",
  "li_ai_provider_settings": "<strong>Provider Settings:</strong> Each service allows configuration of API Keys, Models (e.g., GPT-4o, Sonnet), and voice specific parameters (Stability, Similarity).",
  "li_api_async_method": "<strong>GetLocalizedAssetAsync&lt;T&gt;:</strong> Use this for loading Addressables assets asynchronously. It returns a <code>Task&lt;T&gt;</code>.",
  "li_api_gender_method": "GetGendered: GetGendered(string baseKey, Gender gender) returns a gender-specific translation.",
  "li_api_plural_method": "<strong>GetPlural:</strong> <code>GetPlural(string baseKey, double count)</code> returns the correct plural form based on language-specific rules.",
  "li_api_set_lang_method": "<strong>SetLanguage:</strong> A coroutine (<code>IEnumerator</code>) for changing the language. Always use <code>StartCoroutine()</code>.",
  "li_assets_1": "<strong>Create a folder structure (optional):</strong> In section <strong>2. Asset Folder Generation</strong>, click <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Configure categories and naming rules:</strong> In section <strong>3. Asset Categories & Scanning</strong>, make sure the <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) matches your files (e.g., <code>button_ok_en.png</code>).",
  "li_assets_3": "<strong>Place your assets:</strong> Put the localized assets in the folders.",
  "li_assets_4": "<strong>Scan assets:</strong> In section <strong>4. Automation</strong>, click <strong>Scan Assets & Update Tables</strong>. The cleanup process has become safer: now only old table files (<code>.asset</code>) are deleted, not the entire folder.",
  "li_assets_5": "<strong>Link assets to objects:</strong> Click <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Addressables Integration:</strong> If <strong>Addressables</strong> mode is enabled, assets will be automatically registered in Addressables groups with addresses in the form <code>{Category}/{Language}/{Key}</code> during scanning.",
  "li_assets_addressables_naming": "<strong>Naming Convention:</strong> When scanning, the tool automatically sets Addressable Addresses to the format <code>{Category}/{Language}/{Key}</code>. <strong>Do not rename</strong> these addresses manually, as the LocalizationManager relies on this specific format to load assets at runtime.",
  "li_assets_auto_folders": "<strong>Auto-Generate Folders:</strong> If enabled, the tool will automatically create the necessary directory structure for all supported languages during the first asset localization.",
  "li_assets_folder_gen": "<strong>Folder Generation:</strong> Automatically create the folder structure for localized assets according to your rules.",
  "li_assets_storage_path": "<strong>Asset Storage Path:</strong> Define the root directory for all localized assets (Sprites, Audio, etc.). Use the <code>{lang}</code> variable to specify how per-language folders are structured.",
  "li_assistant_1": "<strong>Configurable:</strong> Define commands in your Translation Profile (e.g., \"Fix Grammar\", \"Make Formal\", \"Shorten for UI\").",
  "li_assistant_2": "<strong>Batch Processing:</strong> Select multiple cells to apply the command to all of them at once.",
  "li_assistant_3": "<strong>Custom Commands:</strong> Define your own prompts in the <strong>Translation Profile</strong> inspector (List of <code>AIAssistantCommand</code>). Each command has a <strong>Label</strong> (appears in the context menu) and a <strong>Prompt</strong> (the instructions sent to the AI, e.g., 'Rewrite in pirate style').",
  "li_attr_feat_1": "<strong>Collections:</strong> Supports <code>List&lt;string&gt;</code> and <code>string[]</code>. Keys are generated with suffixes <code>_0</code>, <code>_1</code>, etc. You can even use a custom key on the list field itself to prefix all items.",
  "li_attr_feat_2": "<strong>Access Modifiers:</strong> Works with <code>private</code>, <code>protected</code>, <code>internal</code>, and <code>public</code> fields.",
  "li_attr_feat_3": "<strong>Custom Attributes:</strong> In the <em>Content Tab</em> settings, you can add <code>HeaderAttribute</code>, <code>TooltipAttribute</code>, or any custom attribute name. The parser will then treat fields with these attributes (e.g., <code>[Header(\"Text\")]</code>) as localizable strings!",
  "li_attr_feat_4": "<strong>Nested Objects:</strong> Recursively scans fields inside classes or structs marked with <code>[System.Serializable]</code>. This includes single instances and lists of nested objects.",
  "li_attr_feat_5": "<strong>Formatted Strings:</strong> Supports interpolated strings (<code>$\"Text {0}\"</code>), verbatim strings (<code>@\"Text\"</code>), and concatenation (<code>\"A\" + \"B\"</code>).",
  "li_attr_limit_1": "<strong>Properties are Supported:</strong> The parser scans both <code>Fields</code> and <code>Properties</code>. A Getter is required.",
  "li_attr_limit_2": "<strong>Dictionaries:</strong> <code>Dictionary&lt;T, string&gt;</code> is not directly supported for parsing.",
  "li_attr_limit_3": "<strong>Static Fields:</strong> Supported via static analysis (regex) in code files, but generally recommended to use instance fields for robust detection on GameObjects.",
  "li_backup_desc": "Track changes and restore previous versions of your translations.",
  "li_backup_rollback": "<strong>Rollback:</strong> Instantly revert selected keys or the entire table to a previous state.",
  "li_backup_snapshots": "<strong>Snapshots:</strong> Creates named restore points before bulk operations.",
  "li_cheat_base_private": "<strong>Base Private Fields:</strong> Supported (Scanner reads base class files directly)",
  "li_cheat_collections": "<code>List&lt;string&gt;</code>, <code>string[]</code> Arrays",
  "li_cheat_concatenation": "<strong>String Concatenation:</strong> <code>\"A\" + \"B\"</code> (Supported)",
  "li_cheat_constructor_args": "<strong>Complex Constructor Args:</strong> <code>new Item(\"Name\" + index)</code>",
  "li_cheat_dictionaries": "<strong>Dictionaries</strong> (Not serializable by Unity inspector naturally)",
  "li_cheat_headers": "Attributes like <code>[Header(\"...\")]</code> (Fully Supported)",
  "li_cheat_nested_lists": "<strong>Lists of Nested Objects</strong> (e.g. <code>List&lt;ItemData&gt;</code>)",
  "li_cheat_non_literals": "<strong>Variables & Constants:</strong> <code>const string s = \"Value\";</code> or <code>static string</code> (Supported, Roslyn resolves values from the same file)",
  "li_cheat_private": "<code>private</code> / <code>protected</code> fields (Supported)",
  "li_cheat_properties": "<strong>Properties:</strong> <code>{ get; set; }</code> (Auto-properties & Full Properties supported)",
  "li_cheat_scriptable_objects": "<strong>ScriptableObjects</strong> (Supported if referenced)",
  "li_cheat_serializable": "Nested <code>[Serializable] class</code> (Inventory items, Dialog nodes)",
  "li_cheat_static": "<strong>Static Fields:</strong> <code>public static string</code> (Fully supported)",
  "li_cheat_structs": "<strong>Structs & Records:</strong> Supported (Recursive scanning)",
  "li_cheat_ternary": "<strong>Logic/Ternary:</strong> <code>cond ? \"A\" : \"B\"</code> (Parser cannot determine the value)",
  "li_cheat_unattached": "<strong>Unattached Scripts:</strong> Supported (Scanner reads all .cs files in project)",
  "li_content_1": "<strong>Scenes to Parse:</strong> Drag and drop all scenes for analysis here.",
  "li_content_2": "<strong>Prefab Folders:</strong> Specify folders with prefabs. Now supports pagination and search for large projects.",
  "li_content_3": "<strong>Dynamic Texts:</strong> Enter strings that are created exclusively in code here (e.g., \"Game Over\").",
  "li_content_4": "<strong>Component Types to Ignore:</strong> Specify Unity Component types that should be skipped during scanning.",
  "li_content_5": "<strong>Pin to Ignore:</strong> This feature allows you to \"pin\" an object from the scene to the ignore list persistently.",
  "li_content_6": "<strong>Scripts to Ignore:</strong> Add specific C# scripts OR entire folders to exclude them from parsing.",
  "li_content_7": "<strong>Dynamic Key Prefixes:</strong> List of prefixes for keys (e.g., <code>Item_</code>) that will not be deleted during cleanup.",
  "li_content_dynamic_keys": "<strong>Dynamic Key Prefixes:</strong> Define prefixes (e.g., <code>quest_item_</code>) that should be recognized as potentially dynamic. This helps the tool distinguish between static UI labels and data-driven keys.",
  "li_content_dynamic_texts": "<strong>Dynamic Text Rules:</strong> Configure patterns for text that is updated dynamically via code. This prevents the scanner from creating redundant keys for text that changes at runtime.",
  "li_content_regex_example": "<strong>Custom Wrapper Example:</strong> If you use a custom function like <code>MyGame.Loc(\"KEY\")</code>, add a Script Parsing Rule with the regex: <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>.",
  "li_content_regex_presets": "<strong>Ignored Regex Patterns:</strong> Click <strong>'Add Common Pattern'</strong> to quickly exclude dynamic content like URLs, Emails, etc.",
  "li_content_scanner": "<strong>Roslyn Code Scanner:</strong> A deep static analysis engine that understands C# syntax trees for robust key detection.",
  "li_content_scanner_details_1": "<strong>Smart Call Detection:</strong> automatically finds <code>LocalizationManager._(\"Text\")</code>, <code>_(\"Text\")</code>, and <code>GetTranslation(\"Text\")</code> calls. It enforces <strong>Text-As-Key</strong> mode for these calls to ensure runtime features like Pluralization and Gender work correctly.",
  "li_content_scanner_details_2": "<strong>Constant Resolution:</strong> The scanner is smart enough to resolve `const` or `static readonly` string variables. If you use <code>_ (MyConst)</code>, it will find the value of `MyConst` (if defined in the same class) and use it as the source text.",
  "li_content_scanner_details_3": "<strong>Attribute & Metadata:</strong> It scans any field or property with `[LocalizableField]`, `[Header]`, or `[Tooltip]` (if configured). It handles <strong>Arrays</strong>, <strong>Lists</strong>, and even <strong>Nested Serializable Classes</strong> recursively.",
  "li_content_scanner_details_4": "<strong>Modern C# Support:</strong> Full support for C# 9.0+ syntax, including target-typed <code>new()</code> expressions, implicit array creation, and interpolated strings (`$\"String {0}\"`).",
  "li_content_script_rules_attributes": "<strong>Attributes to Scan:</strong> Define custom attributes (like <code>[Header]</code> or <code>[Tooltip]</code>) that the parser should recognize as localizable string sources.",
  "li_content_script_rules_bridge_name": "<strong>Bridge Class Name:</strong> Allows you to define the name of the generated static class.",
  "li_content_script_rules_bridges": "<strong>Generate C# Bridges:</strong> Automatically creates a static class (e.g., <code>AnkoLoc</code>) providing strongly-typed access to all keys, eliminating magic strings and enabling IDE autocompletion.",
  "li_context_1": "<strong>Developer Notes:</strong> Comments from the translation table are passed to the AI as context.",
  "li_context_2": "<strong>Object Path:</strong> If no comment exists, the object's hierarchy path (e.g., <code>MainMenu/Canvas/StartButton</code>) is used as fallback context.",
  "li_context_3": "<strong>Glossary:</strong> You can load a CSV glossary into the profile to enforce specific translations for terms and names.",
  "li_context_4": "<strong>Project Description:</strong> Describe your game's setting and audience to help the AI understand the general context.",
  "li_context_5": "<strong>Tone & Style:</strong> Define the desired persona (e.g., 'Friendly', 'Professional', 'Pirate') and formatting rules.",
  "li_context_glossary": "<strong>Dictionary Manager:</strong> Interact directly with the glossary to 'Add', 'Edit', or 'Remove' terms. Supports Case Sensitivity and 'Do Not Translate' types.",
  "li_context_optimization": "<strong>Token Optimization:</strong> The system intelligently compacts context and reuses cache to minimize token usage and costs.",
  "li_custom_ai_1": "<strong>GenericAIService:</strong> A flexible implementation that can communicate with OpenAI-compatible APIs (including local LLMs via Ollama).",
  "li_custom_ai_2": "<strong>Templates & Auth:</strong> Fully customize the request. <ul><li><strong>Auth:</strong> Configure <code>Auth Header Key</code> (e.g., <code>Authorization</code>) and <code>Format</code> (e.g., <code>Bearer {0}</code>). Supports API key in query parameters.</li><li><strong>Body Template:</strong> Use a JSON template with placeholders like <code>{model}</code> and <code>{prompt}</code> for text, or <code>{input}</code> and <code>{voice}</code> for audio.</li><li><strong>Response Path:</strong> Define the JSON path to the result (e.g., <code>choices[0].message.content</code>).</li></ul>",
  "li_custom_ai_3": "<strong>Built-in Safety Features:</strong> Automatically repair broken formatting tags (like <ph0>) often returned by AI models, ensuring reliable and consistent translations.",
  "li_custom_parser_1": "Create a new C# script in the <strong>Editor</strong> folder of your project.",
  "li_custom_parser_2": "Copy the template below into it.",
  "li_custom_parser_3": "Modify the logic to match your component.",
  "li_custom_provider_manual_reg": "<strong>Manual Registration:</strong> For advanced scenarios (like DI injection or lazy init), you can manually register your provider via <code>AssetProviderFactory.RegisterCustomProvider(\"MyID\", myInstance)</code> during initialization.",
  "li_custom_provider_step_1": "<strong>Implement the Interface:</strong> Create a new class that implements <code>IAssetProvider</code>. You'll need to define how to <code>Load&lt;T&gt;</code> (sync) and <code>LoadAsync&lt;T&gt;</code> (async) assets using your system's API.",
  "li_custom_provider_step_2": "<strong>Define Lifecycle:</strong> Implement <code>Initialize</code>, <code>Dispose</code>, and <code>UnloadAll</code>. These methods are called by the <code>LocalizationManager</code> when switching languages or cleaning up resources.",
  "li_custom_provider_step_3": "<strong>Language Safety:</strong> The <code>SetCurrentLanguage</code> method is called whenever the active language changes. Use this to update internal paths or re-fetch asset metadata.",
  "li_custom_provider_step_4": "<strong>Auto-Discovery (Recommended):</strong> Decorate your class with the <code>[AssetProviderPlugin]</code> attribute. This makes your provider instantly visible in the <strong>Settings Tab -&gt; Asset Loading Strategy</strong> dropdown.",
  "li_editor_1": "<strong>Smart Grouping:</strong> Keys for plurals and gender (e.g., <code>apple_count_one</code>, <code>apple_count_few</code>) are automatically combined into collapsible groups.",
  "li_editor_2": "<strong>Advanced Editing:</strong> Click on a cell to open the <strong>MultiLineEditWindow</strong> popup. It shows the source text for comparison and validates placeholders.",
  "li_editor_3": "<strong>Advanced Selection:</strong> Supports flexible selection modes: individual cells, entire rows, or specific columns (languages). Use <code>Ctrl+Click</code> and <code>Shift+Click</code> for complex selections.",
  "li_editor_4": "<strong>Mass Actions:</strong> Execute operations on thousands of cells at once. Right-click your selection to: <ul><li><strong>Auto-Translate:</strong> Fill missing translations using the active AI Profile.</li><li><strong>Fill from Source:</strong> Quickly reset translations.</li><li><strong>Toggle Lock:</strong> Protect 'perfect' translations from accidental overwrites.</li><li><strong>Generate Audio:</strong> Batch process TTS for selected phrases.</li></ul>",
  "li_editor_5": "<strong>High-Performance Navigation:</strong> The editor uses a virtualized 'MultiColumnListView' for smooth scrolling with 10k+ keys. Supports keyboard navigation (Arrows/Tab) and industrial-strength shortcuts: <code>Ctrl+S</code> (Save), <code>Ctrl+Z/Y</code> (Undo/Redo), <code>Ctrl+F</code> (Search focus).",
  "li_editor_6": "<strong>Advanced Search Presets:</strong> Audit your project using specialized filters: <ul><li><strong>Status:</strong> Untranslated (Current/Any Lang), Identical to Source, Locked.</li><li><strong>Content:</strong> Has Comments, Has/Missing Placeholders, Has Length Issues (Auto-detected).</li><li><strong>Structure:</strong> Pluralized, Gendered, or Both.</li><li><strong>Audio:</strong> Missing Audio, Outdated (Hash Mismatch).</li></ul>",
  "li_editor_7": "<strong>Smart Audio Management:</strong> Tracks the 'freshness' of your TTS files. If you edit the translation text, a <strong>Yellow Indicator (Outdated)</strong> appears, indicating that the audio file hash no longer matches the text. One click regenerates only the stale files.",
  "li_editor_8": "<strong>Locking Mechanism:</strong> Explanation: <ul><li><strong>Locked Cells/Rows:</strong> Prevents any modification by <strong>Auto-Translate</strong>, <strong>CSV/Google Import</strong>, or <strong>Fill from Source</strong>.</li><li><strong>Use Case:</strong> Lock 'Golden' translations that have been manually verified by native speakers.</li><li><strong>Bulk Control:</strong> Lock entire languages or specific features (like character names) project-wide.</li></ul>",
  "li_editor_layout": "<strong>Dynamic Multi-Pane Layout:</strong> Use the 3-pane system to pin 'fixed' columns (like Keys) to the left side while scrolling through 20+ languages in the middle. Toggle column visibility via the header context menu.",
  "li_editor_regex": "<strong>Regex Search:</strong> Both the main window and the table editor support <strong>Regular Expressions</strong>. If your query contains symbols like <code>* + ? ^ $ [ ] ( ) { } | .</code>, it is automatically treated as a Regex (e.g., <code>^item_.*</code> to find all keys starting with 'item_').",
  "li_editor_structure": "<strong>Tables & Groups:</strong> Data is organized in Tables (Files), displayed as Groups (Folders) in the editor for better navigation.",
  "li_editor_ui_test": "<strong>Built-in UI Testing:</strong> <ul><li><strong>Length Expansion Slider:</strong> Simulate text expansion (0% - 100%) to see how your UI handles longer languages like German or Russian without leaving the editor.</li><li><strong>Rich Text Renderer:</strong> Toggle rendering of tags (<code>&lt;b&gt;</code>, <code>&lt;color&gt;</code>) to verify styling without running the game.</li></ul>",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code>:</strong> A ready-made component for creating a UI dropdown list for language switching. It automatically finds all available languages and manages their switching.<br><strong>How to use:</strong> Simply add the <code>LanguageSelector</code> component to your scene (e.g., on an empty GameObject) and specify your <code>TMP_Dropdown</code> in the inspector.",
  "li_example_components_2": "<strong>Code Examples:</strong> To learn advanced techniques such as working with <code>[LocalizableField]</code>, the <code>_()</code> function, plurals, and gender, study the <code>StatPurchaseTest.cs</code> and <code>TestLocalization.cs</code> files. They clearly demonstrate the implementation of all the main features of the tool in code.",
  "li_example_components_new": "<strong>New (v2.0):</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code>. Returns <code>IEnumerator</code>. Must be yielded.",
  "li_example_components_old": "<strong>Old:</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (synchronous void) - <strong>Deprecated</strong>. Use Coroutine version.",
  "li_feature_1": "<strong>Advanced Parsing:</strong> Automatic scanning of scenes, prefabs, UI Toolkit (UXML), and C# scripts, including fields marked with the <code>[LocalizableField]</code> attribute, as well as nested classes and lists.",
  "li_feature_10": "<strong>Backup Manager:</strong> A built-in tool for creating and restoring backups.",
  "li_feature_11": "<strong>AI Powered:</strong> Support for OpenAI, Anthropic (Claude), Google Gemini, and local LLMs (Ollama) via customizable profiles.",
  "li_feature_12": "<strong>Text-to-Speech (TTS):</strong> Generation of audio files for localized strings using AI (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Migration Tools:</strong> Tools for automatic transition from I2 Localization and Unity Localization plugins.",
  "li_feature_14": "<strong>Font & Glyph Manager:</strong> Tool for analyzing used characters and finding missing glyphs in fonts.",
  "li_feature_15": "<strong>Visual Debugging:</strong> Icons in hierarchy and labels in Scene View for quick debugging.",
  "li_feature_2": "<strong>Localization of Any Asset:</strong> Manage sprites, audio, prefabs, materials, etc.",
  "li_feature_3": "<strong>Powerful Translation Editor:</strong> A centralized interface with auto-saving, full Undo/Redo support, smart key grouping, and multi-selection actions.",
  "li_feature_4": "<strong>AI & Machine Translation:</strong> Profile system supporting DeepL, Google, Microsoft, and <strong>Custom AI (OpenAI, Gemini, Claude, Ollama)</strong> with context awareness.",
  "li_feature_5": "<strong>Flexible Import/Export:</strong> Support for CSV, XML, YAML, XLIFF, and direct import from Google Sheets.",
  "li_feature_6": "<strong>Live Preview:</strong> Preview any language in Scene View or <strong>Prefab Mode</strong> without running the game.",
  "li_feature_7": "<strong>Plural & Gender Support:</strong> Full CLDR support (v43). Includes rules for <strong>Asian</strong> (None), <strong>English/Germanic</strong> (One, Other), <strong>French</strong> (One 0-1), <strong>Slavic</strong> (One, Few, Many - RU, UK, PL), <strong>Arabic</strong>, <strong>Celtic</strong>, <strong>Baltic</strong> (LT, LV), and more.",
  "li_feature_8": "<strong>Full RTL Support:</strong> Correct display of right-to-left languages.",
  "li_feature_9": "<strong>Live Updates:</strong> Load up-to-date translations from a remote server at game start.",
  "li_feature_tool_translation": "<strong>Fully Translated UI:</strong> The tool's interface is localizable. You can switch the editor language using the dropdown in the <strong>Main Window header</strong>.",
  "li_font_global": "<strong>Global Report:</strong> Generates a report of all missing glyphs across all languages.",
  "li_font_glyph_analyze": "Analyzes all translations and checks if the assigned font (TMP_FontAsset) supports all used characters.",
  "li_font_glyph_copy": "Allows copying all unique language characters for font atlas generation. Includes <strong>filters to exclude ASCII, Numbers, and Punctuation</strong> to optimize texture space.",
  "li_font_glyph_missing": "Shows a list of missing glyphs.",
  "li_font_glyph_workflow": "<strong>Workflow for TMP:</strong> 1. Run Scan. 2. Select a language with missing glyphs. 3. Click <strong>'Copy Character Set'</strong>. 4. Open Window -> TextMeshPro -> Font Asset Creator. 5. Paste the clipboard into the 'Character Sequence (Custom Range)' field to generate an atlas containing exactly the characters your game needs.",
  "li_font_unicode": "<strong>Unicode Ranges:</strong> View the specific Unicode ranges used in your translations (e.g. Basic Latin, Cyrillic) to optimize font assets.",
  "li_footer_status": "<strong>Status & Progress:</strong> Real-time feedback on parsing, importing, or AI generation tasks.",
  "li_header_lang_selector": "<strong>Editor Language:</strong> Switch the tool's interface language. The tool UI is fully localizable.",
  "li_header_preview_btn": "<strong>Preview Toggle:</strong> Quickly enable or disable the in-editor preview. Use the 'Revert' button to restore original scene values.",
  "li_header_toolbar_buttons": "<strong>Global Toolbar:</strong> Direct access to Documentation, Discord, Settings Asset, Dependency Checker, and Review page.",
  "li_install_1": "<strong>IMPORTANT (v2.0 Update):</strong> If upgrading from v1.x, you <strong>MUST delete</strong> the old `Ankonoanko` folder before importing. Version 2.0 requires a clean installation due to namespace changes.",
  "li_install_2": "The tool will automatically check for necessary dependencies. Confirm the installation in the dialog box that appears.",
  "li_install_3": "Required dependencies (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) are necessary for basic functionality.",
  "li_install_4": "Optional dependencies (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) enable additional features.",
  "li_install_5": "Click <strong>Install Selected</strong> to install the recommended packages.",
  "li_install_6": "After installation, open the main tool window via the <strong>Tools -> Localization Tool</strong> menu.",
  "li_install_7": "If you plan to use asynchronous asset loading, install the <strong>Addressables</strong> package via Package Manager.",
  "li_live_updates_1": "<strong>Enable:</strong> in Settings, check 'Enable Live Updates'.",
  "li_live_updates_2": "<strong>Source:</strong> Provide a <code>Live Update URL</code> returning a JSON dictionary, or a <code>Google Sheet URL</code>.",
  "li_live_updates_3": "<strong>Cache:</strong> Translations are cached locally at <code>liveUpdateCachePath</code> to ensure the game works offline.",
  "li_live_updates_4": "<strong>Security:</strong> Use the <strong>Runtime API Key</strong> (encrypted) if your server requires authentication.",
  "li_localizedtext_1": "<code>localizationKey</code>: The key used to find the translation. Can be auto-generated or manually assigned.",
  "li_localizedtext_2": "<code>isStyleOnly</code>: If <code>true</code>, the component will only apply styles (font, RTL) but will not change the text itself. Critical for dynamic text elements (e.g. text updated via `_()` calls in scripts).",
  "li_localizedtext_3": "<code>originalSourceText</code>: The original text in the base language. Used as a fallback.",
  "li_localizedtext_key_override": "<strong>Manual Key Override:</strong> You can click the 'Edit' icon next to the key to manually enter a key. Use 'X' to revert to automatic generation. This works for <code>LocalizedText</code>, <code>LocalizedDropdown</code> (for each option individually), and <code>UITKLocalization</code>.",
  "li_localizedtext_search_key": "<strong>Search in Table:</strong> Click the magnifying glass icon to instantly open the Translation Table and focus on that specific key.",
  "li_migration_csv_details_1": "<strong>Smart Filtering:</strong> The importer automatically skips rows that look like asset paths (e.g. <code>.png</code>, <code>.mp3</code>, <code>Assets/...</code>) to keep your text database clean.",
  "li_migration_csv_details_2": "<strong>'Type' Column:</strong> If a 'Type' column exists (I2 format), only rows marked as 'Text' or with empty type are imported. To import assets, use the Migration Profiles to map them to <code>LocalizedAsset</code>.",
  "li_migration_csv_req_1": "<strong>Key Column:</strong> Must be named <code>Key</code> (case-insensitive) or defined in your Migration Profile.",
  "li_migration_csv_req_2": "<strong>Language Columns:</strong> Any column not marked as ignored is treated as a language code (e.g., 'en', 'ja', 'English'). The tool attempts to fuzzy-match these to your project's languages.",
  "li_migration_csv_req_3": "<strong>Comments:</strong> Columns named <code>Desc</code>, <code>Description</code>, or <code>Comment</code> are imported as developer notes. This list is configurable in the <strong>Migration Profile</strong>.",
  "li_migration_custom_1": "Right-click in Project View -> Create -> Anko Localization -> Migration Profile.",
  "li_migration_custom_2": "<strong>Rules:</strong> Define conversion rules (if [Source Component] with [Context Filter], then convert to [Target Component]). Rules support <strong>Priority</strong> (higher numbers processed first), <strong>Harvest Assets</strong> (automatically extract and register referenced assets like Sprites or Audio), and <strong>Context Filtering</strong> to distinguish between multiple components on the same object.",
  "li_migration_fallback_keys": "<strong>Fallback Key Fields:</strong> Specify additional field names to check when extracting keys from legacy components. Useful if your old system uses non-standard property names for keys.",
  "li_migration_gs_1": "<strong>Access:</strong> The sheet must be shared ('Anyone with the link can view') or Published to the Web.",
  "li_migration_gs_2": "<strong>Sheet Tabs (GID):</strong> The URL must include the <code>gid=...</code> parameter. This tells the tool exactly which tab to read (e.g. <code>gid=0</code> is usually the first tab/sheet).",
  "li_migration_ignored_headers": "<strong>Ignored CSV Headers:</strong> Define columns that should be skipped during import (e.g., 'Type', 'Description'). This prevents the tool from treating metadata columns as language data.",
  "li_migration_legacy_components": "<strong>Additional Legacy Components:</strong> Manually list component names that the tool should detect as 'legacy' during the migration scan, even if no direct conversion rule is defined.",
  "li_migration_profile_details": "<strong>Advanced Profile Settings:</strong><ul><li><code>CsvKeyHeader</code>: The header name for the Key column.</li><li><code>CsvCommentHeaders</code>: List of headers to treat as developer notes/comments.</li><li><code>IgnoredCsvHeaders</code>: Columns to skip (metadata like 'Type' or 'Status') to avoid them being treated as languages.</li><li><code>AssetExtensions</code>: File types recognized as assets during scanning.</li><li><code>FallbackKeyFields</code>: Additional field names to check if the primary key field is empty.</li></ul>",
  "li_migration_rule_fields": "<strong>Rule Configuration:</strong><ul><li><code>Priority</code>: Higher values are processed first. Use this to handle specific cases before generic ones.</li><li><code>Context Filter</code>: Only apply rule if a specific component (e.g., <code>Text</code>) is present on the same object.</li><li><code>Harvest Assets</code>: If enabled, extracts the current asset (e.g., Sprite) from the legacy component and registers it in the asset table.</li><li><code>Asset Field Path</code>: Path to the field containing the asset reference for harvesting.</li><li><code>Additional Data Path</code>: Used for complex components like Dropdowns to harvest multiple values/options.</li></ul>",
  "li_migration_stubs_1": "<strong>Problem:</strong> You delete the old plugin assets. Unity detects missing scripts (e.g. <code>Localize</code> component missing). The editor enters compilation error mode.",
  "li_migration_stubs_2": "<strong>Solution:</strong> The 'Emergency Stubs' feature generates lightweight, empty classes with the exact same names and namespaces as the old plugin. This satisfies the compiler.",
  "li_migration_stubs_3": "<strong>Workflow:</strong> 1. Click <strong>Enable Emergency Stubs</strong> (this adds <code>ANKO_ENABLE_MIGRATION_STUBS</code> to your Project Settings). 2. Delete the old plugin folder. 3. Unity recompiles successfully using fake classes. 4. Run the <strong>Component Converter</strong> to replace stubs with official components. 5. Click <strong>Disable Stubs</strong> once refactoring is complete.",
  "li_migration_tool_converter": "<strong>Step 2: Component Converter:</strong> Scan scenes and prefabs. Automatically replaces old components (e.g., <code>Localize</code>) with <code>LocalizedText</code> / <code>LocalizedAsset</code>, transferring keys.",
  "li_migration_tool_fields": "<strong>Profile Settings:</strong> Configurable 'Source Plugin' type and 'Asset Mapping' rules ensure correct transfer of textures and audio.",
  "li_migration_tool_import": "<strong>Step 1: Data Import:</strong> Import CSV (I2) or XLIFF (Unity Loc) files to create a key database.",
  "li_migration_tool_profiles": "<strong>Migration Profiles:</strong> Create custom profiles to map assets and settings from 3rd party plugins (I2, Unity Loc).",
  "li_migration_tool_safemode": "<strong>Safe Mode & Emergency Stubs:</strong> Components are disabled rather than deleted. Includes the critical <strong>Emergency Stubs</strong> feature (activated via the <code>ANKO_ENABLE_MIGRATION_STUBS</code> define symbol): generates fake placeholder classes for I2 Localization or Unity Localization so your project can compile immediately after removing those plugins. This prevents \"The type name 'Localize' could not be found\" errors and gives you time to properly refactor your code to use the new system. Enable Stubs allows you to fix compilation errors after deleting the old localization plugin.",
  "li_migration_tool_setup": "<strong>Step 0: Setup:</strong> Configure component names (e.g., <code>Localize</code> for I2) and fields where the key is stored. Presets are available.",
  "li_migration_workflow_1": "<strong>1. Backup:</strong> Commit your project into source control (Git) or make a file backup before starting.",
  "li_migration_workflow_2": "<strong>2. Enable Stubs:</strong> Open Migration Tool -> 'Safe Mode' tab. Click <strong>Enable Emergency Stubs</strong> for your target system (I2/UnityLoc). This creates lightweight fake classes in your project.",
  "li_migration_workflow_3": "<strong>3. Remove Old Plugin:</strong> Delete the old plugin folder (e.g., 'Assets/Plugins/I2'). Unity will recompile. Thanks to Stubs, you will <strong>NOT</strong> get 'Type not found' errors, preserving all your component references on prefabs.",
  "li_migration_workflow_4": "<strong>4. Import Data:</strong> In 'Import Data' tab, load your Source CSV/XLIFF. Verify the preview and click <strong>Import</strong>. This populates the AnKo translation tables.",
  "li_migration_workflow_5": "<strong>5. Convert Components:</strong> In 'Component Converter' tab, select 'Entire Project' and click <strong>Scan & Convert</strong>. The tool replaces old stubs with 'LocalizedText'/'LocalizedAsset' components, transferring the keys.",
  "li_migration_workflow_6": "<strong>6. Cleanup:</strong> Once everything is working, click <strong>Disable Stubs</strong> and let Unity recompile again.",
  "li_notes_1": "<strong>Backups:</strong> Always create a backup via <strong>Translation Table Editor -> Manage Backups</strong> before major changes. Backups are stored in the <code>LocalizationBackups</code> folder <strong>at the project root (outside the Assets folder)</strong> to keep your Unity project clean and reduce import times.",
  "li_notes_2": "<strong>API Key Security:</strong> The key for working in the editor is stored locally on your machine (in <code>EditorPrefs</code>) and does not get into the repository. For keys needed in the game build, use the <strong>Runtime API Key</strong> section.",
  "li_notes_3": "<strong><code>StreamingAssets</code> Folder:</strong> Translation files must be in a subfolder of <code>Assets/StreamingAssets/</code> to be included in the game build.",
  "li_notes_4": "<strong>\"Fool-proofing\":</strong> The tool automatically protects you from accidentally saving temporary data from preview mode into a scene or prefab.",
  "li_notes_5": "<strong>Performance:</strong> The <code>_()</code> call is fast, but in loops that run every frame (e.g., in <code>Update</code>), try to cache the result in a variable.",
  "li_notes_6": "<strong>Excluding <code>LanguageSelector</code> from parsing:</strong> The object with the <code>LanguageSelector</code> component and its <code>TMP_Dropdown</code> must be added to the <strong>Ignore Specific Objects</strong> list in the <strong>Content</strong> tab. This is necessary to prevent the parser from creating extra keys for the dropdown options, as the <code>LanguageSelector</code> script populates them dynamically at runtime. Ignoring prevents conflicts and keeps the translation files clean.",
  "li_notes_7": "<strong>Fonts for <code>LanguageSelector</code>:</strong> For the selected language in the <code>TMP_Dropdown</code> to correctly update its font, manually add an empty <code>LocalizedText</code> component to the child <strong>Label</strong> object of the Dropdown and check the <code>isStyleOnly</code> box.",
  "li_notes_addressables_code": "<strong>Code & Addressables:</strong> If you switch to <strong>Addressables (Async)</strong> mode, you MUST use <code>GetLocalizedAssetAsync<T>()</code> in your scripts. Calling the synchronous <code>GetLocalizedAsset<T>()</code> will return null and log a warning to prevent main thread freezes.",
  "li_notes_addressables_sync_warning": "<strong>Sync vs Async:</strong> If you switch to <strong>Addressables (Async)</strong> mode, you MUST update your code to use <code>GetLocalizedAssetAsync<T>()</code>. Calling the synchronous method will return null and log a warning to avoid freezing the main thread.",
  "li_preview_1": "<strong>How it works:</strong> Select a language from the list, and the tool will instantly apply the corresponding translations, fonts, RTL settings, and assets to all localizable objects in the active scene or opened prefab.",
  "li_preview_2": "<strong>Placeholders:</strong> If a placeholder style (e.g., <strong>Accents</strong> or <strong>Brackets</strong>) is selected in the <strong>Settings</strong> tab, these placeholders will be displayed in preview mode instead of actual translations. This is ideal for testing layout and finding unlocalized elements.",
  "li_preview_3": "<strong>Safety:</strong> All changes made in preview mode are temporary. The tool will automatically revert everything to its original state when you select \"<strong>Revert to Original</strong>\", close the window, change scenes, or before saving a scene/prefab (thanks to the <code>LocalizationPreviewProtector</code> component).",
  "li_preview_4": "<strong>Crash Protection:</strong> The system automatically backs up the scene state to the <code>Library</code> folder before previewing. If Unity crashes or you force-quit while previewing, the tool detects the recovery file on next launch and offers to restore the original scene state.",
  "li_preview_overlay_1": "<strong>Access:</strong> The overlay appears automatically in the Scene View. You can toggle it via the Unity Overlay menu (<code>Space</code> key in Scene View).",
  "li_preview_overlay_2": "<strong>Functionality:</strong> Provides a dropdown to quickly switch the current Preview Language without opening the main window.",
  "li_report_1": "<strong>Categories:</strong> All Keys, Added, Updated (text changed), Removed, Duplicates, Migrated, Skipped (unchanged).",
  "li_report_2": "<strong>Advanced Find:</strong> Click the <strong>Find</strong> button next to any entry to instantly find the corresponding object in the project. The search works asynchronously, not blocking the editor, and searches across all scenes and prefabs.",
  "li_report_all_keys": "<strong>All Keys:</strong> A list of all localization keys detected in the project with search and filtering options.",
  "li_report_btn_clear": "<strong>Clear Report:</strong> Removes all scan results from the current session's memory.",
  "li_report_btn_copy_all": "<strong>Copy All Keys:</strong> Copies all localization keys in the current category to the system clipboard.",
  "li_report_btn_load_last": "<strong>Load Last Scan:</strong> Instantly restores the results of the most recent project analysis without re-scanning.",
  "li_report_btn_save": "<strong>Save Report:</strong> Exports the current scan results to a text or CSV file for external documentation or auditing.",
  "li_report_source_filter": "<strong>Source Filter:</strong> Narrow down results by their origin (e.g., only show keys found in Scripts, Scenes, or Prefabs).",
  "li_safety_global_limit": "<strong>Global Monthly Limit:</strong> The <code>monthlyCharLimit</code> (default: 500,000 chars) acts as a circuit breaker for all requests. You can toggle warnings via <code>enableApiLimitWarning</code>.",
  "li_safety_profile_limit": "<strong>Profile Limits:</strong> Each Translation Profile allows setting its own 'Max Chars Per Request' and 'Batch Size'.",
  "li_settings_1": "<strong>Key Generation Mode:</strong> Defines the strategy for creating unique identifiers for your text:<ul><li><code>AutoGenerateKeysOnly</code> <strong>(Default - Recommended)</strong>: Generates keys based on scene/prefab name and object hierarchy (e.g., <code>scene_Menu_BtnPlay_682412</code>). Best for large projects as it guarantees uniqueness and is immune to text changes.</li><li><code>UseTextAsKey</code>: Uses the source text itself as the key (e.g., \"Start Game\" → <code>Start Game</code>). Ideal for rapid prototyping where keys should be human-readable.</li><li><code>AutoGenerateWithCustomKeys</code> <strong>(Hybrid)</strong>: The most flexible mode. It first checks if a component already has a manually assigned key or a <code>[LocalizableField(key=\"...\")]</code>. If no key exists, it generates a hierarchical one. <em>Use this to preserve existing work while automating new content.</em></li><li><code>UseTextAsKeyWithCustomPriority</code> <strong>(Hybrid)</strong>: Like the above, but falls back to the text itself if no manual key is found. Respects existing components and data.</li><li><code>Manual</code>: The scanner never creates new keys. It only updates objects that already have a localization component with a key. Perfect for strict manual control.</li></ul>",
  "li_settings_10": "<strong>Dev Tools:</strong> At the bottom of the Settings tab, you can find utility buttons like <strong>Clear Saved Language Pref</strong> (resets the saved language in PlayerPrefs so the game starts with the Default language again).",
  "li_settings_11": "<strong>Technical Dropdown Options:</strong> A list of string values (defaults: 'Option A', 'Option B', 'Option C') that the parser will <strong>ignore</strong> when scanning Dropdowns. This keeps your translation table clean from Unity's default UI placeholder text.",
  "li_settings_2": "<strong>Language Management:</strong><ul><li><strong>Source Language:</strong> The language used in your Unity scenes/prefabs (development language).</li><li><strong>Default Language:</strong> The language selected on the first game launch if the user's system language is not supported.</li><li><strong>List:</strong> Manage supported languages, assign specific <strong>Font Assets</strong>, and enable <strong>RTL</strong> support.</li></ul>",
  "li_settings_3": "<strong>General Settings:</strong> Configuration for project-wide behavior:<ul><li><code>Translations Save Path</code>: The root directory for storing <code>.json</code> translation files. For in-game access, this must be inside <code>Assets/Resources</code> or <code>Assets/StreamingAssets</code>.</li><li><code>Safe Mode</code>: A protection layer that blocks operations (like Auto-Translate) if project inconsistencies or missing dependencies are detected.</li><li><code>Remove Missing Keys</code>: If enabled, the scanner will automatically delete entries from the database that are no longer present in any scene or prefab during project update.</li><li><code>Parse Inactive Objects</code>: Determines whether the tool should scan and localize disabled or hidden GameObjects.</li><li><code>Parse All Prefabs</code>: Scans every prefab in the project. If disabled, only prefabs in folders specified in the <strong>Content</strong> tab are processed.</li><li><code>Fill Comments By Paths</code>: Automatically populates the 'Comment' field in the translation table with the object's scene/prefab hierarchy path.</li><li><code>Split Files by Language</code>: Divides the translation database into multiple files (e.g., <code>en.json</code>, <code>ja.json</code>). Highly recommended for large projects to reduce runtime memory overhead.</li><li><code>Allow Empty Source/Keys</code>: Allows the tool to register and track objects even if their source text is empty. Useful for dynamic text that is set exclusively via code.</li><li><code>Attach to Regex-Ignored Text</code>: Compels the tool to add localization components to objects whose text matches an exclusion regex (like numbers), allowing for manual override.</li><li><code>Find Settings Asset</code>: A utility button that instantly pings and selects the <code>LocalizationSettings.asset</code> file in your Project window.</li></ul>",
  "li_settings_4": "<strong>Debugging & Testing:</strong><ul><li><code>Placeholder Style</code>: Choose the style for displaying placeholders in preview mode.</li><li><code>Pseudo-Localization</code>: Select <strong>'Custom Pseudo'</strong> to reveal advanced layout testing settings (Expansion Factor, Accents, and Delimiters).</li></ul>",
  "li_settings_5": "<strong>Live Updates:</strong> Settings for loading translations from a remote server.",
  "li_settings_6": "<strong>Runtime API Key:</strong> Securely stores your API key for <strong>Live Updates</strong> (fetching new translations in-game). This is different from the Translation Service keys used in the Editor. The key is <strong>obfuscated</strong> (encrypted) in the build to prevent easy extraction via string search, but remember: no client-side secret is 100% secure.",
  "li_settings_7": "<strong>Asset Loading Strategy:</strong> Choice between <code>Resources (Legacy)</code>, <code>Addressables (Async)</code>, and <code>Custom</code>. Warning: Changing this mode requires a project re-scan. Addressables mode is highly recommended for mobile and WebGL to reduce memory usage.",
  "li_settings_8": "<strong>Auto-Translation:</strong> Uses the <strong>Translation Profiles</strong> system for AI-driven localization. Configuration includes:<ul><li><code>Text & Audio Profiles</code>: Select or create ScriptableObject profiles to configure different services (e.g., OpenAI, DeepL, Google).</li><li><code>Presets Folder</code>: The directory where your translation presets and profiles are stored.</li><li><code>Target Languages</code>: A list of all project languages with real-time status, progress bars, and character counts for the selected profile.</li><li><code>Start Auto Translation</code>: Begins the process for all selected languages using the specified profiles.</li></ul>",
  "li_settings_9": "<strong>Debugging Enhancements:</strong><ul><li><code>Show Hierarchy Icons</code>: Displays status icons (Green Tick / Yellow Warning) in the hierarchy. <strong>Performance Optimized:</strong> Uses caching to ensure zero lag even in large scenes.</li><li><code>Show Scene View Labels</code>: Visual debugging directly in the Scene View. Labels are interactive: Right-click on any scene label to instantly copy the localization key to the clipboard.</li></ul>",
  "li_settings_asset_folder_rule": "<strong>Folder Structure Rule:</strong> Defines how subfolders are structured when generating localized assets (e.g., <code>{lang}/{category}</code>).",
  "li_settings_bridge_name": "<strong>Bridge Class Name:</strong> Allows you to customize the name of the generated static class (default is <code>AnkoLoc</code>).",
  "li_settings_general_safe_mode": "<strong>Safe Mode:</strong> Ensures that critical operations won't proceed if they might cause inconsistent project states.",
  "li_settings_icons_legend": "<strong>Hierarchy Icons Legend:</strong><br>🟢 (Green Tick): Localized & Key set.<br>🔴 (Red Error): Localized component present, but <strong>Key is missing</strong>.<br>🟡 (Yellow Warn): Text/Image component found, but <strong>no Localization component</strong> attached.<br>🐛 (Bug): Object is <strong>Ignored</strong> by settings.",
  "li_settings_lang_culture_fallback": "<strong>Use Culture Fallback:</strong> If a specific regional dialect (e.g., <code>en-AU</code>) is missing, the tool will attempt to use the base language (<code>en</code>) before falling back to the <strong>Default Language</strong>.",
  "li_settings_lang_follow_system": "<strong>Follow System Language:</strong> Automatically switches the game language to match the player's OS language on the first launch.",
  "li_settings_live_updates_security": "<strong>Security:</strong> runtime API keys are encrypted (AES) in the build to prevent casual extraction. Always use HTTPS.",
  "li_settings_pseudo_accents": "<strong>Use Accents:</strong> Replaces standard characters with accented versions (e.g., <code>å</code>, <code>é</code>). Use this to ensure your fonts support all required glyphs.",
  "li_settings_pseudo_brackets": "<strong>Add Brackets:</strong> Wraps text in <code>[ ]</code> to verify the start and end of localized strings, helping identify text truncation or concatenation issues.",
  "li_settings_pseudo_expand_length": "<strong>Expand Length:</strong> Simulates text expansion common in languages like German or Russian by appending trailing characters.",
  "li_settings_pseudo_expansion_factor": "<strong>Expansion Factor:</strong> Multiplier for text length simulation (e.g., 2.0 will make the text twice as long).",
  "li_settings_pseudo_prefix": "<strong>Custom Prefix:</strong> Add a specific string (like <code>PSEUDO-</code>) to the beginning of every localized text.",
  "li_settings_pseudo_suffix": "<strong>Custom Suffix:</strong> Add a specific string to the end of every localized text.",
  "li_settings_return_source": "<strong>Return Source if Missing:</strong> If enabled, the system will return the text in the source language (or the key itself) if no translation is found for the current language.",
  "li_settings_tms_timeout": "<strong>TMS Timeout:</strong> Specifies the maximum wait time (in seconds) for network requests to external TMS services.",
  "li_settings_tool_check_deps": "<strong>Check Dependencies:</strong> Re-scans the project for required packages (like Newtonsoft) and optional integrations.",
  "li_settings_tool_cleanup": "<strong>Full Project Cleanup:</strong> A destructive tool that removes all Anko Localization components and data from the project (use with caution!).",
  "li_settings_tool_clear_prefs": "<strong>Clear Language Prefs:</strong> Resets the saved language in PlayerPrefs, forcing the game to use the default or system language on next launch.",
  "li_settings_tool_font_manager": "<strong>Font Manager:</strong> Opens the Font & Glyph Manager to analyze missing characters and generate optimized font assets.",
  "li_settings_tool_migration": "<strong>Migration Tool:</strong> Facilitates moving data and components from I2 Localization or Unity Localization.",
  "li_settings_tool_test_center": "<strong>Localization Test Center:</strong> A diagnostic tool for verifying project health, checking for broken references, and ensuring localization integrity.",
  "li_setup_1": "<strong>Create Settings:</strong> On first open, the tool will create a <code>LocalizationSettings.asset</code> file in the <code>Assets/Resources</code> folder.",
  "li_setup_2": "<strong>Configure Languages & Mode:</strong> In the <strong>Settings</strong> tab, ensure your <strong>Source Language</strong> is correct. Also, verify the <strong>Key Generation Mode</strong> (the default is <code>AutoGenerateKeysOnly</code>, which is recommended for most projects).",
  "li_setup_3": "<strong>Specify Content for Parsing:</strong> In the <strong>Content</strong> tab, add all scenes for analysis to the <strong>Scenes to Parse</strong> list. If you use prefabs with text, make sure their folders are added to <strong>Prefab Folders</strong>.",
  "li_setup_4": "<strong>First Parser Run:</strong> Go to the <strong>Actions</strong> tab and click the <code>Update Keys</code> button. The tool will scan your project, create translation files, and automatically add the necessary components (<code>LocalizedText</code>, <code>LocalizedAsset</code>, etc.) to game objects.",
  "li_setup_5": "<strong>Settings & Builds (CRITICAL):</strong> The tool automatically adds <code>LocalizationSettings.asset</code> to <code>Project Settings -> Player -> Preloaded Assets</code>. <br>⚠️ <strong>Safety Check:</strong> If the settings are missing from Preloaded Assets and not in a Resources folder, the tool will <strong>block the build</strong> with a <code>BuildFailedException</code> to prevent the game from crashing on start.",
  "li_sidebar_presets": "<strong>Search Presets:</strong> Predefined filters for common tasks like finding untranslated strings or keys with missing placeholders.",
  "li_sidebar_search": "<strong>Global Search:</strong> Search for specific keys or text across all tables in your project.",
  "li_tms_crowdin": "<strong>Crowdin:</strong> Requires Project ID and API Key. Supports uploading source XLIFF and downloading translations as a ZIP archive. <em>Advanced:</em> <code>File Name</code> (the target path in Crowdin).",
  "li_tms_loco": "<strong>Loco (localise.biz):</strong> Requires API Key. Simple and fast integration for smaller projects. <em>Advanced:</em> <code>Import/Export Params</code> (allows adding extra Loco API flags like <code>&tag=v1</code> or <code>&status=translated</code>).",
  "li_tms_phrase": "<strong>Phrase:</strong> Enterprise-grade localization management. <em>Advanced:</em> <code>Update Translations/Descriptions</code> flags to control whether Phrase overwrites existing data on upload.",
  "li_tms_transifex": "<strong>Transifex (v3):</strong> Supports organization/project slugs and API Token authentication. <em>Advanced:</em> <code>Resource Slug</code> (automatically creates the resource if it doesn't exist).",
  "li_tutorials_1": "<strong>Interactive Learning:</strong> Guides highlight specific UI elements and wait for your actions.",
  "li_tutorials_2": "<strong>Available Lessons:</strong>",
  "li_tutorials_editor": "<strong>Translation Editor:</strong> Advanced features of the spreadsheet-like editor.",
  "li_tutorials_list": "<strong>Tutorial List:</strong> Access interactive guides for the main features of the tool.",
  "li_tutorials_migration": "<strong>Migration:</strong> How to move from other localization systems (I2, Unity Localization).",
  "li_tutorials_quickstart": "<strong>Quick Start:</strong> Basic setup for text and assets.",
  "li_tutorials_size": "<strong>Tutorial Size:</strong> Adjusts the UI scale and verbosity of the interactive guides (Compact to Extra Large). Located in the header of the Tutorials tab.",
  "li_vis_debug_1": "<strong>Hierarchy Icons:</strong> Instantly spot issues (Missing Key, Missing Component). Optimized to have zero performance impact.",
  "li_vis_debug_2": "<strong>Scene View Labels:</strong> Displays the key over every localized object. <strong>Right-click</strong> a label to 'Copy Key' or 'Select Object'.",
  "li_vis_debug_3": "<strong>Overlays:</strong> Use the scene view overlay (Space bar) to switch preview languages instantly.",
  "lightbox_aria_close": "Close image viewer",
  "lightbox_image_alt": "Enlarged view",
  "mindmap_edge_configure": "1. Configure",
  "mindmap_edge_creates_components": "Creates Components",
  "mindmap_edge_defines_rules": "Defines rules for",
  "mindmap_edge_edited_in": "Edited in",
  "mindmap_edge_enables_reaction": "Enables reaction via",
  "mindmap_edge_extends": "Extends",
  "mindmap_edge_generates": "Generates",
  "mindmap_edge_manages_assets": "Manages assets for",
  "mindmap_edge_opens": "Opens",
  "mindmap_edge_parse_project": "3. Parse Project",
  "mindmap_edge_processed_by": "Processed by",
  "mindmap_edge_recommends_for": "Recommends for",
  "mindmap_edge_relates_to": "Relates to",
  "mindmap_edge_reports_on": "Reports on",
  "mindmap_edge_see_faq": "See FAQ",
  "mindmap_edge_specify_content": "2. Specify Content",
  "mindmap_edge_warns_about": "Warns about",
  "mindmap_node_ai_ecosystem": "AI Ecosystem",
  "mindmap_node_async_code": "Async / Addressables",
  "mindmap_node_dev_tools": "Tools & Utilities",
  "mindmap_node_tms_integration": "TMS Integration",
  "mindmap_preset_ai": "AI & Automation",
  "mindmap_preset_dev": "Developer Workflow",
  "mindmap_preset_full": "Full View",
  "mindmap_preset_quick_start": "Quick Start",
  "mindmap_preset_tools": "Tools & Integrations",
  "mindmap_preset_translator": "Translator Workflow",
  "mindmap_toggle_title": "Show Mind Map",
  "my_notes_title": "My Notes",
  "no_notes_message_new": "Hover over the text to add a note.",
  "notes_add_title": "Add a note to this block",
  "notes_close_title": "Close",
  "notes_delete_title": "Delete note",
  "notes_edit_text": "Edit",
  "notes_edit_title": "Edit note",
  "notes_goto_title": "Go to text",
  "notes_placeholder": "Your note...",
  "on_this_page_title": "On This Page",
  "p_actions_1": "The main work tab.",
  "p_ai_assistant": "In the Translation Table Editor, you can now run custom AI commands on selected cells via the context menu (Right-Click -> AI: ...).",
  "p_ai_audio_economy": "<strong>Cost Saving:</strong> The tool calculates an MD5 hash of your text and only regenerates audio files if the source text has changed, saving your API credits. If you change a translation, the system flags only that specific audio file as 'Outdated'. Use 'Generate Missing/Outdated' to regenerate only what changed, saving API credits. The tool hashes your text and only regenerates audio files if the source text has changed, saving your API credits through smart batching.",
  "p_ai_context": "To improve translation quality, the AI now receives additional context:",
  "p_ai_intro": "The tool uses a <strong>Translation Profile</strong> system (ScriptableObject). This keeps translation service settings in individual profile assets, allowing you to switch configurations easily.",
  "p_api_snippets_intro": "The <code>LocalizationManager.cs</code> provides a robust API for runtime localization management. Below are the key methods you'll use in your scripts.",
  "p_assets_1": "This tab is entirely dedicated to localizing non-text resources.",
  "p_async_api": "When using Addressables, assets are not loaded instantly. You must use the asynchronous API to prevent frame drops.",
  "p_bridge_description": "The tool includes a static class generator for key access, allowing you to use strongly typed references instead of magic strings. This helps prevent typos and enables IDE autocompletion.",
  "p_bridge_usage_title": "Usage Example:",
  "p_components_intro": "These components are the \"bridge\" between your objects in the scene and the translation database. They \"listen\" for language changes and automatically substitute the correct text or asset.",
  "p_content_1": "Here you tell the tool where exactly to look for text. The interface has been completely redesigned for better usability.",
  "p_custom_ai": "The <strong>Custom AI</strong> service type allows you to connect any LLM via REST API.",
  "p_custom_asset_provider_1": "Developing a custom provider allows you to integrate your own asset management system (e.g., a custom cloud loader, a specific internal bundling system, or a database-driven asset repository) directly into the localization workflow.",
  "p_custom_asset_provider_intro": "The Asset Provider system abstracts how assets (Sprites, Audio, Prefabs, etc.) are loaded at runtime. It uses a <strong>Plugin Registry</strong> that automatically discovers any class implementation of <code>IAssetProvider</code> marked with the <code>[AssetProviderPlugin]</code> attribute. This allows for seamless integration of custom loading systems (like cloud loaders or internal bundling) without modifying the core toolkit.",
  "p_custom_attributes_description": "In addition to function calls, you can mark any string field in your scripts as localizable using custom attributes. By default, the tool recognizes <code>[LocalizableField]</code>, but you can add any attribute name (like <code>[Header]</code> or <code>[Tooltip]</code>) to the <strong>Attributes to Scan</strong> list.",
  "p_custom_parser_1": "You can easily extend the system to support custom components by creating your own parser class.",
  "p_editor_1": "Opens via <strong>Tools -> Localization -> Translation Table Editor</strong>. This is the main tool for manually editing translations.",
  "p_example_attribute_1": "The most powerful way to localize script variables. It works with <strong>private, protected, and public</strong> fields. The parser recursively handles <strong>Arrays, Lists</strong>, and <strong>Nested Serializable Classes</strong>. It can even generate keys for other attributes (like <code>[Header]</code> or <code>[Tooltip]</code>) if configured in Settings.",
  "p_example_components_1": "The project includes ready-to-use scripts that serve as excellent examples.",
  "p_example_components_updated": "The code has changed. The language loading (especially when using Addressables) is now asynchronous.",
  "p_example_function_1": "Use the <code>_()</code> function for dynamic text that changes during gameplay. The method that updates the UI should be marked with the <code>[OnLanguageChange]</code> attribute so that it is called automatically when the language is changed. A <code>LocalizedBehaviour</code> component will be automatically added to the object for this purpose.",
  "p_example_plurals_1": "The tool now uses more accurate rules for different language groups.",
  "p_font_glyph_manager_access": "Access via <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "p_intro_1": "This tool is a comprehensive solution for localizing games and applications in Unity. It automates the process of collecting text and assets, managing translations through a powerful interface, integrating with machine translation services (including Custom AI), and dynamically updating localized content in the game.",
  "p_live_updates_guide": "The Live Updates system allows your game to fetch new translations from a remote server or Google Sheet at runtime, without requiring a new build.",
  "p_localizedasset_1": "Used to swap assets based on language. Automatically detects the component type. Supports: <ul><li><strong>2D:</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Textures (<code>RawImage</code>).</li><li><strong>Audio/Video:</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animation:</strong> <code>MeshFilter</code> (Meshes), <code>Renderer</code> (Materials), <code>Animator</code> (Controller), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "For components with the <strong>Play on Awake</strong> option (like <code>AudioSource</code>, <code>VideoPlayer</code>), <code>LocalizedAsset</code> correctly intercepts the auto-play, swaps the asset, and then starts playback to avoid playing unlocalized content.",
  "p_localizedasset_updated": "The component now supports asynchronous loading. Note that there may be a slight delay when changing languages if assets are loaded from cloud/disk (Addressables).",
  "p_localizedbehaviour_1": "A utility component that allows your scripts to react to language changes. It automatically finds and calls methods marked with the <code>[OnLanguageChange]</code> attribute.",
  "p_localizeddropdown_1": "Added to <code>Dropdown</code> and <code>TMP_Dropdown</code> to translate their options.",
  "p_localizedprefab_1": "A component for localizing entire prefabs. It works non-destructively: it does not modify the original prefab but creates an instance of the localized version as a child object, disabling all scripts (<code>MonoBehaviour</code>), renderers (<code>Renderer</code>), and colliders (<code>Collider</code>) on the original object. This prevents dual logic execution and visual artifacts. For correct runtime operation, its execution order is set to -100 (<code>[DefaultExecutionOrder(-100)]</code>) to ensure it runs before other scripts.",
  "p_localizedtext_1": "The main component for displaying translated text. It is placed on objects with <code>Text</code>, <code>TMP_Text</code>, and <code>TextMesh</code>.",
  "p_migration_custom": "You can create your own migration profiles to support custom systems or specific project setups. Each profile contains a list of <strong>Rules</strong> that define how components and their fields should be converted. Rules are checked in order of their <strong>Priority</strong>.",
  "p_migration_custom_advanced": "Migration Profiles offer advanced settings for fine-tuning the import and detection process:",
  "p_migration_google_sheet": "You can import directly from a Google Sheet URL without downloading files.",
  "p_migration_import_csv": "The tool supports standard CSV files (comma-separated). The first row must be the header.",
  "p_migration_stubs": "A common issue when migrating is that deleting the old plugin (e.g. I2) breaks the build, preventing Unity from compiling the Migration Tool itself.",
  "p_migration_tool_access": "Access via <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "p_migration_tool_desc": "Tool for transitioning from other localization systems (I2 Localization, Unity Localization).",
  "p_preview_1": "Directly below the header is the <strong>Preview Language</strong> dropdown list. This powerful feature allows you to see how the localization will look in any language directly in the <strong>Scene</strong> window or <strong>Prefab Mode</strong>, without running the game.",
  "p_preview_overlay": "For even faster iteration, you can switch languages directly from the Scene View using the dedicated <strong>Localization Preview Overlay</strong>.",
  "p_report_1": "After each parsing, this report shows the full picture of your localization status.",
  "p_safety_caps": "To prevent accidental high costs or large traffic checks:",
  "p_script_parsing_rules_description": "The tool can be configured to recognize localization keys used in custom functions or even competitor systems (like I2 Localization) without modifying your existing code. This is achieved by defining regex patterns that the scanner uses to extract keys from your scripts.",
  "p_script_parsing_rules_usage": "In the <strong>Content</strong> tab, under <strong>Script Parsing Rules</strong>, you can add rules that match your specific function calls. For example, to support <code>I2.Loc.Get(\"key\")</code>, you can add a rule with a pattern that captures the string inside the parentheses.",
  "p_settings_1": "Your control center. Here you define global rules for the entire localization process.",
  "p_tms_intro": "The tool now supports synchronization with popular Translation Management Systems. You can push source keys and pull translations directly within Unity.",
  "p_tms_setup": "1. Go to <strong>Settings -> TMS Integration</strong>.<br>2. Select your service provider.<br>3. Enter the API Keys and Project IDs.<br>4. Use the <strong>Push</strong> (Upload Keys) and <strong>Pull</strong> (Download Translations) buttons in the Settings window.",
  "p_tutorials_1": "The Tutorials tab provides interactive step-by-step guides to help you master the tool's features directly within the Unity Editor.",
  "p_uitklocalization_1": "Added to objects with a <code>UIDocument</code>. Supports localization of <strong>Labels, Buttons, HelpBox, Foldout, ProgressBar (title), TextField (label & placeholder), DropdownField (label & choices), RadioButton, RadioButtonGroup, ToggleButtonGroup (Unity 2023+), and Tooltips</strong> on any element. Identifiers are stable across renames if IDs are set in UI Builder.",
  "p_window_footer": "Displays the current status, progress of background operations, and the tool version.",
  "p_window_header": "The top bar provides global access to preview controls and utility tools that persist regardless of the selected tab.",
  "p_window_sidebar": "The sidebar handles navigation between different functional tabs and global search tools.",
  "page_title": "Unity Localization Tool Documentation",
  "q_faq_addressables_1": "I enabled Addressables mode, but assets are not loading. What should I check?",
  "q_faq_addressables_2": "How do I add support for DeepL/Google?",
  "q_faq_addressables_3": "The migrator shows compilation errors after removing I2/UnityLoc. How can I fix this?",
  "q_faq_audio_smart_update": "How does the tool save API credits when regenerating audio files?",
  "q_faq_components_1": "The LocalizedPrefab component disables MonoBehaviours on the original object. What if the original object has a script that creates other objects or subscribes to events in Awake()?",
  "q_faq_components_2": "If the original prefab (LocalizedPrefab) has a Rigidbody or another physics component, will it be disabled? Will this affect physics if the localized prefab does not have it?",
  "q_faq_components_3": "The LocalizedAsset component stores the target component name as a string (_targetComponentTypeName). What happens if I rename a custom component script or move it to another assembly (Assembly Definition)? Will LocalizedAsset stop working for it?",
  "q_faq_components_4": "If there are two Image components on the same GameObject, how does LocalizedAsset know which one to localize? Will it work with both or only the first one it finds?",
  "q_faq_components_5": "The documentation states that LocalizedPrefab has an execution order of -100. What if I have another script with an execution order of -110 that tries to find a child object created by LocalizedPrefab in its Awake()? Will LocalizedPrefab have instantiated its instance in time?",
  "q_faq_components_6": "The LocalizedText component has an isStyleOnly option. If I enable it and then call myLocalizedText.SetFormattedText(\"new_key\") in code, will the text change, or only the style (font/RTL)?",
  "q_faq_components_7": "LocalizedBehaviour automatically finds methods with the [OnLanguageChange] attribute. Will it find private and protected methods, or must they be public?",
  "q_faq_components_8": "The LocalizedAsset component intercepts Play on Awake. What happens if another script on the same object tries to access the asset (e.g., audioSource.clip.length) in Awake() or Start() before LocalizedAsset has swapped it? Is a NullReferenceException or usage of the old asset possible?",
  "q_faq_custom_keys_attribute": "Can I use my own attribute for keys instead of [LocalizableField]？",
  "q_faq_custom_provider_1": "Why does my custom provider not appear in the Settings dropdown?",
  "q_faq_editor_1": "What has higher priority for placeholder validation: the @placeholders: directive in the comment or the placeholders found in the source language text? For example, if the source text has {name} and the comment says @placeholders: {username}.",
  "q_faq_editor_2": "If I make a typo in the directive (e.g., @placeholder: instead of @placeholders:), will it be ignored or will the tool issue a warning?",
  "q_faq_editor_3": "The autosave system creates files in the Backups/AutoSaves folder. Will these files be automatically deleted after a successful manual save or closing the window?",
  "q_faq_editor_4": "If I change the column widths in the editor, will these settings be saved between Unity sessions?",
  "q_faq_editor_5": "Does the text editing popup window (MultiLineEditWindow) support its own Undo/Redo stack (via Ctrl+Z) for changes made within it?",
  "q_faq_examples_1": "What happens if the property names in the anonymous type passed to the _() function do not match the placeholders in the string? For example, _(\"Hello, {username}\", new { user_name = \"Bob\" }). Will there be an error, or will the placeholder simply not be replaced?",
  "q_faq_examples_2": "The [LocalizableField] attribute works for private fields. Will it work for static fields?",
  "q_faq_examples_3": "If I put the [OnLanguageChange] attribute on a method with parameters (e.g., void UpdateUI(string newLang)), what will happen? Will there be a compile error or a runtime warning?",
  "q_faq_examples_4": "I am using _(\"apple_count\", count). If there is no key apple_count_one for the current language (for count = 1), which form will the system choose? Will it use apple_count_other as a fallback?",
  "q_faq_examples_5": "The function _(\"key\", new { username = \"Alex\" }) uses an anonymous type. Won't this create an excessive \"load\" on the garbage collector (GC) with frequent calls in an Update() method compared to passing a pre-created Dictionary<string, object>?",
  "q_faq_examples_6": "My method marked with [OnLanguageChange] is not being called. Why?",
  "q_faq_extending_1": "Will my custom parser be called automatically after every Update Keys? Do I need to register it somewhere, or is it enough to just have a class that implements ITextComponentParser in the project?",
  "q_faq_extending_2": "What if an exception occurs in my custom parser? Will it interrupt the entire parsing process, or will the tool safely continue with other parsers?",
  "q_faq_installation_1": "What happens if my project already has the com.unity.nuget.newtonsoft-json package from another asset? Will the dependency installer try to update or ignore it?",
  "q_faq_installation_2": "I accidentally clicked \"Skip for Now\" and checked \"Don't ask again\" for optional dependencies (e.g., for CSV support). How can I bring up the installer window again to install them?",
  "q_faq_installation_3": "The tool did not create LocalizationSettings.asset in Assets/Resources. Why might this have happened, and can I create it manually via the Assets -> Create menu?",
  "q_faq_installation_4": "Can I move the LocalizationSettings.asset file to another Resources folder, for example, Assets/MyGame/Resources? Will the tool still find it?",
  "q_faq_installation_5": "The dependency installer froze or gave an error. Can I install the dependencies (Newtonsoft Json, Editor Coroutines) manually through the Unity Package Manager?",
  "q_faq_notes_1": "The documentation recommends adding LanguageSelector to the ignore list. What exactly will break if I forget to do this? Will extra keys be created for \"Option A, Option B\"?",
  "q_faq_notes_2": "If I forget to add an empty LocalizedText with the isStyleOnly checkbox enabled on the Label inside the TMP_Dropdown used by LanguageSelector, will the font not change? Why is this necessary?",
  "q_faq_notes_3": "Calling _() in the Update() method is not recommended. But what if I need to update text every frame (e.g., a timer)? What is the most performant way to do this, caching only the format string?",
  "q_faq_tts_voices": "How do I assign specific voices to characters?",
  "q_faq_window_actions_1": "What happens if the internet connection is lost during a batch auto-translation? Will the tool retry the failed batch according to the Retry Policy, or will the process be completely interrupted?",
  "q_faq_window_actions_2": "If I import a CSV file that contains keys that already exist in the project but with empty values for some languages, will these empty values replace my existing translations or be ignored?",
  "q_faq_window_actions_3": "The \"Danger Zone\" section allows deleting all components. Will it remove components from prefabs that are in folders not specified in the Prefab Folders on the Content tab?",
  "q_faq_window_actions_4": "When importing from Google Sheets, how should I format the comments column for placeholder validation using the @placeholders: directive to work?",
  "q_faq_window_actions_5": "Can the tool import data from multiple sheets of a single Google Sheets document, or does it only work with one sheet per GID?",
  "q_faq_window_assets_1": "What if I have two assets with the same key but different types in the same scan folder (e.g., sound_effect_en.mp3 and sound_effect_en.wav)? Which one will end up in the asset table?",
  "q_faq_window_assets_2": "If I click Scan Assets & Analyze Project, and there is an Image object in the scene for which a localized sprite already exists, but the Image object itself does not yet have a LocalizedAsset component, will the tool add the component and automatically insert the key?",
  "q_faq_window_assets_3": "Can I use the same Naming Rule for different asset categories if they have different Scan Folders? Will this cause conflicts?",
  "q_faq_window_assets_4": "If a localizable asset (e.g., button_ok_en.png) is not in the root of the Scan Folder, but in a subfolder, will the scanner find it?",
  "q_faq_window_content_1": "What if I add a scene to Scenes to Parse that is not included in the Build Settings? Will this affect anything other than the parsing process itself?",
  "q_faq_window_content_2": "I added an object to Ignore Specific Objects (the temporary list). If I make a prefab out of this object, will the instance of this prefab also be ignored?",
  "q_faq_window_content_3": "If I add the TMPro.TMP_Text component to Parsing Ignores -> Ignore Component Types, but there is an object in the scene with a LocalizedText that already references this TMP_Text, what will happen on the next Update Keys? Will the key be deleted?",
  "q_faq_window_content_4": "The documentation says that \"Pin\" saves the full path to the object and will break if it is renamed. What if I make a prefab from the object and then rename the original object — will \"Pin\" continue to work for the prefab instances?",
  "q_faq_window_content_5": "If I use \"Pin\" for a child object inside a prefab instance, what path will be saved: relative to the prefab root or the scene root? Will it work in other scenes?",
  "q_faq_window_preview_1": "I opened a prefab in Prefab Mode, applied the In-Editor Preview, and pressed Ctrl+S. Will the temporary preview data be saved to the prefab asset? How does LocalizationPreviewProtector handle this case?",
  "q_faq_window_preview_2": "If I enable In-Editor Preview and the Unity editor crashes, and the Temp/localization_preview_recovery.json file gets corrupted (e.g., empty or invalid JSON), what will happen on the next launch?",
  "q_faq_window_preview_3": "In In-Editor Preview mode for LocalizedPrefab, a temporary instance is created. Will the Awake() and Start() methods be executed on this instance? Could this cause errors if they are not designed to run in Edit Mode?",
  "q_faq_window_report_1": "The \"Find\" button searches for the object asynchronously. What if I start a search and then immediately click Update Keys? Will the search be interrupted?",
  "q_faq_window_report_2": "If a key is used in multiple places (e.g., on two different buttons in different scenes), how will this be displayed in the report under the \"Duplicates\" category?",
  "q_faq_window_report_3": "If I click \"Find\" for a key that is only used in code (via the _() function), what will happen? Will the tool be able to find and highlight the C# script?",
  "q_faq_window_settings_1": "I can change the Key Generation Mode from UseTextAsKey to AutoGenerateKeysOnly mid-project. What exactly will happen to my existing translations? Will they be mapped to the new keys?",
  "q_faq_window_settings_2": "If I add a language with a code that has no pluralization rules (e.g., \"kz\" for Kazakh) to the Supported Languages list, which rule will be used by default?",
  "q_faq_window_settings_3": "What if I specify the Translations Path not in StreamingAssets, but in a regular folder like Assets/MyTranslations? Will the json files be included in the game build?",
  "q_faq_window_settings_4": "The auto-translation API key is stored in EditorPrefs. If I am working on the project on two different computers, do I need to enter the key on each machine separately?",
  "tip_best_practice": "<strong>Pro Tip:</strong> If you need to localize a Property, create a backing field with <code>[LocalizableField]</code> and expose the property separately.",
  "toc_search_placeholder": "Search documentation...",
  "toc_title": "Table of Contents",
  "toggle_notes_title": "Toggle Notes",
  "warning_box_components": "<strong>Important Note:</strong> All components described below are added to game objects automatically during parsing (when you click the <code>Update Keys</code> button). You do not need to add them manually.",
  "warning_tms_overwrite": "<strong>Warning:</strong> Pulling from TMS will overwrite local translations for the matching keys. Make sure your TMS is the single source of truth."
}