{
  "page_title": "Documentaci칩n de la Herramienta de Localizaci칩n de Unity",
  "toc_title": "Tabla de Contenidos",
  "toc_search_placeholder": "Buscar documentaci칩n...",
  "nav_introduction": "1. Introducci칩n",
  "nav_quick_start": "2. Inicio R치pido",
  "nav_components": "3. Componentes Principales",
  "nav_loc_tool_window": "4. Ventana \"Localization Tool\"",
  "nav_translation_editor": "5. Editor de Traducci칩n",
  "nav_ai_profiles": "6. Perfiles de IA y Traducci칩n (Nuevo v1.1)",
  "nav_usage_examples": "7. Ejemplos de Uso",
  "nav_important_notes": "8. Notas Importantes",
  "nav_extending": "9. Ampliaci칩n de la Funcionalidad",
  "nav_faq": "10. Preguntas Frecuentes y Soluci칩n de Problemas",
  "nav_migration_tool": "11. Herramienta de Migraci칩n",
  "nav_font_glyph_manager": "12. Gestor de Fuentes y Glifos",
  "nav_pseudo_tool": "13. Herramienta de Pseudo-Localizaci칩n",
  "nav_ai_audio": "14. Audio IA / Texto a Voz",
  "nav_key_features": "Caracter칤sticas Clave",
  "nav_installation": "2.1. Instalaci칩n",
  "nav_initial_setup": "2.2. Configuraci칩n Inicial",
  "nav_localizedtext": "3.1. LocalizedText",
  "nav_localizedasset": "3.2. LocalizedAsset",
  "nav_localizedprefab": "3.3. LocalizedPrefab",
  "nav_uitklocalization": "3.4. UITKLocalization",
  "nav_localizeddropdown": "3.5. LocalizedDropdown",
  "nav_localizedbehaviour": "3.6. LocalizedBehaviour",
  "nav_context_menu": "3.7. Men칰 Contextual",
  "nav_in_editor_preview": "4.1. Vista Previa en el Editor y Prefabs",
  "nav_tab_settings": "4.2. Pesta침a \"Settings\" (Configuraci칩n)",
  "nav_tab_content": "4.3. Pesta침a \"Content\" (Contenido) (Redise침ada)",
  "nav_tab_actions": "4.4. Pesta침a \"Actions\" (Acciones)",
  "nav_tab_assets": "4.5. Pesta침a \"Assets\" (Activos)",
  "nav_tab_report": "4.6. Pesta침a \"Report\" (Informe)",
  "nav_ai_profiles_overview": "6.1. Perfiles de Traducci칩n",
  "nav_custom_ai": "6.2. IA y Modelos Personalizados",
  "nav_ai_context": "6.3. Contexto y Glosario",
  "nav_ai_assistant": "6.4. Comandos del Asistente de IA",
  "nav_example_components": "7.1. Componentes Listos para Usar",
  "nav_example_attribute": "7.2. Atributo [LocalizableField]",
  "nav_example_function": "7.3. Funci칩n _()",
  "nav_example_plurals": "7.4. Plurales y G칠nero",
  "nav_custom_parser": "9.1. Creaci칩n de un Analizador (Parser) Personalizado",
  "nav_faq_installation": "10.1. Instalaci칩n e Inicio R치pido",
  "nav_faq_components": "10.2. Componentes Principales",
  "nav_faq_window": "10.3. Ventana \"Localization Tool\"",
  "nav_faq_window_actions": "10.3. Ventana \"Localization Tool\" - Pesta침a \"Actions\"",
  "nav_faq_window_assets": "10.3. Ventana \"Localization Tool\" - Pesta침a \"Assets\"",
  "nav_faq_window_report": "10.3. Ventana \"Localization Tool\" - Pesta침a \"Report\"",
  "nav_faq_editor": "10.4. Editor de Traducci칩n",
  "nav_faq_examples": "10.5. Ejemplos de Uso y C칩digo",
  "nav_faq_notes": "10.6. Matices y Advertencias Importantes",
  "nav_faq_extending": "10.7. Ampliaci칩n de la Funcionalidad",
  "h1_introduction": "Introducci칩n",
  "p_intro_1": "Esta herramienta es una soluci칩n integral para localizar juegos y aplicaciones en Unity. Automatiza el proceso de recolecci칩n de texto y activos, gestiona las traducciones a trav칠s de una potente interfaz, se integra con servicios de traducci칩n autom치tica (incluida la IA personalizada) y actualiza din치micamente el contenido localizado en el juego.",
  "h2_key_features": "Caracter칤sticas Clave",
  "li_feature_1": "<strong>An치lisis Avanzado:</strong> Escaneo autom치tico de escenas, prefabs, UI Toolkit (UXML) y scripts C#, incluidos campos marcados con el atributo <code>[LocalizableField]</code>, as칤 como clases y listas anidadas.",
  "li_feature_2": "<strong>Localizaci칩n de Cualquier Activo:</strong> Gesti칩n de sprites, audio, prefabs, materiales, etc.",
  "li_feature_3": "<strong>Potente Editor de Traducci칩n:</strong> Una interfaz centralizada con autoguardado, soporte completo de Deshacer/Rehacer, agrupaci칩n inteligente de claves y <strong>Novedad en v1.1:</strong> acciones de selecci칩n m칰ltiple.",
  "li_feature_4": "<strong>IA y Traducci칩n Autom치tica (v1.1):</strong> Nuevo sistema de Perfiles compatible con DeepL, Google, Microsoft y <strong>IA Personalizada (OpenAI, Gemini, Claude, Ollama)</strong> con conciencia de contexto.",
  "li_feature_5": "<strong>Importaci칩n/Exportaci칩n Flexible:</strong> Soporte para CSV, XML, YAML, XLIFF e importaci칩n directa desde Google Sheets.",
  "li_feature_6": "<strong>Vista Previa en Vivo:</strong> Previsualiza cualquier idioma en la Vista de Escena o en el <strong>Modo Prefab</strong> sin ejecutar el juego.",
  "li_feature_7": "<strong>Soporte para Plural y G칠nero:</strong> Manejo correcto de formas plurales (con reglas para idiomas eslavos, 치rabes y otros) y g칠nero.",
  "li_feature_8": "<strong>Soporte Completo para RTL:</strong> Visualizaci칩n correcta de idiomas de derecha a izquierda.",
  "li_feature_9": "<strong>Actualizaciones en Vivo:</strong> Carga traducciones actualizadas desde un servidor remoto al inicio del juego.",
  "li_feature_10": "<strong>Gestor de Copias de Seguridad:</strong> Una herramienta integrada para crear y restaurar copias de seguridad.",
  "li_feature_11": "<strong>Impulsado por IA:</strong> Soporte para OpenAI, Anthropic (Claude), Google Gemini y LLMs locales (Ollama) a trav칠s de perfiles personalizables.",
  "li_feature_12": "<strong>Texto a Voz (TTS):</strong> Generaci칩n de archivos de audio para cadenas localizadas mediante IA (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Herramientas de Migraci칩n:</strong> Herramientas para la transici칩n autom치tica desde los plugins I2 Localization y Unity Localization.",
  "li_feature_14": "<strong>Gestor de Fuentes y Glifos:</strong> Herramienta para analizar los caracteres utilizados y encontrar glifos faltantes en las fuentes.",
  "li_feature_15": "<strong>Depuraci칩n Visual:</strong> Iconos en la jerarqu칤a y etiquetas en la Vista de Escena para una depuraci칩n r치pida.",
  "h1_quick_start": "Inicio R치pido y Configuraci칩n",
  "h2_installation": "2.1. Instalaci칩n",
  "li_install_1": "Copia el activo en la carpeta de tu proyecto de Unity.",
  "li_install_2": "La herramienta comprobar치 autom치ticamente las dependencias necesarias. Confirma la instalaci칩n en el cuadro de di치logo que aparece.",
  "li_install_3": "Las dependencias requeridas (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) son necesarias para la funcionalidad b치sica.",
  "li_install_4": "Las dependencias opcionales (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) activan caracter칤sticas adicionales.",
  "li_install_5": "Haz clic en <strong>Install Selected</strong> para instalar los paquetes recomendados.",
  "li_install_6": "Despu칠s de la instalaci칩n, abre la ventana principal de la herramienta a trav칠s del men칰 <strong>Tools -> Localization Tool</strong>.",
  "li_install_7": "Si planeas usar la carga as칤ncrona de activos, instala el paquete <strong>Addressables</strong> a trav칠s del Gestor de Paquetes.",
  "h2_initial_setup": "2.2. Configuraci칩n Inicial",
  "li_setup_1": "<strong>Crear Configuraci칩n:</strong> Al abrir por primera vez, la herramienta crear치 un archivo <code>LocalizationSettings.asset</code> en la carpeta <code>Assets/Resources</code>.",
  "li_setup_2": "<strong>Configurar Idiomas:</strong> En la pesta침a <strong>Settings</strong>, en <strong>Language Management</strong>, aseg칰rate de que tu idioma principal (p. ej., <code>es</code> para espa침ol) est칠 seleccionado como <strong>Source Language</strong>. Habilita todos los idiomas que planeas admitir.",
  "li_setup_3": "<strong>Especificar Contenido para Analizar:</strong> En la pesta침a <strong>Content</strong>, a침ade todas las escenas para el an치lisis a la lista <strong>Scenes to Parse</strong>. Si utilizas prefabs con texto, aseg칰rate de que sus carpetas se a침adan a <strong>Prefab Folders</strong>.",
  "li_setup_4": "<strong>Primera Ejecuci칩n del Analizador:</strong> Ve a la pesta침a <strong>Actions</strong> y haz clic en el bot칩n <code>Update Keys</code>. La herramienta escanear치 tu proyecto, crear치 archivos de traducci칩n y a침adir치 autom치ticamente los componentes necesarios (<code>LocalizedText</code>, <code>LocalizedAsset</code>, etc.) a los objetos de juego.",
  "li_setup_5": "<strong>Configuraci칩n y Builds (CR칈TICO):</strong> La herramienta a침ade autom치ticamente <code>LocalizationSettings.asset</code> a <code>Project Settings -> Player -> Preloaded Assets</code>. <br>丘멆잺 <strong>Comprobaci칩n de Seguridad:</strong> Si la configuraci칩n falta en Preloaded Assets y no est치 en una carpeta Resources, la herramienta <strong>bloquear치 la build</strong> con una <code>BuildFailedException</code> para evitar que el juego se bloquee al inicio.",
  "h1_components": "Componentes Principales (asignados autom치ticamente)",
  "warning_box_components": "<strong>Nota Importante:</strong> Todos los componentes descritos a continuaci칩n se a침aden a los objetos de juego autom치ticamente durante el an치lisis (cuando haces clic en el bot칩n <code>Update Keys</code>). No es necesario que los a침adas manualmente.",
  "p_components_intro": "Estos componentes son el \"puente\" entre tus objetos en la escena y la base de datos de traducci칩n. \"Escuchan\" los cambios de idioma y sustituyen autom치ticamente el texto o activo correcto.",
  "h2_localizedtext": "3.1. LocalizedText",
  "p_localizedtext_1": "El componente principal para mostrar texto traducido. Se coloca en objetos con <code>Text</code>, <code>TMP_Text</code> y <code>TextMesh</code>.",
  "li_localizedtext_1": "<code>localizationKey</code>: La clave utilizada para encontrar la traducci칩n. Generada autom치ticamente.",
  "li_localizedtext_2": "<code>isStyleOnly</code>: Si es <code>true</code>, el componente solo aplicar치 estilos (fuente, RTL) pero no cambiar치 el texto en s칤. 칔til para elementos cuyo texto es gestionado por otro script (p. ej., <code>LanguageSelector</code>).",
  "li_localizedtext_3": "<code>originalSourceText</code>: El texto original en el idioma base. Utilizado como reserva (fallback).",
  "h2_localizedasset": "3.2. LocalizedAsset",
  "p_localizedasset_1": "Se utiliza para intercambiar activos seg칰n el idioma. Detecta autom치ticamente el tipo de componente. Soporta: <ul><li><strong>2D:</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Texturas (<code>RawImage</code>).</li><li><strong>Audio/V칤deo:</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animaci칩n:</strong> <code>MeshFilter</code> (Mallas), <code>Renderer</code> (Materiales), <code>Animator</code> (Controlador), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "Para los componentes con la opci칩n <strong>Play on Awake</strong> (como <code>AudioSource</code>, <code>VideoPlayer</code>), <code>LocalizedAsset</code> intercepta correctamente la reproducci칩n autom치tica, intercambia el activo y luego comienza la reproducci칩n para evitar reproducir contenido no localizado.",
  "h2_localizedprefab": "3.3. LocalizedPrefab",
  "p_localizedprefab_1": "Un componente para localizar prefabs completos. Funciona de forma no destructiva: no modifica el prefab original, sino que crea una instancia de la versi칩n localizada como un objeto hijo, deshabilitando todos los scripts (<code>MonoBehaviour</code>), renderizadores (<code>Renderer</code>) y colliders (<code>Collider</code>) en el objeto original. Esto evita la ejecuci칩n de l칩gica dual y artefactos visuales. Para un funcionamiento correcto en tiempo de ejecuci칩n, su orden de ejecuci칩n se establece en -100 (<code>[DefaultExecutionOrder(-100)]</code>) para asegurar que se ejecute antes que otros scripts.",
  "h2_uitklocalization": "3.4. UITKLocalization",
  "p_uitklocalization_1": "A침adido a objetos con un <code>UIDocument</code>. Soporta la localizaci칩n de Labels, Buttons, <strong>TextField Placeholders, DropdownField choices, RadioButtonGroup y ToggleButtonGroup options</strong>. Los identificadores son estables a pesar de los cambios de nombre si se establecen IDs en UI Builder.",
  "h2_localizeddropdown": "3.5. LocalizedDropdown",
  "p_localizeddropdown_1": "A침adido a <code>Dropdown</code> y <code>TMP_Dropdown</code> para traducir sus opciones.",
  "h2_localizedbehaviour": "3.6. LocalizedBehaviour",
  "p_localizedbehaviour_1": "Un componente de utilidad que permite que tus scripts reaccionen a los cambios de idioma. Encuentra y llama autom치ticamente a los m칠todos marcados con el atributo <code>[OnLanguageChange]</code>.",
  "h2_context_menu": "3.7. Men칰 Contextual \"Analyze for Localization\"",
  "p_context_menu_1": "Para a침adir r치pidamente un <code>LocalizedAsset</code> a un objeto, puedes hacer clic derecho en el componente deseado (p. ej., <code>Image</code>, <code>AudioSource</code>) en el inspector y seleccionar <strong>Analyze for Localization</strong>. La herramienta a침adir치 y configurar치 el componente por s칤 misma. (Esto es opcional, pero puede usarse para la adici칩n manual).",
  "h1_loc_tool_window": "Ventana \"Localization Tool\"",
  "h2_in_editor_preview": "4.1. Vista Previa en el Editor y Prefabs",
  "p_preview_1": "Justo debajo del encabezado se encuentra la lista desplegable <strong>Preview Language</strong>. Esta potente caracter칤stica te permite ver c칩mo se ver치 la localizaci칩n en cualquier idioma directamente en la ventana <strong>Scene</strong> o en el <strong>Modo Prefab</strong>, sin ejecutar el juego.",
  "li_preview_1": "<strong>C칩mo funciona:</strong> Selecciona un idioma de la lista, y la herramienta aplicar치 instant치neamente las traducciones, fuentes, configuraciones RTL y activos correspondientes a todos los objetos localizables en la escena activa o prefab abierto.",
  "li_preview_2": "<strong>Marcadores de Posici칩n:</strong> Si se selecciona un estilo de marcador de posici칩n (p. ej., <strong>Accents</strong> o <strong>Brackets</strong>) en la pesta침a <strong>Settings</strong>, estos marcadores de posici칩n se mostrar치n en el modo de vista previa en lugar de las traducciones reales. Esto es ideal para probar el dise침o y encontrar elementos no localizados.",
  "li_preview_3": "<strong>Seguridad:</strong> Todos los cambios realizados en el modo de vista previa son temporales. La herramienta revertir치 autom치ticamente todo a su estado original cuando selecciones \"<strong>Revert to Original</strong>\", cierres la ventana, cambies de escena o antes de guardar una escena/prefab (gracias al componente <code>LocalizationPreviewProtector</code>).",
  "li_preview_4": "<strong>Protecci칩n contra Fallos:</strong> El sistema hace una copia de seguridad autom치tica del estado de la escena en la carpeta <code>Library</code> antes de la vista previa. Si Unity falla o cierras forzosamente mientras previsualizas, la herramienta detecta el archivo de recuperaci칩n en el siguiente inicio y ofrece restaurar el estado original de la escena.",
  "h2_tab_settings": "4.2. Pesta침a \"Settings\" (Configuraci칩n)",
  "p_settings_1": "Tu centro de control. Aqu칤 defines las reglas globales para todo el proceso de localizaci칩n.",
  "li_settings_1": "<strong>Key Generation Mode:</strong> Elige c칩mo se crear치n las claves.<ul><li><code>UseTextAsKey</code>: El texto en s칤 se convierte en la clave. Ideal para prototipos.</li><li><code>AutoGenerateKeysOnly</code>: La clave se genera en funci칩n de la jerarqu칤a y el nombre del objeto. Fiable para producci칩n.</li><li><code>Manual</code>: El analizador NO generar치 claves autom치ticamente. Solo actualizar치 los objetos que ya tengan una clave asignada.</li><li><code>UseTextAsKeyWithCustomPriority</code> / <code>AutoGenerateWithCustomKeys</code>: Modos h칤bridos que permiten claves personalizadas a trav칠s de atributos de c칩digo.</li><li><strong>Migraci칩n Segura:</strong> Puedes cambiar el modo en cualquier momento; la herramienta intenta migrar las traducciones existentes.</li></ul>",
  "li_settings_2": "<strong>Language Management:</strong><ul><li><strong>Source Language:</strong> El idioma utilizado en tus escenas/prefabs de Unity (idioma de desarrollo).</li><li><strong>Default Language:</strong> El idioma seleccionado en el primer inicio del juego si el idioma del sistema del usuario no es compatible.</li><li><strong>List:</strong> Gestiona los idiomas admitidos, asigna <strong>Font Assets</strong> espec칤ficos y habilita el soporte <strong>RTL</strong>.</li></ul>",
  "li_settings_3": "<strong>General Settings:</strong><ul><li><code>Parse Prefabs</code>: Habilita el an치lisis de prefabs.</li><li><code>Split files by language</code>: Determina c칩mo almacenar las traducciones (un archivo grande o un archivo por idioma).</li><li><code>Translations Path</code>: La ruta para almacenar los archivos de traducci칩n <code>.json</code>. Importante: la carpeta debe estar dentro de <code>Assets/StreamingAssets/</code>.</li></ul>",
  "li_settings_4": "<strong>Debugging & Testing:</strong><ul><li><code>Placeholder Style</code>: Elige el estilo para mostrar marcadores de posici칩n en el modo de vista previa.</li></ul>",
  "li_settings_5": "<strong>Live Updates:</strong> Configuraci칩n para cargar traducciones desde un servidor remoto.",
  "li_settings_6": "<strong>Runtime API Key:</strong> Almacena de forma segura tu clave API para la traducci칩n autom치tica dentro del juego. La clave est치 <strong>ofuscada</strong> (cifrada) en la build para evitar una f치cil extracci칩n mediante b칰squeda de cadenas, pero recuerda: ning칰n secreto del lado del cliente es 100% seguro.",
  "li_settings_7": "<strong>Asset Loading Strategy:</strong> Elecci칩n entre <code>Resources (Legacy)</code> (carga s칤ncrona, m칠todo antiguo) y <code>Addressables (Async)</code> (carga as칤ncrona, recomendada para proyectos grandes).",
  "li_settings_8": "<strong>Auto-Translation:</strong> Ahora utiliza el sistema <strong>Translation Profiles</strong>. Debes crear un activo de perfil (Clic derecho -> Create -> Localization -> Translation Profile) o seleccionar un preajuste en la carpeta <code>Localization/Presets</code>. Los perfiles admiten: Google Translate, DeepL, Microsoft, OpenAI, Claude, Gemini, Ollama. En la configuraci칩n, selecciona <strong>Active Text Profile</strong> (para texto) y <strong>Active Audio Profile</strong> (para TTS).",
  "li_settings_9": "<strong>Debugging Enhancements:</strong><ul><li><code>Show Hierarchy Icons</code>: Muestra iconos de estado (Tick Verde / Advertencia Amarilla) en la jerarqu칤a. <strong>Rendimiento Optimizado:</strong> Utiliza cach칠 para garantizar cero lag incluso en escenas grandes.</li><li><code>Show Scene View Labels</code>: Depuraci칩n visual directamente en la Vista de Escena. Las etiquetas son interactivas: Haz clic derecho en cualquier etiqueta de escena para copiar instant치neamente la clave de localizaci칩n al portapapeles.</li><li><code>Pseudo-Localization</code>: Prueba la expansi칩n del dise침o de la UI sin traducciones.</li></ul>",
  "li_settings_10": "<strong>Dev Tools:</strong> En la parte inferior de la pesta침a Settings, puedes encontrar botones de utilidad como <strong>Clear Saved Language Pref</strong> (restablece el idioma guardado en PlayerPrefs para que el juego comience de nuevo con el idioma Predeterminado).",
  "li_settings_11": "<strong>Technical Dropdown Options:</strong> Una lista de valores de cadena (valores predeterminados: 'Option A', 'Option B', 'Option C') que el analizador <strong>ignorar치</strong> al escanear Dropdowns. Esto mantiene limpia tu tabla de traducci칩n del texto de marcador de posici칩n de UI predeterminado de Unity.",
  "li_assistant_3": "<strong>Custom Commands:</strong> 춰No est치s limitado a los preajustes! Abre el inspector de tu activo <strong>Translation Profile</strong> para a침adir tus propias indicaciones (p. ej., 'Rewrite in pirate style', 'Check spelling'). Estas aparecer치n autom치ticamente en el men칰 contextual del editor.",
  "li_font_glyph_workflow": "<strong>Flujo de Trabajo para TMP:</strong> 1. Ejecuta Escanear. 2. Selecciona un idioma con glifos faltantes. 3. Haz clic en <strong>'Copy Character Set'</strong>. 4. Abre Window -> TextMeshPro -> Font Asset Creator. 5. Pega el portapapeles en el campo 'Character Sequence (Custom Range)' para generar un atlas que contenga exactamente los caracteres que tu juego necesita.",
  "li_assets_addressables_naming": "<strong>Convenci칩n de Nombres:</strong> Al escanear, la herramienta establece autom치ticamente las Direcciones de Addressable en el formato <code>{Category}/{Language}/{Key}</code>. <strong>No cambies el nombre</strong> de estas direcciones manualmente, ya que LocalizationManager se basa en este formato espec칤fico para cargar activos en tiempo de ejecuci칩n.",
  "p_ai_audio_economy": "<strong>Ahorro de Costes:</strong> La herramienta calcula un hash MD5 de tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus cr칠ditos de API. Si cambias una traducci칩n, el sistema marca solo ese archivo de audio espec칤fico como 'Outdated'. Usa 'Generate Missing/Outdated' para regenerar solo lo que cambi칩, ahorrando cr칠ditos de API. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus cr칠ditos de API a trav칠s de lotes inteligentes.",
  "li_content_regex_example": "<strong>Ejemplo de Envoltorio Personalizado:</strong> Si usas una funci칩n personalizada como <code>MyGame.Loc(\"KEY\")</code>, a침ade una Regla de An치lisis de Script con la regex: <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>. El analizador ahora capturar치 claves de tu c칩digo personalizado.",
  "li_settings_icons_legend": "<strong>Leyenda de Iconos de Jerarqu칤a:</strong><br>游릭 (Tick Verde): Localizado y Clave establecida.<br>游댮 (Error Rojo): Componente localizado presente, pero <strong>falta la Clave</strong>.<br>游리 (Advertencia Amarilla): Componente Text/Image encontrado, pero <strong>no hay componente de Localizaci칩n</strong> adjunto.<br>游냍 (Error): Objeto <strong>Ignorado</strong> por la configuraci칩n.",
  "h2_tab_content": "4.3. Pesta침a \"Content\" (Contenido) (Redise침ada en v1.1)",
  "p_content_1": "Aqu칤 le dices a la herramienta d칩nde buscar exactamente el texto. La interfaz ha sido completamente redise침ada para una mejor usabilidad.",
  "li_content_1": "<strong>Scenes to Parse:</strong> Arrastra y suelta todas las escenas para el an치lisis aqu칤.",
  "li_content_2": "<strong>Prefab Folders:</strong> Especifica carpetas con prefabs. Ahora es compatible con paginaci칩n y b칰squeda para proyectos grandes.",
  "li_content_3": "<strong>Dynamic Texts:</strong> Introduce aqu칤 las cadenas que se crean exclusivamente en c칩digo (p. ej., \"Game Over\").",
  "li_content_4": "<strong>Parsing Configuration:</strong> Especifica scripts/objetos para ignorar. En <strong>Attributes to Scan</strong>, puedes a침adir nombres de atributos personalizados (p. ej., <code>[Header]</code>, <code>[TermsPopup]</code>) para que el analizador trate esos campos como texto localizable.",
  "li_content_5": "<strong>Pin:</strong> Esta caracter칤stica te permite \"anclar\" un objeto de la escena a la lista de ignorados. En lugar de una referencia temporal al objeto, la herramienta guardar치 su ruta completa en la jerarqu칤a, haciendo que la omisi칩n sea persistente entre sesiones.",
  "li_content_6": "<strong>Script Parsing Rules:</strong> Define reglas Regex personalizadas para encontrar claves en tu c칩digo. <br>游댠 <strong>Novedad:</strong> Utiliza el bot칩n <strong>'Add Preset'</strong> para a침adir instant치neamente reglas para activos de terceros (I2 Localization, Unity Localization) o envoltorios est치ndar.",
  "li_content_7": "<strong>Dynamic Key Prefixes:</strong> Lista de prefijos para claves (p. ej., <code>Item_</code>) que no se eliminar치n durante la limpieza (Remove Missing Keys), incluso si el analizador no las encontr칩 en la escena.",
  "h2_tab_actions": "4.4. Pesta침a \"Actions\" (Acciones)",
  "p_actions_1": "La pesta침a de trabajo principal.",
  "li_actions_1": "<strong>Parsing:</strong><ul><li><strong>Update Keys:</strong> Escaneo completo del proyecto definido por la configuraci칩n de la pesta침a 'Content'.</li><li><strong>Scan Selected Assets:</strong> Escanea S칍LO los archivos/carpetas actualmente seleccionados en la Vista de Proyecto. M치s seguro para actualizaciones parciales ya que deshabilita autom치ticamente 'Remove Missing Keys'.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor:</strong> Abre una ventana separada y m치s conveniente para editar todas las traducciones.",
  "li_actions_3": "<strong>Data Management:</strong> Utilizar para intercambiar datos con traductores (Exportar/Importar a CSV/XML/YAML/XLIFF, importar desde Google Sheets).",
  "li_actions_4": "<strong>Auto-Translation:</strong> Rellena autom치ticamente todas las cadenas de traducci칩n vac칤as utilizando el <strong>Translation Profile</strong> activo.",
  "li_actions_5": "<strong>Danger Zone:</strong> Contiene botones para eliminar completamente todos los componentes de localizaci칩n del proyecto. 춰칔salo con precauci칩n!",
  "h2_tab_assets": "4.5. Pesta침a \"Assets\" (Activos)",
  "p_assets_1": "Esta pesta침a est치 dedicada por completo a la localizaci칩n de recursos no textuales.",
  "li_assets_1": "<strong>Crear una estructura de carpetas (opcional):</strong> En la secci칩n <strong>2. Asset Folder Generation</strong>, haz clic en <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Configurar categor칤as y reglas de nomenclatura:</strong> En la secci칩n <strong>3. Asset Categories & Scanning</strong>, aseg칰rate de que la <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) coincida con tus archivos (p. ej., <code>button_ok_es.png</code>).",
  "li_assets_3": "<strong>Coloca tus activos:</strong> Pon los activos localizados en las carpetas.",
  "li_assets_4": "<strong>Escanear activos:</strong> En la secci칩n <strong>4. Automation</strong>, haz clic en <strong>Scan Assets & Update Tables</strong>. El proceso de limpieza se ha vuelto m치s seguro: ahora solo se eliminan los archivos de tabla antiguos (<code>.asset</code>), no la carpeta completa.",
  "li_assets_5": "<strong>Vincular activos a objetos:</strong> Haz clic en <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Addressables Integration:</strong> Si el modo <strong>Addressables</strong> est치 habilitado, los activos se registrar치n autom치ticamente en grupos de Addressables con direcciones en la forma <code>{Category}/{Language}/{Key}</code> durante el escaneo.",
  "h2_tab_report": "4.6. Pesta침a \"Report\" (Informe)",
  "p_report_1": "Despu칠s de cada an치lisis, este informe muestra la imagen completa del estado de tu localizaci칩n.",
  "li_report_1": "<strong>Categor칤as:</strong> Todas las Claves, A침adidas, Actualizadas (texto cambiado), Eliminadas, Duplicadas, Migradas, Omitidas (sin cambios).",
  "li_report_2": "<strong>B칰squeda Avanzada:</strong> Haz clic en el bot칩n <strong>Find</strong> junto a cualquier entrada para encontrar instant치neamente el objeto correspondiente en el proyecto. La b칰squeda funciona de forma as칤ncrona, no bloquea el editor y busca en todas las escenas y prefabs.",
  "h1_translation_editor": "Editor de la Tabla de Traducci칩n",
  "p_editor_1": "Se abre a trav칠s de <strong>Tools -> Localization -> Translation Table Editor</strong>. Esta es la herramienta principal para editar traducciones manualmente.",
  "li_editor_1": "<strong>Agrupaci칩n Inteligente:</strong> Las claves para plurales y g칠nero (p. ej., <code>apple_count_one</code>, <code>apple_count_few</code>) se combinan autom치ticamente en grupos plegables.",
  "li_editor_2": "<strong>Edici칩n Avanzada:</strong> Haz clic en una celda para abrir la ventana emergente <strong>MultiLineEditWindow</strong>. Muestra el texto de origen para comparaci칩n y valida los marcadores de posici칩n.",
  "li_editor_3": "<strong>Selecci칩n Avanzada (Nuevo):</strong> Soporta la selecci칩n de celdas individuales, filas o columnas enteras (idiomas).",
  "li_editor_4": "<strong>Acciones Masivas (Nuevo):</strong> Haz clic derecho en una selecci칩n para realizar operaciones masivas: Auto-Traducir celdas seleccionadas, Borrar contenido o Eliminar claves.",
  "li_editor_5": "<strong>Navegaci칩n Inteligente (Nuevo):</strong> Navega por la tabla usando las flechas del teclado y atajos (Ctrl+S para guardar, Ctrl+Z/Y para Deshacer/Rehacer).",
  "li_editor_6": "<strong>Filtros de Validaci칩n:</strong> Utiliza filtros avanzados para auditar tu proyecto: <ul><li><strong>Has Length Issues:</strong> Advertencia si la traducci칩n es significativamente m치s larga que el origen (+X%).</li><li><strong>Outdated Audio:</strong> Muestra claves donde el texto cambi칩 pero el audio no se regener칩.</li><li><strong>Missing Placeholders:</strong> Detecta si {0} est치 presente en el origen pero falta en la traducci칩n.</li></ul>",
  "li_editor_7": "<strong>Audio Status:</strong> La tabla ahora muestra el estado de los archivos de audio. Si el texto ha cambiado pero el archivo de audio sigue siendo antiguo (desajuste de hash), aparecer치 una advertencia (icono amarillo).",
  "li_editor_8": "<strong>Men칰 Contextual Mejorado:</strong> Comandos a침adidos: <strong>Generate Audio</strong> (crear voz en off para celdas seleccionadas) y <strong>AI Assistant</strong> (ejecutar comandos como \"Fix Grammar\" o \"Shorten\" usando el perfil de IA seleccionado).",
  "h1_ai_profiles": "Perfiles de IA y Traducci칩n (Nuevo v1.1)",
  "h2_ai_profiles_overview": "6.1. Perfiles de Traducci칩n",
  "p_ai_intro": "La versi칩n 1.1 introduce un nuevo sistema <strong>Translation Profile</strong> (ScriptableObject). Esto traslada la configuraci칩n del servicio de traducci칩n de la configuraci칩n global a activos de perfil individuales, lo que te permite cambiar de configuraci칩n f치cilmente.",
  "li_ai_1": "<strong>Create Profile:</strong> Clic derecho en la vista Project -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Services:</strong> Soporta DeepL, Google Translate, Microsoft Azure y <strong>Custom AI</strong>.",
  "li_ai_3": "<strong>Settings:</strong> Cada perfil almacena su propia Clave API, l칤mites (tama침o de lote, caracteres m치ximos) y configuraci칩n del modelo.",
  "li_ai_4": "<strong>AIPresetsGenerator:</strong> Utiliza el generador incorporado para crear r치pidamente perfiles para servicios populares (OpenAI, Gemini, Claude, Ollama).",
  "h2_custom_ai": "6.2. IA y Modelos Personalizados",
  "p_custom_ai": "El tipo de servicio <strong>Custom AI</strong> te permite conectar cualquier LLM a trav칠s de la API REST.",
  "li_custom_ai_1": "<strong>GenericAIService:</strong> Una implementaci칩n flexible que puede comunicarse con APIs compatibles con OpenAI (incluidos LLMs locales a trav칠s de Ollama).",
  "li_custom_ai_2": "<strong>Templates:</strong> Personaliza la plantilla JSON del cuerpo de la solicitud para que coincida con los requisitos de tu API.",
  "li_custom_ai_3": "<strong>Built-in Safety Features:</strong> Repara autom치ticamente las etiquetas de formato rotas (como <ph0>) a menudo devueltas por modelos de IA, asegurando traducciones fiables y consistentes.",
  "h2_ai_context": "6.3. Contexto y Glosario",
  "p_ai_context": "Para mejorar la calidad de la traducci칩n, la IA ahora recibe contexto adicional:",
  "li_context_1": "<strong>Developer Notes:</strong> Los comentarios de la tabla de traducci칩n se pasan a la IA como contexto.",
  "li_context_2": "<strong>Object Path:</strong> Si no existe ning칰n comentario, la ruta de jerarqu칤a del objeto (p. ej., <code>MainMenu/Canvas/StartButton</code>) se utiliza como contexto de reserva.",
  "li_context_3": "<strong>Glossary:</strong> Puedes cargar un glosario CSV en el perfil para forzar traducciones espec칤ficas para t칠rminos y nombres.",
  "h2_ai_assistant": "6.4. Comandos del Asistente de IA",
  "p_ai_assistant": "En el Editor de la Tabla de Traducci칩n, ahora puedes ejecutar comandos de IA personalizados en las celdas seleccionadas a trav칠s del men칰 contextual (Clic derecho -> AI: ...).",
  "li_assistant_1": "<strong>Configurable:</strong> Define comandos en tu Translation Profile (p. ej., \"Fix Grammar\", \"Make Formal\", \"Shorten for UI\").",
  "li_assistant_2": "<strong>Batch Processing:</strong> Selecciona m칰ltiples celdas para aplicar el comando a todas ellas a la vez.",
  "h1_usage_examples": "Ejemplos de Uso",
  "h2_example_components": "7.1. Componentes Listos para Usar y Ejemplos",
  "p_example_components_1": "El proyecto incluye scripts listos para usar que sirven como excelentes ejemplos.",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code>:</strong> Un componente listo para usar para crear una lista desplegable de UI para cambiar de idioma. Encuentra autom치ticamente todos los idiomas disponibles y gestiona su cambio.<br><strong>C칩mo usar:</strong> Simplemente a침ade el componente <code>LanguageSelector</code> a tu escena (p. ej., en un GameObject vac칤o) y especifica tu <code>TMP_Dropdown</code> en el inspector.",
  "li_example_components_2": "<strong>Code Examples:</strong> Para aprender t칠cnicas avanzadas como trabajar con <code>[LocalizableField]</code>, la funci칩n <code>_()</code>, plurales y g칠nero, estudia los archivos <code>StatPurchaseTest.cs</code> y <code>TestLocalization.cs</code>. Demuestran claramente la implementaci칩n de todas las caracter칤sticas principales de la herramienta en c칩digo.",
  "h2_example_attribute": "7.2. Atributo [LocalizableField]",
  "p_example_attribute_1": "The most powerful way to localize script variables. It works with <strong>private, protected, and public</strong> fields. The parser recursively handles <strong>Arrays, Lists</strong>, and <strong>Nested Serializable Classes</strong>. It can even generate keys for other attributes (like <code>[Header]</code> or <code>[Tooltip]</code>) if configured in Settings.",
  "code_example_attribute": "using Ankonoanko.Localization;\nusing UnityEngine;\nusing System.Collections.Generic;\n\npublic class HeroDialog : MonoBehaviour\n{\n    // 1. Private fields work perfectly\n    [LocalizableField]\n    private string secretWhisper = \"It's a secret to everybody.\";\n\n    // 2. Custom Key Override\n    [LocalizableField(\"hero_greeting_main\")]\n    public string greeting = \"Welcome, traveler!\";\n\n    // 3. Lists and Arrays (Keys become: inventory_header_0, inventory_header_1...)\n    [LocalizableField]\n    public string[] inventoryHeaders = new string[] { \"Weapons\", \"Potions\", \"Armor\" };\n\n    // 4. Nested Serializable Classes (Recursion supported)\n    [System.Serializable]\n    public class BossInfo\n    {\n        [LocalizableField] public string name;\n        [LocalizableField] public string title;\n    }\n    public BossInfo currentBoss; // Parser drills down into this\n\n    // 5. List of Nested Objects\n    [LocalizableField]\n    public List<BossInfo> bossList = new List<BossInfo>();\n\n    // 6. Custom Key on List (Keys: dungeon_hints_list_0, dungeon_hints_list_1...)\n    [LocalizableField(\"dungeon_hints_list\")]\n    public List<string> dungeonHints = new List<string>\n    {\n        \"Beware of traps.\",\n        \"Use fire against trolls.\"\n    };\n\n    // 7. Interpolated Strings (Parser reads the raw format string)\n    [LocalizableField(\"fire_sword_name\")]\n    public string ItemName1 = $\"Fire Sword {0}\";\n}",
  "h2_example_function": "7.3. Funci칩n _() y Atributo [OnLanguageChange]",
  "p_example_function_1": "Utiliza la funci칩n <code>_()</code> para texto din치mico que cambia durante el juego. El m칠todo que actualiza la UI debe estar marcado con el atributo <code>[OnLanguageChange]</code> para que se llame autom치ticamente cuando se cambie el idioma. Se a침adir치 autom치ticamente un componente <code>LocalizedBehaviour</code> al objeto para este prop칩sito.",
  "code_example_function": "// Para usar la llamada corta _(), a침ade estas l칤neas\nusing static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization; // Necesario para [OnLanguageChange]\nusing UnityEngine;\nusing TMPro;\nusing System.Collections.Generic;\npublic class PlayerHUD : MonoBehaviour\n{\n    [SerializeField] private TMP_Text scoreText;\n    private int score = 100;\n    private string playerName = \"Alex\";\n    \n    void Start()\n    {\n        UpdateUI(); // Actualizaci칩n inicial\n    }\n    \n    // Este m칠todo se llamar치 autom치ticamente cuando cambie el idioma\n    [OnLanguageChange]\n    void UpdateUI()\n    {\n        // 1. Marcadores de posici칩n indexados (como en string.Format)\n        // Clave: \"score_label\", Texto en el archivo: \"Score: {0}\"\n        scoreText.text = _(\"score_label\", score); // Resultado: \"Score: 100\"\n        \n        // 2. Marcadores de posici칩n con nombre (recomendado para legibilidad)\n        // Clave: \"welcome_message\", Texto: \"Welcome, {username}!\"\n        string welcomeText = _(\"welcome_message\", new { username = playerName });\n        \n        // Para casos complejos o alto rendimiento\n        var args = new Dictionary<string, object> { { \"username\", playerName } };\n        string welcomeText2 = _(\"welcome_message\", args);\n    }\n}",
  "h2_example_plurals": "7.4. Plurales y G칠nero",
  "p_example_plurals_1": "La herramienta ahora utiliza reglas m치s precisas para diferentes grupos de idiomas.",
  "code_example_plurals": "using static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Claves: \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Textos: \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Selecciona autom치ticamente la forma correcta\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Claves: \"user_greeted_male\", \"user_greeted_female\"\n        // Textos: \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "h1_important_notes": "Notas Importantes y Advertencias",
  "li_notes_1": "<strong>Copias de Seguridad:</strong> Crea siempre una copia de seguridad a trav칠s de <strong>Translation Table Editor -> Manage Backups</strong> antes de realizar cambios importantes. Las copias de seguridad se almacenan en la carpeta <code>LocalizationBackups</code> <strong>en la ra칤z del proyecto (fuera de la carpeta Assets)</strong> para mantener limpio tu proyecto de Unity y reducir los tiempos de importaci칩n.",
  "li_notes_2": "<strong>Seguridad de la Clave API:</strong> La clave para trabajar en el editor se almacena localmente en tu m치quina (en <code>EditorPrefs</code>) y no entra en el repositorio. Para las claves necesarias en la build del juego, utiliza la secci칩n <strong>Runtime API Key</strong>.",
  "li_notes_3": "<strong>Carpeta <code>StreamingAssets</code>:</strong> Los archivos de traducci칩n deben estar en una subcarpeta de <code>Assets/StreamingAssets/</code> para ser incluidos en la build del juego.",
  "li_notes_4": "<strong>\"A prueba de fallos\":</strong> La herramienta te protege autom치ticamente de guardar accidentalmente datos temporales del modo de vista previa en una escena o prefab.",
  "li_notes_5": "<strong>Rendimiento:</strong> La llamada <code>_()</code> es r치pida, pero en bucles que se ejecutan en cada frame (p. ej., en <code>Update</code>), intenta almacenar el resultado en cach칠 en una variable.",
  "li_notes_6": "<strong>Excluir <code>LanguageSelector</code> del an치lisis:</strong> El objeto con el componente <code>LanguageSelector</code> y su <code>TMP_Dropdown</code> deben a침adirse a la lista <strong>Ignore Specific Objects</strong> en la pesta침a <strong>Content</strong>. Esto es necesario para evitar que el analizador cree claves adicionales para las opciones desplegables, ya que el script <code>LanguageSelector</code> las rellena din치micamente en tiempo de ejecuci칩n. Ignorar previene conflictos y mantiene limpios los archivos de traducci칩n.",
  "li_notes_7": "<strong>Fuentes para <code>LanguageSelector</code>:</strong> Para que el idioma seleccionado en el <code>TMP_Dropdown</code> actualice correctamente su fuente, a침ade manualmente un componente <code>LocalizedText</code> vac칤o al objeto <strong>Label</strong> hijo del Dropdown y marca la casilla <code>isStyleOnly</code>.",
  "li_notes_addressables_code": "<strong>C칩digo y Addressables:</strong> Si cambias al modo <strong>Addressables (Async)</strong>, DEBES usar <code>GetLocalizedAssetAsync<T>()</code> en tus scripts. Llamar al s칤ncrono <code>GetLocalizedAsset<T>()</code> devolver치 null y registrar치 una advertencia para evitar bloqueos del hilo principal.",
  "li_content_regex_presets": "<strong>Patrones Regex Ignorados:</strong> Haz clic en <strong>'Add Common Pattern'</strong> para excluir r치pidamente contenido din치mico como *URLs, Emails, Fechas, Precios y UUIDs* de la traducci칩n sin escribir Regex manualmente.",
  "li_notes_addressables_sync_warning": "<strong>S칤ncrono vs As칤ncrono:</strong> Si cambias al modo <strong>Addressables (Async)</strong>, DEBES actualizar tu c칩digo para usar <code>GetLocalizedAssetAsync<T>()</code>. Llamar al m칠todo s칤ncrono devolver치 null y registrar치 una advertencia para evitar congelar el hilo principal.",
  "q_faq_custom_keys_attribute": "쯇uedo usar mi propio atributo para las claves en lugar de [LocalizableField]?",
  "a_faq_custom_keys_attribute": "S칤. En la <strong>Pesta침a Content</strong>, en 'Attributes to Scan', puedes a침adir cualquier nombre de atributo (p. ej., <code>[Header]</code>, <code>[TermsPopup]</code>). El analizador tratar치 cualquier campo de cadena con ese atributo como localizable.",
  "q_faq_tts_voices": "쮺칩mo asigno voces espec칤ficas a los personajes?",
  "a_faq_tts_voices": "En tu <strong>Translation Profile</strong> (Inspector), usa la lista 'Voice Mappings'. Puedes mapear un patr칩n Regex (p. ej., <code>^hero_.*</code>) a un ID de Voz espec칤fico. El generador elegir치 autom치ticamente la voz correcta seg칰n el nombre de la clave.",
  "h1_extending": "Ampliaci칩n de la Funcionalidad",
  "h2_custom_parser": "9.1. Creaci칩n de un Analizador (Parser) Personalizado",
  "p_custom_parser_1": "Puedes ampliar f치cilmente el sistema para admitir componentes personalizados creando tu propia clase de analizador.",
  "li_custom_parser_1": "Crea un nuevo script C# en la carpeta <strong>Editor</strong> de tu proyecto.",
  "li_custom_parser_2": "Copia la plantilla de abajo en 칠l.",
  "li_custom_parser_3": "Modifica la l칩gica para que coincida con tu componente.",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing UnityEngine;\nusing Ankonoanko.Localization;\n\n// PLANTILLA para crear un analizador para un componente personalizado.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings)\n    {\n        // 1. Comprueba si el objeto tiene el componente personalizado que necesitamos.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Salir si no se encuentra el componente\n        }\n        \n        // 2. Obtiene el texto de los campos del componente personalizado.\n        string titleText = component.Title;\n        \n        // 3. Comprueba si el texto es v치lido para la localizaci칩n.\n        if (TextParser.IsValidLocalizableText(titleText))\n        {\n            // 4. Genera la clave y la fuente usando ayudantes de TextParser.\n            string key = TextParser.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode);\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            \n            // 5. Devuelve el resultado.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Repite para otros campos...\n        // (se puede a침adir un sufijo para hacer que las claves sean 칰nicas)\n        string descriptionText = component.Description;\n        if (TextParser.IsValidLocalizableText(descriptionText))\n        {\n            string key = TextParser.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode) + \"_description\";\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "h1_faq": "Preguntas Frecuentes y Soluci칩n de Problemas",
  "h1_migration_tool": "Herramienta de Migraci칩n",
  "p_migration_tool_desc": "Herramienta para la transici칩n desde otros sistemas de localizaci칩n (I2 Localization, Unity Localization).",
  "p_migration_tool_access": "Acceso a trav칠s de <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "h2_migration_tool_features": "Caracter칤sticas",
  "li_migration_tool_setup": "<strong>Paso 0: Configuraci칩n:</strong> Configura los nombres de los componentes (p. ej., <code>Localize</code> para I2) y los campos donde se almacena la clave. Hay preajustes disponibles.",
  "li_migration_tool_import": "<strong>Paso 1: Importaci칩n de Datos:</strong> Importa archivos CSV (I2) o XLIFF (Unity Loc) para crear una base de datos de claves.",
  "li_migration_tool_converter": "<strong>Paso 2: Conversor de Componentes:</strong> Escanea escenas y prefabs. Reemplaza autom치ticamente los componentes antiguos (p. ej., <code>Localize</code>) por <code>LocalizedText</code> / <code>LocalizedAsset</code>, transfiriendo las claves.",
  "li_migration_tool_safemode": "<strong>Modo Seguro y Stubs de Emergencia:</strong> Los componentes se deshabilitan en lugar de eliminarse. Incluye la caracter칤stica cr칤tica <strong>Emergency Stubs</strong> (activada mediante el s칤mbolo de definici칩n ANKO_ENABLE_MIGRATION_STUBS): genera clases de marcador de posici칩n falsas para I2 Localization o Unity Localization para que tu proyecto pueda compilar inmediatamente despu칠s de eliminar esos plugins. Esto evita errores de \"The type name 'Localize' could not be found\" y te da tiempo para refactorizar correctamente tu c칩digo para usar el nuevo sistema. Habilitar Stubs te permite solucionar errores de compilaci칩n despu칠s de eliminar el antiguo plugin de localizaci칩n.",
  "h1_font_glyph_manager": "Gestor de Fuentes y Glifos",
  "p_font_glyph_manager_access": "Acceso a trav칠s de <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "h2_font_glyph_manager_features": "Caracter칤sticas",
  "li_font_glyph_analyze": "Analiza todas las traducciones y comprueba si la fuente asignada (TMP_FontAsset) soporta todos los caracteres utilizados.",
  "li_font_glyph_missing": "Muestra una lista de glifos faltantes.",
  "li_font_glyph_copy": "Permite copiar todos los caracteres 칰nicos del idioma para la generaci칩n del atlas de fuentes.",
  "h1_pseudo_tool": "Herramienta de Pseudo-Localizaci칩n",
  "p_pseudo_tool_desc": "Herramienta para probar dise침os de UI con texto expandido para simular idiomas con texto m치s largo.",
  "p_pseudo_tool_access": "Acceso a trav칠s de <strong>Tools -> Anko Localization Tool -> Pseudo-Localization Generator</strong>.",
  "h2_pseudo_tool_features": "Caracter칤sticas",
  "li_pseudo_tool_setup": "<strong>Pseudo-Localization Generator:</strong> Genera un idioma falso (p. ej., [E-x-p-a-n-d-e-d]) para realizar pruebas de estr칠s en tu dise침o de UI. Soporta la expansi칩n de la longitud del texto por un factor (p. ej., +40%) para simular la expansi칩n del texto alem치n/ruso.",
  "h1_ai_audio": "Audio IA / Texto a Voz",
  "h2_ai_audio_setup": "Configuraci칩n",
  "li_ai_audio_profile": "En <strong>Settings</strong>, selecciona el <strong>Active Audio Profile</strong> (p. ej., OpenAI TTS o ElevenLabs).",
  "h2_ai_audio_usage": "Uso",
  "li_ai_audio_generate": "En <strong>Translation Table Editor</strong>, selecciona filas/celdas -> Clic derecho -> <strong>Generate Audio</strong>.",
  "li_ai_audio_save": "Los archivos se guardan en la carpeta especificada en el perfil.",
  "li_ai_audio_hash": "<strong>Actualizaci칩n Inteligente y Hashing:</strong> La herramienta calcula un hash MD5 de tu contenido de texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus cr칠ditos de API. Detecta si la traducci칩n ha cambiado desde la 칰ltima generaci칩n de audio. El editor resalta estas filas con un icono 'Outdated' (amarillo), lo que te permite actualizar S칍LO las l칤neas modificadas. Esta caracter칤stica de procesamiento por lotes inteligente previene llamadas API innecesarias y reduce costes al regenerar audio. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus cr칠ditos de API.",
  "li_ai_audio_voice_mapping": "<strong>Voice Mapping (Multi-Speaker):</strong> Asigna diferentes voces de IA a diferentes personajes autom치ticamente. En el <strong>Translation Profile</strong>, utiliza la lista 'Voice Mappings' para vincular un patr칩n Regex (p. ej., <code>^hero_.*</code>) a un ID de Voz espec칤fico. La herramienta utilizar치 autom치ticamente la voz correcta seg칰n el nombre de la clave.",
  "h2_example_components_updated": "LanguageSelector.cs Actualizado",
  "p_example_components_updated": "El c칩digo ha cambiado. La carga del idioma (especialmente al usar Addressables) ahora es as칤ncrona.",
  "li_example_components_old": "<strong>Antiguo:</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (s칤ncrono/void).",
  "li_example_components_new": "<strong>Nuevo:</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code> (as칤ncrono/Coroutine).",
  "h2_localizedasset_updated": "LocalizedAsset Carga As칤ncrona",
  "p_localizedasset_updated": "El componente ahora soporta carga as칤ncrona. Ten en cuenta que puede haber un ligero retraso al cambiar de idioma si los activos se cargan desde la nube/disco (Addressables).",
  "h2_faq_installation": "10.1. Instalaci칩n e Inicio R치pido",
  "q_faq_installation_1": "쯈u칠 pasa si mi proyecto ya tiene el paquete com.unity.nuget.newtonsoft-json de otro activo? 쯀ntentar치 el instalador de dependencias actualizarlo o lo ignorar치?",
  "a_faq_installation_1": "El instalador comprueba la existencia del tipo Newtonsoft.Json.JsonConvert. Si el tipo existe, considera que la dependencia est치 satisfecha y no intentar치 instalar ni actualizar el paquete. Esto se hace para evitar conflictos de versiones.",
  "q_faq_installation_2": "Accidentalmente hice clic en \"Skip for Now\" y marqu칠 \"Don't ask again\" para dependencias opcionales (p. ej., para soporte CSV). 쮺칩mo puedo volver a abrir la ventana del instalador para instalarlas?",
  "a_faq_installation_2": "Puedes activar manualmente una comprobaci칩n de dependencias en cualquier momento a trav칠s del men칰 Tools -> Localization -> Check Dependencies. Esto restablecer치 la bandera \"Don't ask again\" y mostrar치 la ventana con todos los paquetes opcionales faltantes de nuevo.",
  "q_faq_installation_3": "La herramienta no cre칩 LocalizationSettings.asset en Assets/Resources. 쯇or qu칠 pudo haber sucedido esto y puedo crearlo manualmente a trav칠s del men칰 Assets -> Create?",
  "a_faq_installation_3": "Esto puede suceder si no tienes una carpeta Assets/Resources. La herramienta intentar치 crearla, pero los permisos del sistema de archivos podr칤an impedirlo. S칤, puedes crear el activo manualmente: haz clic derecho en la carpeta Resources, selecciona Create -> Localization -> Settings. La herramienta lo encontrar치 autom치ticamente.",
  "q_faq_installation_4": "쯇uedo mover el archivo LocalizationSettings.asset a otra carpeta Resources, por ejemplo, Assets/MyGame/Resources? 쯃a herramienta seguir치 encontr치ndolo?",
  "a_faq_installation_4": "S칤. La herramienta utiliza Resources.Load(), que busca un activo por nombre en todas las carpetas llamadas Resources en tu proyecto. Lo importante es que el archivo mantenga su nombre LocalizationSettings.asset.",
  "q_faq_installation_5": "El instalador de dependencias se congel칩 o dio un error. 쯇uedo instalar las dependencias (Newtonsoft Json, Editor Coroutines) manualmente a trav칠s del Administrador de Paquetes de Unity?",
  "a_faq_installation_5": "S칤. Puedes abrir Window -> Package Manager, hacer clic en el icono \"+\" y seleccionar \"Add package by name...\". Introduce los nombres de los paquetes: com.unity.nuget.newtonsoft-json y com.unity.editorcoroutines.",
  "h2_faq_components": "10.2. Componentes Principales",
  "q_faq_components_1": "El componente LocalizedPrefab deshabilita MonoBehaviours en el objeto original. 쯈u칠 pasa si el objeto original tiene un script que crea otros objetos o se suscribe a eventos en Awake()? 쯉e ejecutar치 este c칩digo?",
  "a_faq_components_1": "No, no se ejecutar치. Deshabilitar un MonoBehaviour evita que se llamen todos los m칠todos \"m치gicos\" de Unity, incluidos Awake(), OnEnable() y Start(). Esto es intencional para evitar la ejecuci칩n de l칩gica duplicada. Toda la inicializaci칩n debe ocurrir en scripts en las versiones localizadas del prefab.",
  "q_faq_components_2": "Si el prefab original (LocalizedPrefab) tiene un Rigidbody u otro componente de f칤sica, 쯥e deshabilitar치? 쮸fectar치 esto a la f칤sica si el prefab localizado no lo tiene?",
  "a_faq_components_2": "S칤, el comportamiento f칤sico del objeto original ser치 neutralizado. El componente LocalizedPrefab encuentra todos los componentes Rigidbody y Rigidbody2D en su GameObject y establece su propiedad isKinematic en true. Esto los elimina efectivamente de los c치lculos de f칤sica din치mica, evitando comportamientos no deseados como que un objeto invisible caiga o reaccione a colisiones. Todav칤a se recomienda que la versi칩n localizada del prefab contenga todos los componentes de f칤sica necesarios para un comportamiento correcto.",
  "q_faq_components_3": "El componente LocalizedAsset almacena el nombre del componente de destino como una cadena (_targetComponentTypeName). 쯈u칠 pasa si cambio el nombre de un script de componente personalizado o lo muevo a otro ensamblado (Assembly Definition)? 쮻ejar치 de funcionar LocalizedAsset para 칠l?",
  "a_faq_components_3": "S칤, dejar치 de funcionar. El componente almacena el nombre de tipo completo, incluido el espacio de nombres y el ensamblado. Cambiar el nombre del script o moverlo a otro .asmdef cambiar치 este nombre, y LocalizedAsset no podr치 encontrar el componente de destino. Tendr치s que ejecutar otro an치lisis a trav칠s de Analyze Project & Attach Components para que actualice el nombre.",
  "q_faq_components_4": "Si hay dos componentes Image en el mismo GameObject, 쯖칩mo sabe LocalizedAsset cu치l localizar? 쮽uncionar치 con ambos o solo con el primero que encuentre?",
  "a_faq_components_4": "Se crea un LocalizedAsset para una instancia de componente espec칤fica. Contiene una referencia a ese componente en el c칩digo. Si a침ades manualmente un segundo LocalizedAsset y utilizas el men칰 contextual \"Analyze for Localization\" para apuntar al segundo Image, tendr치s dos componentes LocalizedAsset, cada uno gestionando su propio Image. El analizador autom치tico solo crear치 un componente para el primer Image con un activo localizable que encuentre.",
  "q_faq_components_5": "La documentaci칩n establece que LocalizedPrefab tiene un orden de ejecuci칩n de -100. 쯈u칠 pasa si tengo otro script con un orden de ejecuci칩n de -110 que intenta encontrar un objeto hijo creado por LocalizedPrefab en su Awake()? 쯃ocalizedPrefab habr치 instanciado su instancia a tiempo?",
  "a_faq_components_5": "S칤, lo har치. LocalizedPrefab crea la instancia del prefab localizado en su m칠todo OnEnable(). El orden de ejecuci칩n de Unity garantiza que todos los m칠todos Awake() se ejecuten antes que todos los m칠todos OnEnable(). Por lo tanto, tu script con orden -110 ejecutar치 su Awake(), luego LocalizedPrefab con orden -100 ejecutar치 su Awake(), y solo despu칠s de eso se llamar치n a sus m칠todos OnEnable() en orden. Tu script no encontrar치 el objeto porque a칰n no se habr치 creado.",
  "q_faq_components_6": "El componente LocalizedText tiene una opci칩n isStyleOnly. Si la habilito y luego llamo a myLocalizedText.SetFormattedText(\"new_key\") en el c칩digo, 쯖ambiar치 el texto o solo el estilo (fuente/RTL)?",
  "a_faq_components_6": "Tanto la clave como el texto cambiar치n. Llamar a SetFormattedText program치ticamente anula el comportamiento de isStyleOnly para esa actualizaci칩n espec칤fica. La opci칩n isStyleOnly est치 destinada a evitar que el componente reaccione a los cambios de idioma globales, pero siempre reaccionar치 a un cambio directo de clave a trav칠s del c칩digo.",
  "q_faq_components_7": "LocalizedBehaviour encuentra autom치ticamente m칠todos con el atributo [OnLanguageChange]. 쮼ncontrar치 m칠todos privados y protegidos, o deben ser p칰blicos?",
  "a_faq_components_7": "Encontrar치 m칠todos con cualquier modificador de acceso (public, private, protected, internal). La reflexi칩n en Unity permite el descubrimiento de todos los m칠todos de instancia, independientemente de su nivel de acceso.",
  "q_faq_components_8": "El componente LocalizedAsset intercepta Play on Awake. 쯈u칠 pasa si otro script en el mismo objeto intenta acceder al activo (p. ej., audioSource.clip.length) en Awake() o Start() antes de que LocalizedAsset lo haya intercambiado? 쮼s posible una NullReferenceException o el uso del activo antiguo?",
  "a_faq_components_8": "Es posible el uso del activo antiguo (no localizado). LocalizedAsset realiza el intercambio en su OnEnable(). Los m칠todos Awake() de todos los scripts se ejecutan antes que OnEnable(). Si tu script accede a audioSource.clip en Awake(), obtendr치 el clip original. Si accede a 칠l en Start(), el resultado depender치 del orden de ejecuci칩n del script. Para garantizar el acceso al activo localizado, establece un orden de ejecuci칩n posterior para tu script o accede al activo en un m칠todo marcado con [OnLanguageChange].",
  "h2_faq_window": "10.3. Ventana \"Localization Tool\"",
  "h3_faq_window_preview": "Vista Previa en el Editor",
  "q_faq_window_preview_1": "Abr칤 un prefab en Modo Prefab, apliqu칠 la Vista Previa en el Editor y presion칠 Ctrl+S. 쯉e guardar치n los datos temporales de la vista previa en el activo del prefab? 쮺칩mo maneja LocalizationPreviewProtector este caso?",
  "a_faq_window_preview_1": "No, no se guardar치. LocalizationPreviewProtector intercepta el evento de guardado de activos (OnWillSaveAssets) y llama autom치ticamente a RevertEditorPreview() antes de que Unity escriba los cambios en el disco. Por lo tanto, el prefab se guardar치 en su estado original, no localizado.",
  "q_faq_window_preview_2": "Si habilito la Vista Previa en el Editor y el editor de Unity falla, y el archivo Temp/localization_preview_recovery.json se corrompe (p. ej., JSON vac칤o o inv치lido), 쯤u칠 suceder치 en el pr칩ximo lanzamiento?",
  "a_faq_window_preview_2": "PreviewCrashProtector est치 envuelto en un bloque try-catch. Si la deserializaci칩n de JSON falla, se registrar치 un error en la consola sobre la incapacidad de recuperarse, y el proceso terminar치 silenciosamente. Tu escena permanecer치 en el estado \"roto\" en el que estaba en el momento del fallo. En este caso, deber치s seleccionar manualmente \"Revert to Original\" en la ventana de la herramienta para forzar una reversi칩n de los cambios.",
  "q_faq_window_preview_3": "En el modo de Vista Previa en el Editor para LocalizedPrefab, se crea una instancia temporal. 쯉e ejecutar치n los m칠todos Awake() y Start() en esta instancia? 쯇odr칤a esto causar errores si no est치n dise침ados para ejecutarse en Modo Edici칩n?",
  "a_faq_window_preview_3": "S칤, lo har치n. PrefabUtility.InstantiatePrefab en Modo Edici칩n llama a Awake() y OnEnable(). Si estos m칠todos contienen l칩gica que no deber칤a ejecutarse en el editor (p. ej., acceder a singletons que solo existen en Modo Reproducci칩n), podr칤a causar errores. Se recomienda usar if (Application.isPlaying) o #if UNITY_EDITOR para proteger dicho c칩digo.",
  "h3_faq_window_settings": "Pesta침a \"Settings\" (Configuraci칩n)",
  "q_faq_window_settings_1": "Puedo cambiar el Modo de Generaci칩n de Claves de UseTextAsKey a AutoGenerateKeysOnly a mitad del proyecto. 쯈u칠 suceder치 exactamente con mis traducciones existentes? 쯉e mapear치n a las nuevas claves?",
  "a_faq_window_settings_1": "S칤, lo har치n. Al cambiar el modo, la herramienta realiza una \"migraci칩n segura\": vuelve a analizar todo el proyecto, crea nuevas claves de acuerdo con las nuevas reglas, pero mapea las claves antiguas y nuevas a trav칠s del texto original. Luego transfiere todas tus traducciones y comentarios existentes de las claves antiguas a las nuevas. Tus traducciones no se perder치n.",
  "q_faq_window_settings_2": "Si a침ado un idioma con un c칩digo que no tiene reglas de pluralizaci칩n (p. ej., \"kz\" para kazajo) a la lista de Supported Languages, 쯤u칠 regla se utilizar치 por defecto?",
  "a_faq_window_settings_2": "Se utilizar치 la DefaultPluralRule, que es adecuada para el ingl칠s y la mayor칤a de los idiomas europeos (formas para \"one\" y \"other\").",
  "q_faq_window_settings_3": "쯈u칠 pasa si especifico el Translations Path no en StreamingAssets, sino en una carpeta normal como Assets/MyTranslations? 쯉e incluir치n los archivos json en la build del juego?",
  "a_faq_window_settings_3": "No, no se incluir치n. Solo los activos ubicados en una carpeta StreamingAssets o Resources est치n garantizados de ser incluidos en la build. Si especificas una ruta diferente, la localizaci칩n funcionar치 en el editor, pero no funcionar치 en el juego compilado, ya que los archivos de traducci칩n no ser치n parte de la build.",
  "q_faq_window_settings_4": "La clave API de traducci칩n autom치tica se almacena en EditorPrefs. Si estoy trabajando en el proyecto en dos computadoras diferentes, 쯡ecesito ingresar la clave en cada m치quina por separado?",
  "a_faq_window_settings_4": "S칤. EditorPrefs es almacenamiento local para cada computadora. Tendr치s que ingresar la clave API en cada m치quina desde la que planees usar la funci칩n de traducci칩n autom치tica.",
  "h3_faq_window_content": "Pesta침a \"Content\" (Contenido)",
  "q_faq_window_content_1": "쯈u칠 pasa si a침ado una escena a Scenes to Parse que no est치 incluida en la Configuraci칩n de Build? 쮸fectar치 esto a algo m치s que el proceso de an치lisis en s칤?",
  "a_faq_window_content_1": "No, no lo har치. La lista Scenes to Parse se utiliza exclusivamente para que la herramienta sepa qu칠 escenas abrir y analizar en busca de texto. De ninguna manera est치 relacionada con las escenas que terminar치n en la build final de tu juego.",
  "q_faq_window_content_2": "A침ad칤 un objeto a Ignore Specific Objects (la lista temporal). Si creo un prefab a partir de este objeto, 쯦ambi칠n se ignorar치 la instancia de este prefab?",
  "a_faq_window_content_2": "No, no lo har치. La lista temporal almacena una referencia directa al objeto en la escena. Cuando creas un prefab, es un nuevo activo. Sus instancias son objetos diferentes, y la regla de ignorar no se aplicar치 a ellas. Para ignorar prefabs permanentemente, deben a침adirse a la lista de ignorados como un activo de prefab.",
  "q_faq_window_content_3": "Si a침ado el componente TMPro.TMP_Text a Parsing Ignores -> Ignore Component Types, pero hay un objeto en la escena con un LocalizedText que ya hace referencia a este TMP_Text, 쯤u칠 suceder치 en el pr칩ximo Update Keys? 쯉e eliminar치 la clave?",
  "a_faq_window_content_3": "S칤, se eliminar치. Cuando haces clic en Update Keys, el analizador vuelve a escanear todo el proyecto. Ver치 que el tipo TMPro.TMP_Text debe ignorarse y no generar치 una clave para 칠l. Durante el proceso de comparaci칩n de claves antiguas y nuevas, determinar치 que la clave antigua ya no se utiliza y la marcar치 como \"Removed\".",
  "q_faq_window_content_4": "La documentaci칩n dice que \"Pin\" guarda la ruta completa al objeto y se romper치 si se le cambia el nombre. 쯈u칠 pasa si hago un prefab del objeto y luego cambio el nombre del objeto original? 쯒"Pin\" seguir치 funcionando para las instancias del prefab?",
  "a_faq_window_content_4": "No, no lo har치. \"Pin\" guarda la ruta absoluta en la jerarqu칤a de la escena en el momento en que se hace clic en el bot칩n (p. ej., Canvas/Panel/Button). Esta ruta no est치 relacionada con la l칩gica del prefab. Las instancias del prefab tendr치n la misma ruta, pero si cambias el nombre del objeto padre en la escena, \"Pin\" dejar치 de funcionar tanto para el original como para las instancias.",
  "q_faq_window_content_5": "Si uso \"Pin\" para un objeto hijo dentro de una instancia de prefab, 쯤u칠 ruta se guardar치: relativa a la ra칤z del prefab o a la ra칤z de la escena? 쮽uncionar치 en otras escenas?",
  "a_faq_window_content_5": "Se guardar치 la ruta completa desde la ra칤z de la escena. Por ejemplo, MyPrefab(Clone)/Content/Icon. Esta ruta \"anclada\" solo funcionar치 en la escena donde la creaste. En otras escenas, es poco probable que se encuentre una ruta as칤.",
  "h3_faq_window_actions": "Pesta침a \"Actions\" (Acciones)",
  "h3_faq_window_assets": "Pesta침a \"Assets\" (Activos)",
  "h3_faq_window_report": "Pesta침a \"Report\" (Informe)",
  "h2_faq_editor": "10.4. Editor de Traducci칩n",
  "h2_faq_examples": "10.5. Ejemplos de Uso y C칩digo",
  "h2_faq_notes": "10.6. Matices y Advertencias Importantes",
  "h2_faq_extending": "10.7. Ampliaci칩n de la Funcionalidad",
  "q_faq_window_actions_1": "쯈u칠 pasa si se pierde la conexi칩n a Internet durante una traducci칩n autom치tica por lotes? 쯀ntentar치 la herramienta reintentar el lote fallido seg칰n la Pol칤tica de Reintento, o se interrumpir치 el proceso por completo?",
  "a_faq_window_actions_1": "La herramienta intentar치 reenviar el lote exacto que fall칩, de acuerdo con la configuraci칩n de la Pol칤tica de Reintento (n칰mero de intentos y retraso). Si fallan todos los intentos para este lote, el proceso de traducci칩n para el idioma actual se interrumpir치 y se registrar치 un error en la consola. La traducci칩n para los siguientes idiomas en la cola no comenzar치.",
  "q_faq_window_actions_2": "Si importo un archivo CSV que contiene claves que ya existen en el proyecto pero con valores vac칤os para algunos idiomas, 쯘stos valores vac칤os reemplazar치n mis traducciones existentes o se ignorar치n?",
  "a_faq_window_actions_2": "Los valores vac칤os reemplazar치n las traducciones existentes. El proceso de importaci칩n considera el archivo CSV como la \"fuente de la verdad\". Si el valor para la clave welcome_message en la columna ru est치 vac칤o, la traducci칩n rusa actual para esta clave se sobrescribir치.",
  "q_faq_window_actions_3": "La secci칩n \"Danger Zone\" permite eliminar todos los componentes. 쮼liminar치 componentes de prefabs que se encuentran en carpetas no especificadas en Prefab Folders en la pesta침a Content?",
  "a_faq_window_actions_3": "S칤, lo har치. Las funciones en la \"Danger Zone\" escanean todos los prefabs en el proyecto (AssetDatabase.FindAssets(\"t:Prefab\")), no solo los especificados en la lista de an치lisis, para garantizar la limpieza m치s completa posible.",
  "q_faq_window_actions_4": "Al importar desde Google Sheets, 쯖칩mo debo formatear la columna de comentarios para que funcione la validaci칩n de marcadores de posici칩n usando la directiva @placeholders:?",
  "a_faq_window_actions_4": "En tu documento de Google Sheets, la columna debe titularse \"Developer Notes\". En las celdas de esta columna, puedes escribir comentarios como de costumbre. Para especificar marcadores de posici칩n, simplemente a침ade una l칤nea como @placeholders: {username}, {score} en el texto del comentario. La herramienta reconocer치 autom치ticamente esta directiva al importar.",
  "q_faq_window_actions_5": "쯇uede la herramienta importar datos de varias hojas de un solo documento de Google Sheets, o solo funciona con una hoja por GID?",
  "a_faq_window_actions_5": "La herramienta solo funciona con una hoja a la vez. La URL de importaci칩n incluye un par치metro gid=..., que identifica de forma 칰nica una hoja espec칤fica en el documento. Para importar datos de otra hoja, debes copiar su URL (con un GID diferente) y realizar la importaci칩n de nuevo.",
  "q_faq_window_assets_1": "쯈u칠 pasa si tengo dos activos con la misma clave pero diferentes tipos en la misma carpeta de escaneo (p. ej., sound_effect_en.mp3 y sound_effect_en.wav)? 쮺u치l terminar치 en la tabla de activos?",
  "a_faq_window_assets_1": "El esc치ner de activos los carga especificando el tipo esperado (AssetDatabase.LoadAssetAtPath(path, expectedType)). Para la categor칤a AudioClip, solo buscar치 y cargar치 archivos que Unity reconozca como AudioClips. Si ambos archivos son clips de audio v치lidos, el que se procese al final se incluir치 en la tabla, sobrescribiendo efectivamente el anterior. Se recomienda evitar tales duplicados.",
  "q_faq_window_assets_2": "Si hago clic en Scan Assets & Analyze Project, y hay un objeto Image en la escena para el que ya existe un sprite localizado, pero el objeto Image en s칤 a칰n no tiene un componente LocalizedAsset, 쯟a herramienta a침adir치 el componente e insertar치 autom치ticamente la clave?",
  "a_faq_window_assets_2": "S칤, as칤 es exactamente como funciona. \"Analyze Project\" encuentra el componente Image, mira el nombre del sprite asignado a 칠l (p. ej., icon_play_es), extrae la clave (icon_play) y el idioma (es) de 칠l, y luego a침ade un componente LocalizedAsset a ese GameObject y escribe la clave icon_play en 칠l.",
  "q_faq_window_assets_3": "쯇uedo usar la misma Naming Rule para diferentes categor칤as de activos si tienen diferentes Scan Folders? 쮼sto causar치 conflictos?",
  "a_faq_window_assets_3": "S칤, puedes. No habr치 conflictos, ya que se crea una tabla de activos separada (LocalizedAssetTable) para cada categor칤a. Las claves de la categor칤a \"Sprites\" no se superponen con las claves de la categor칤a \"AudioClips\", incluso si se llaman igual.",
  "q_faq_window_assets_4": "Si un activo localizable (p. ej., button_ok_es.png) no est치 en la ra칤z de la Scan Folder, sino en una subcarpeta, 쯟o encontrar치 el esc치ner?",
  "a_faq_window_assets_4": "S칤, lo har치. El esc치ner utiliza la opci칩n SearchOption.AllDirectories, lo que significa que comprobar치 recursivamente todas las subcarpetas dentro de la Scan Folder que especifiques.",
  "q_faq_window_report_1": "El bot칩n \"Find\" busca el objeto de forma as칤ncrona. 쯈u칠 pasa si inicio una b칰squeda e inmediatamente hago clic en Update Keys? 쯉e interrumpir치 la b칰squeda?",
  "a_faq_window_report_1": "S칤, se interrumpir치. Cualquier nueva acci칩n que requiera el bloqueo de la UI (como Update Keys) detendr치 la corrutina de b칰squeda actual. Aparecer치 un cuadro de di치logo, pidi칠ndote que detengas la b칰squeda actual para comenzar una nueva.",
  "q_faq_window_report_2": "Si una clave se usa en varios lugares (p. ej., en dos botones diferentes en diferentes escenas), 쯖칩mo se mostrar치 esto en el informe bajo la categor칤a \"Duplicates\"?",
  "a_faq_window_report_2": "La categor칤a \"Duplicates\" mostrar치 todas las fuentes para esa clave. Ver치s una entrada para la clave, y el campo \"Source\" enumerar치 todas las rutas (en la escena 1 y la escena 2). El bot칩n \"Find\" en este caso abrir치 una lista desplegable, lo que te permitir치 elegir a qu칠 objeto navegar.",
  "q_faq_window_report_3": "Si hago clic en \"Find\" para una clave que solo se usa en c칩digo (a trav칠s de la funci칩n _()), 쯤u칠 suceder치? 쯇odr치 la herramienta encontrar y resaltar el script C#?",
  "a_faq_window_report_3": "S칤. El sistema de b칰squeda est치 espec칤ficamente entrenado para reconocer fuentes como script MyScript.cs. Cuando haces clic en \"Find\", buscar치 el activo MyScript.cs en el proyecto y lo resaltar치 (ping) en la ventana Project.",
  "q_faq_editor_1": "쯈u칠 tiene mayor prioridad para la validaci칩n de marcadores de posici칩n: la directiva @placeholders: en el comentario o los marcadores de posici칩n encontrados en el texto del idioma de origen? Por ejemplo, si el texto de origen tiene {name} y el comentario dice @placeholders: {username}.",
  "a_faq_editor_1": "La directiva @placeholders: en el comentario tiene prioridad. Se considera una instrucci칩n expl칤cita del desarrollador y la \"fuente de la verdad\". En tu ejemplo, el editor requerir치 {username} en la traducci칩n e ignorar치 {name} del texto de origen.",
  "q_faq_editor_2": "Si cometo un error tipogr치fico en la directiva (p. ej., @placeholder: en lugar de @placeholders:), 쯥e ignorar치 o la herramienta emitir치 una advertencia?",
  "a_faq_editor_2": "Simplemente se ignorar치. La herramienta busca una coincidencia exacta de @placeholders:. Si la directiva est치 mal escrita, se tratar치 como parte de un comentario regular, y la validaci칩n funcionar치 de la manera antigua, bas치ndose en los marcadores de posici칩n del texto de origen.",
  "q_faq_editor_3": "El sistema de autoguardado crea archivos en la carpeta Backups/AutoSaves. 쯉e eliminar치n autom치ticamente estos archivos despu칠s de un guardado manual exitoso o al cerrar la ventana?",
  "a_faq_editor_3": "S칤. Tras un guardado manual exitoso o un cierre normal de la ventana (cuando guardas los cambios), todos los archivos de autoguardado se eliminan para evitar solicitar la recuperaci칩n en el pr칩ximo lanzamiento. Solo permanecen en caso de un fallo del editor.",
  "q_faq_editor_4": "Si cambio los anchos de columna en el editor, 쯥e guardar치n estos ajustes entre sesiones de Unity?",
  "a_faq_editor_4": "S칤. Los anchos de columna se guardan en EditorPrefs cada vez que cierras la ventana del editor de traducci칩n y se restaurar치n la pr칩xima vez que la abras.",
  "q_faq_editor_5": "쯃a ventana emergente de edici칩n de texto (MultiLineEditWindow) admite su propia pila Deshacer/Rehacer (a trav칠s de Ctrl+Z) para los cambios realizados dentro de ella?",
  "a_faq_editor_5": "S칤. MultiLineEditWindow tiene su propia pila temporal Deshacer/Rehacer que funciona mientras la ventana est치 abierta. Esto te permite deshacer y rehacer cambios de texto dentro de esa ventana. Una vez que guardas el resultado (al cerrar la ventana), este cambio se registra como una sola acci칩n en la pila global Deshacer/Rehacer del editor principal.",
  "q_faq_examples_1": "쯈u칠 sucede si los nombres de las propiedades en el tipo an칩nimo pasado a la funci칩n _() no coinciden con los marcadores de posici칩n en la cadena? Por ejemplo, _(\"Hello, {username}\", new { user_name = \"Bob\" }). 쮿abr치 un error o simplemente no se reemplazar치 el marcador de posici칩n?",
  "a_faq_examples_1": "No habr치 un error. El marcador de posici칩n {username} simplemente no se reemplazar치, y obtendr치s la cadena \"Hello, {username}\" como resultado. El reemplazo solo ocurre con una coincidencia de nombre exacta.",
  "q_faq_examples_2": "El atributo [LocalizableField] funciona para campos privados. 쮽uncionar치 para campos est치ticos?",
  "a_faq_examples_2": "S칤, lo har치. El analizador utiliza reflexi칩n para encontrar campos con las banderas BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static, por lo que encontrar치 y procesar치 campos est치ticos.",
  "q_faq_examples_3": "Si pongo el atributo [OnLanguageChange] en un m칠todo con par치metros (p. ej., void UpdateUI(string newLang)), 쯤u칠 suceder치? 쮿abr치 un error de compilaci칩n o una advertencia en tiempo de ejecuci칩n?",
  "a_faq_examples_3": "No habr치 un error de compilaci칩n, pero aparecer치 una advertencia de LocalizedBehaviour en la consola de Unity en tiempo de ejecuci칩n. Informar치 que encontr칩 un m칠todo con el atributo pero lo ignor칩 porque el m칠todo tiene par치metros. Un m칠todo as칤 no se llamar치.",
  "q_faq_examples_4": "Estoy usando _(\"apple_count\", count). Si no hay clave apple_count_one para el idioma actual (para count = 1), 쯤u칠 forma elegir치 el sistema? 쯋sar치 apple_count_other como reserva?",
  "a_faq_examples_4": "S칤. Si no se encuentra una forma espec칤fica (_one, _few, etc.), el sistema intentar치 usar la clave con el sufijo _other como reserva. Si eso tampoco se encuentra, se utilizar치 la traducci칩n para la clave base apple_count.",
  "q_faq_examples_5": "La funci칩n _(\"key\", new { username = \"Alex\" }) utiliza un tipo an칩nimo. 쮼sto no crear치 una \"carga\" excesiva en el recolector de basura (GC) con llamadas frecuentes en un m칠todo Update() en comparaci칩n con pasar un Dictionary<string, object> pre-creado?",
  "a_faq_examples_5": "S칤, lo har치. Cada llamada a new { ... } asigna memoria en el mont칩n administrado, lo que crea trabajo adicional para el recolector de basura. Para texto que se actualiza en cada frame (en Update o LateUpdate), es significativamente m치s eficiente crear un Dictionary<string, object> una vez en Start(), y solo actualizar sus valores en Update() antes de pasarlo a la funci칩n _().",
  "q_faq_examples_6": "Mi m칠todo marcado con [OnLanguageChange] no se est치 llamando. 쯇or qu칠?",
  "a_faq_examples_6": "Comprueba si tu m칠todo tiene par치metros. El atributo <code>[OnLanguageChange]</code> solo funciona en m칠todos <strong>sin par치metros</strong> (p. ej., <code>void UpdateUI()</code>). Si tu m칠todo requiere argumentos, envu칠lvelo en un m칠todo sin par치metros.",
  "q_faq_notes_1": "La documentaci칩n recomienda a침adir LanguageSelector a la lista de ignorados. 쯈u칠 se romper치 exactamente si me olvido de hacerlo? 쯉e crear치n claves adicionales para \"Option A, Option B\"?",
  "a_faq_notes_1": "S칤. Si no a침ades LanguageSelector a la lista de ignorados, el analizador tratar치 su TMP_Dropdown como un desplegable regular. Encontrar치 las opciones predeterminadas \"Option A, Option B, Option C\" que crea Unity y a침adir치 claves para ellas a tus archivos de traducci칩n. Esto saturar치 tus archivos con claves innecesarias, ya que LanguageSelector eliminar치 estas opciones en tiempo de ejecuci칩n y crear치 las suyas de todos modos.",
  "q_faq_notes_2": "Si me olvido de a침adir un LocalizedText vac칤o con la casilla isStyleOnly habilitada en el Label dentro del TMP_Dropdown utilizado por LanguageSelector, 쯟a fuente no cambiar치? 쯇or qu칠 es necesario esto?",
  "a_faq_notes_2": "S칤, la fuente no cambiar치. Esto es necesario porque LanguageSelector cambia directamente la propiedad label.text. Sin un LocalizedText en este objeto, el sistema de localizaci칩n no sabe que este elemento necesita que se le apliquen estilos (fuente, RTL) cuando el idioma cambia. Un LocalizedText vac칤o con isStyleOnly sirve como un \"marcador\" para el sistema, diciendo: \"Observa este objeto y apl칤cale estilos, pero no toques su texto\".",
  "q_faq_notes_3": "No se recomienda llamar a _() en el m칠todo Update(). Pero, 쯤u칠 pasa si necesito actualizar el texto en cada frame (p. ej., un temporizador)? 쮺u치l es la forma m치s eficiente de hacerlo, almacenando en cach칠 solo la cadena de formato?",
  "a_faq_notes_3": "El enfoque m치s eficiente es almacenar en cach칠 la cadena de formato en Start() o en un m칠todo [OnLanguageChange], y usar string.Format regular en Update(). Ejemplo: private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } Esto evita buscar la clave en el diccionario en cada frame, lo cual es significativamente m치s r치pido.",
  "q_faq_extending_1": "쯉e llamar치 autom치ticamente a mi analizador personalizado despu칠s de cada Update Keys? 쯅ecesito registrarlo en alg칰n lugar, o basta con tener una clase que implemente ITextComponentParser en el proyecto?",
  "a_faq_extending_1": "Solo tener la clase es suficiente. Cuando se ejecuta TextParser, utiliza reflexi칩n para encontrar todas las clases en el proyecto que implementan la interfaz ITextComponentParser y llama autom치ticamente a su m칠todo Parse() para cada GameObject. No se requiere registro manual.",
  "q_faq_extending_2": "쯈u칠 pasa si ocurre una excepci칩n en mi analizador personalizado? 쯀nterrumpir치 todo el proceso de an치lisis o continuar치 la herramienta de forma segura con otros analizadores?",
  "h2_faq_addressables": "Addressables y Migraci칩n",
  "q_faq_addressables_1": "Habilit칠 el modo Addressables, pero los activos no se cargan. 쯈u칠 debo comprobar?",
  "a_faq_addressables_1": "Aseg칰rate de que el paquete Addressables est칠 instalado, la configuraci칩n creada y de que hiciste clic en \"Scan Assets & Generate Tables\" para registrar claves en grupos.",
  "q_faq_addressables_2": "쮺칩mo a침ado soporte para DeepL/Google?",
  "a_faq_addressables_2": "Crea un <code>Translation Profile</code> en la carpeta de activos, selecciona el tipo de servicio, introduce la clave API y asigna este perfil en la ventana <code>Settings</code>.",
  "q_faq_addressables_3": "El migrador muestra errores de compilaci칩n despu칠s de eliminar I2/UnityLoc. 쮺칩mo puedo solucionar esto?",
  "a_faq_addressables_3": "En la ventana de Migraci칩n (Pesta침a 0), hay un bot칩n \"Enable Stubs\" que activa la funci칩n Emergency Stubs. Esto crea clases de marcador de posici칩n falsas para I2 Localization o Unity Localization para que tu proyecto pueda compilar inmediatamente despu칠s de eliminar esos plugins. La funci칩n funciona alternando el s칤mbolo de definici칩n ANKO_ENABLE_MIGRATION_STUBS. Esto evita errores de \"The type name 'Localize' could not be found\" y te da tiempo para refactorizar correctamente tu c칩digo para usar el nuevo sistema. Habilitar Stubs te permite solucionar errores de compilaci칩n despu칠s de eliminar el antiguo plugin de localizaci칩n.",
  "a_faq_extending_2": "Una excepci칩n en tu analizador personalizado interrumpir치 el proceso. El bucle de an치lisis principal no envuelve las llamadas a analizadores personalizados en un bloque try-catch. Si tu m칠todo Parse() lanza una excepci칩n no controlada,",
  "h2_faq_audio": "Audio IA / Texto a Voz",
  "q_faq_audio_smart_update": "쮺칩mo ahorra la herramienta cr칠ditos de API al regenerar archivos de audio?",
  "a_faq_audio_smart_update": "La herramienta utiliza procesamiento por lotes inteligente con hashing MD5 para solo regenerar archivos de audio cuando el texto de origen ha cambiado. Calcula un hash MD5 de tu contenido de texto y lo compara con archivos de audio generados previamente. Si el texto no ha cambiado, omite la regeneraci칩n, ahorrando tus cr칠ditos de API. Esto previene llamadas API innecesarias y reduce costes al regenerar audio. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus cr칠ditos de API.",
  "toggle_notes_title": "Alternar Notas",
  "mindmap_toggle_title": "Mostrar Mapa Mental",
  "on_this_page_title": "En Esta P치gina",
  "my_notes_title": "Mis Notas",
  "no_notes_message_new": "Pasa el rat칩n sobre el texto para a침adir una nota.",
  "notes_add_title": "A침adir una nota a este bloque",
  "notes_placeholder": "Tu nota...",
  "notes_close_title": "Cerrar",
  "notes_goto_title": "Ir al texto",
  "notes_edit_title": "Editar nota",
  "notes_delete_title": "Eliminar nota",
  "notes_edit_text": "Editar",
  "copy_code_copy": "Copiar",
  "copy_code_copied": "춰Copiado!",
  "copy_code_error": "Error",
  "error_loading_title": "Error de Carga",
  "error_loading_message": "Por favor, comprueba tu conexi칩n y actualiza.",
  "lightbox_aria_close": "Cerrar visor de im치genes",
  "lightbox_image_alt": "Vista ampliada",
  "mindmap_preset_full": "Vista Completa",
  "mindmap_preset_quick_start": "Inicio R치pido",
  "mindmap_preset_dev": "Flujo de Trabajo del Desarrollador",
  "mindmap_preset_translator": "Flujo de Trabajo del Traductor",
  "mindmap_edge_configure": "1. Configurar",
  "mindmap_edge_specify_content": "2. Especificar Contenido",
  "mindmap_edge_parse_project": "3. Analizar Proyecto",
  "mindmap_edge_creates_components": "Crea Componentes",
  "mindmap_edge_generates": "Genera",
  "mindmap_edge_opens": "Abre",
  "mindmap_edge_manages_assets": "Gestiona activos para",
  "mindmap_edge_defines_rules": "Define reglas para",
  "mindmap_edge_reports_on": "Informa sobre",
  "mindmap_edge_enables_reaction": "Habilita la reacci칩n a trav칠s de",
  "mindmap_edge_processed_by": "Procesado por",
  "mindmap_edge_edited_in": "Editado en",
  "mindmap_edge_extends": "Ampl칤a",
  "mindmap_edge_warns_about": "Advierte sobre",
  "mindmap_edge_relates_to": "Se relaciona con",
  "mindmap_edge_recommends_for": "Recomienda para",
  "mindmap_edge_see_faq": "Ver FAQ",
  "li_attr_feat_5": "<strong>Cadenas formateadas:</strong> Soporta cadenas interpoladas (<code>$\"Text {0}\"</code>) y cadenas literales (<code>@\"Text\"</code>). El analizador extrae el patr칩n de formato sin procesar.",
  "li_cheat_unattached": "<strong>Scripts no adjuntos:</strong> Los scripts deben estar en un GameObject en una Escena o Prefab",
  "li_cheat_base_private": "<strong>Campos privados base:</strong> Campos <code>private</code> en una Clase Padre (Limitaci칩n de herencia)",
  "li_attr_feat_1": "<strong>Colecciones:</strong> Soporta <code>List&lt;string&gt;</code> y <code>string[]</code>. Las claves se generan con sufijos <code>_0</code>, <code>_1</code>, etc. Incluso puedes usar una clave personalizada en el propio campo de lista para prefijar todos los elementos.",
  "li_cheat_serializable": "Clase <code>[Serializable]</code> anidada (Elementos de inventario, Nodos de di치logo)",
  "li_cheat_structs": "<strong>Structs</strong> (Solo se admiten Clases para la recursi칩n)",
  "code_example_attribute_limitations": "[LocalizableField] \npublic string Prop { get; set; } // FALLO: Propiedad\n\n[LocalizableField]\npublic static string St = \"X\"; // FALLO: Est치tico\n\n[LocalizableField]\npublic string Head = \"A\" + \"B\"; // FALLO: Concatenaci칩n",
  "li_cheat_non_literals": "<strong>Variables y Constantes:</strong> Asignaciones como <code>string s = MyConst;</code> (Debe ser un Literal de Cadena)",
  "h3_attribute_limitations": "Limitaciones",
  "li_cheat_headers": "Atributos como <code>[Header(\"...\")]</code> (si se a침aden a la Configuraci칩n)",
  "li_cheat_static": "<strong>Campos est치ticos:</strong> <code>public static string</code> (El analizador solo escanea instancias)",
  "li_cheat_private": "Campos <code>private</code> / <code>protected</code> (El analizador utiliza Reflexi칩n)",
  "li_attr_feat_2": "<strong>Modificadores de acceso:</strong> Funciona con campos <code>private</code>, <code>protected</code>, <code>internal</code> y <code>public</code>.",
  "li_attr_limit_3": "<strong>Campos est치ticos:</strong> Compatibles mediante an치lisis est치tico (regex) en archivos de c칩digo, pero generalmente se recomienda usar campos de instancia para una detecci칩n robusta en GameObjects.",
  "li_attr_feat_3": "<strong>Atributos personalizados:</strong> En la configuraci칩n de la <em>Pesta침a de Contenido</em>, puedes a침adir <code>HeaderAttribute</code>, <code>TooltipAttribute</code>, o cualquier nombre de atributo personalizado. 춰El analizador tratar치 entonces los campos con estos atributos (p. ej., <code>[Header(\"Texto\")]</code>) como cadenas localizables!",
  "li_cheat_ternary": "<strong>L칩gica/Ternario:</strong> <code>cond ? \"A\" : \"B\"</code> (El analizador no puede determinar el valor)",
  "li_cheat_concatenation": "<strong>Concatenaci칩n de cadenas:</strong> <code>\"A\" + \"B\"</code> (La expresi칩n regular solo captura la primera parte: \"A\")",
  "li_attr_limit_1": "<strong>Las propiedades se ignoran:</strong> El analizador solo escanea <code>Fields</code>. C칩digo como <code>[LocalizableField] public string Name { get; set; }</code> <strong>no funcionar치</strong>.",
  "li_attr_limit_2": "<strong>Diccionarios:</strong> <code>Dictionary&lt;T, string&gt;</code> no es directamente compatible para el an치lisis.",
  "li_cheat_dictionaries": "<strong>Diccionarios</strong> (No serializable por el inspector de Unity de forma natural)",
  "li_cheat_properties": "<strong>Propiedades</strong> <code>{ get; set; }</code> (춰Solo campos!)",
  "h3_attribute_features": "Tipos y Caracter칤sticas Compatibles",
  "h3_attribute_cheat_sheet": "Referencia R치pida: Qu칠 hacer y qu칠 no hacer",
  "li_attr_feat_4": "<strong>Objetos Anidados:</strong> Escanea recursivamente campos dentro de clases o structs marcados con <code>[System.Serializable]</code>. Esto incluye instancias 칰nicas y listas de objetos anidados.",
  "li_cheat_collections": "<code>List&lt;string&gt;</code>, <code>string[]</code> Arrays",
  "li_cheat_scriptable_objects": "<strong>ScriptableObjects</strong> (Debe ser referenciado por un MonoBehaviour)",
  "li_cheat_constructor_args": "<strong>Argumentos de Constructor Complejos:</strong> <code>new Item(\"Name\" + index)</code>",
  "lbl_supported": "Totalmente Compatible",
  "li_cheat_nested_lists": "<strong>Listas de Objetos Anidados</strong> (p. ej. <code>List&lt;ItemData&gt;</code>)",
  "tip_best_practice": "<strong>Consejo Profesional:</strong> Si necesitas localizar una Propiedad, crea un campo de respaldo con <code>[LocalizableField]</code> y exp칩n la propiedad por separado.",
  "lbl_not_supported": "NO Compatible"
}