{
  "a_faq_addressables_1": "Asegúrate de que el paquete Addressables esté instalado, la configuración creada y de que hiciste clic en \"Scan Assets & Generate Tables\" para registrar claves en grupos.",
  "a_faq_addressables_2": "Crea un <code>Translation Profile</code> en la carpeta de activos, selecciona el tipo de servicio, introduce la clave API y asigna este perfil en la ventana <code>Settings</code>.",
  "a_faq_addressables_3": "En la ventana de Migración (pestañas Componentes / Importar), hay un botón \"Habilitar Stubs\" que activa la función Stubs de Emergencia. Esto crea clases ficticias de marcador de posición para I2 Localization o Unity Localization, de modo que tu proyecto pueda compilarse inmediatamente después de eliminar esos complementos. La función funciona alternando el símbolo de definición ANKO_ENABLE_MIGRATION_STUBS. Esto evita errores \"The type name 'Localize' could not be found\" y te da tiempo para refactorizar correctamente tu código y usar el nuevo sistema. Habilitar Stubs te permite corregir errores de compilación después de eliminar el antiguo complemento de localización. En la v2.0, el sistema de migración se ha ampliado con <strong>Migration Profiles</strong>, permitiendo reglas de transición más robustas desde otros complementos.",
  "a_faq_audio_smart_update": "La herramienta utiliza procesamiento por lotes inteligente con hashing MD5 para solo regenerar archivos de audio cuando el texto de origen ha cambiado. Calcula un hash MD5 de tu contenido de texto y lo compara con archivos de audio generados previamente. Si el texto no ha cambiado, omite la regeneración, ahorrando tus créditos de API. Esto previene llamadas API innecesarias y reduce costes al regenerar audio. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus créditos de API.",
  "a_faq_components_1": "No, no se ejecutará. Deshabilitar un MonoBehaviour evita que se llamen todos los métodos \"mágicos\" de Unity, incluidos Awake(), OnEnable() y Start(). Esto es intencional para evitar la ejecución de lógica duplicada. Toda la inicialización debe ocurrir en scripts en las versiones localizadas del prefab.",
  "a_faq_components_2": "Sí, el comportamiento físico del objeto original será neutralizado. El componente LocalizedPrefab encuentra todos los componentes Rigidbody y Rigidbody2D en su GameObject y establece su propiedad isKinematic en true. Esto los elimina efectivamente de los cálculos de física dinámica, evitando comportamientos no deseados como que un objeto invisible caiga o reaccione a colisiones. Todavía se recomienda que la versión localizada del prefab contenga todos los componentes de física necesarios para un comportamiento correcto.",
  "a_faq_components_3": "Sí, lo hará. El componente almacena el nombre de tipo completo, incluido el espacio de nombres y el ensamblado. Renombrar el script o moverlo a otro .asmdef cambiará este nombre, y LocalizedAsset no podrá encontrar el componente objetivo. Deberá ejecutar otro análisis mediante Analizar proyecto y Adjuntar componentes para que actualice el nombre.",
  "a_faq_components_4": "Se crea un LocalizedAsset para una instancia de componente específica. Contiene una referencia a ese componente en el código. Si añades manualmente un segundo LocalizedAsset y utilizas el menú contextual \"Analyze for Localization\" para apuntar al segundo Image, tendrás dos componentes LocalizedAsset, cada uno gestionando su propio Image. El analizador automático solo creará un componente para el primer Image con un activo localizable que encuentre.",
  "a_faq_components_5": "Sí, lo hará. LocalizedPrefab crea la instancia del prefab localizado en su método OnEnable(). El orden de ejecución de Unity garantiza que todos los métodos Awake() se ejecuten antes que todos los métodos OnEnable(). Por lo tanto, tu script con orden -110 ejecutará su Awake(), luego LocalizedPrefab con orden -100 ejecutará su Awake(), y solo después de eso se llamarán a sus métodos OnEnable() en orden. Tu script no encontrará el objeto porque aún no se habrá creado.",
  "a_faq_components_6": "Tanto la clave como el texto cambiarán. Llamar a SetFormattedText programáticamente anula el comportamiento de isStyleOnly para esa actualización específica. La opción isStyleOnly está destinada a evitar que el componente reaccione a los cambios de idioma globales, pero siempre reaccionará a un cambio directo de clave a través del código.",
  "a_faq_components_7": "Encontrará métodos con cualquier modificador de acceso (public, private, protected, internal). La reflexión en Unity permite el descubrimiento de todos los métodos de instancia, independientemente de su nivel de acceso.",
  "a_faq_components_8": "Es posible el uso del activo antiguo (no localizado). LocalizedAsset realiza el intercambio en su OnEnable(). Los métodos Awake() de todos los scripts se ejecutan antes que OnEnable(). Si tu script accede a audioSource.clip en Awake(), obtendrá el clip original. Si accede a él en Start(), el resultado dependerá del orden de ejecución del script. Para garantizar el acceso al activo localizado, establece un orden de ejecución posterior para tu script o accede al activo en un método marcado con [OnLanguageChange].",
  "a_faq_custom_keys_attribute": "Sí. En la <strong>Pestaña Content</strong>, en 'Attributes to Scan', puedes añadir cualquier nombre de atributo (p. ej., <code>[Header]</code>, <code>[TermsPopup]</code>). El analizador tratará cualquier campo de cadena con ese atributo como localizable.",
  "a_faq_custom_provider_1": "Asegúrate de que tu clase implemente <code>IAssetProvider</code>, NO sea abstracta y esté marcada con el atributo <code>[AssetProviderPlugin]</code>. Además, revisa la consola en busca de errores relacionados con la reflexión durante el inicio, ya que la herramienta escanea todos los ensamblados en busca de proveedores.",
  "a_faq_editor_1": "La directiva @placeholders: en el comentario tiene prioridad. Se considera una instrucción explícita del desarrollador y la \"fuente de la verdad\". En tu ejemplo, el editor requerirá {username} en la traducción e ignorará {name} del texto de origen.",
  "a_faq_editor_2": "Simplemente se ignorará. La herramienta busca una coincidencia exacta de @placeholders:. Si la directiva está mal escrita, se tratará como parte de un comentario regular, y la validación funcionará de la manera antigua, basándose en los marcadores de posición del texto de origen.",
  "a_faq_editor_3": "Sí. Tras un guardado manual exitoso o un cierre normal de la ventana (cuando guardas los cambios), todos los archivos de autoguardado se eliminan para evitar solicitar la recuperación en el próximo lanzamiento. Solo permanecen en caso de un fallo del editor.",
  "a_faq_editor_4": "Sí. Los anchos de columna se guardan en EditorPrefs cada vez que cierras la ventana del editor de traducción y se restaurarán la próxima vez que la abras.",
  "a_faq_editor_5": "Sí. MultiLineEditWindow tiene su propia pila temporal Deshacer/Rehacer que funciona mientras la ventana está abierta. Esto te permite deshacer y rehacer cambios de texto dentro de esa ventana. Una vez que guardas el resultado (al cerrar la ventana), este cambio se registra como una sola acción en la pila global Deshacer/Rehacer del editor principal.",
  "a_faq_examples_1": "No habrá un error. El marcador de posición {username} simplemente no se reemplazará, y obtendrás la cadena \"Hello, {username}\" como resultado. El reemplazo solo ocurre con una coincidencia de nombre exacta.",
  "a_faq_examples_2": "Sí, lo hará. El analizador utiliza reflexión para encontrar campos con las banderas BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static, por lo que encontrará y procesará campos estáticos.",
  "a_faq_examples_3": "No habrá un error de compilación, pero aparecerá una advertencia de LocalizedBehaviour en la consola de Unity en tiempo de ejecución. Informará que encontró un método con el atributo pero lo ignoró porque el método tiene parámetros. Un método así no se llamará.",
  "a_faq_examples_4": "Sí. Si no se encuentra una forma específica (_one, _few, etc.), el sistema intentará usar la clave con el sufijo _other como reserva. Si eso tampoco se encuentra, se utilizará la traducción para la clave base apple_count.",
  "a_faq_examples_5": "Sí, lo hará. Cada llamada a new { ... } asigna memoria en el montón administrado, lo que crea trabajo adicional para el recolector de basura. Para texto que se actualiza en cada frame (en Update o LateUpdate), es significativamente más eficiente crear un Dictionary<string, object> una vez en Start(), y solo actualizar sus valores en Update() antes de pasarlo a la función _().",
  "a_faq_examples_6": "Comprueba si tu método tiene parámetros. El atributo <code>[OnLanguageChange]</code> solo funciona en métodos <strong>sin parámetros</strong> (p. ej., <code>void UpdateUI()</code>). Si tu método requiere argumentos, envuélvelo en un método sin parámetros.",
  "a_faq_extending_1": "Solo tener la clase es suficiente. Cuando se ejecuta TextParser, utiliza reflexión para encontrar todas las clases en el proyecto que implementan la interfaz ITextComponentParser y llama automáticamente a su método Parse() para cada GameObject. No se requiere registro manual.",
  "a_faq_extending_2": "Una excepción en tu analizador personalizado interrumpirá el proceso. El bucle de análisis principal no envuelve las llamadas a analizadores personalizados en un bloque try-catch. Si tu método Parse() lanza una excepción no controlada,",
  "a_faq_installation_1": "El instalador comprueba la existencia del tipo Newtonsoft.Json.JsonConvert. Si el tipo existe, considera que la dependencia está satisfecha y no intentará instalar ni actualizar el paquete. Esto se hace para evitar conflictos de versiones.",
  "a_faq_installation_2": "Puedes activar manualmente una comprobación de dependencias en cualquier momento a través del menú Tools -> Localization -> Check Dependencies. Esto restablecerá la bandera \"Don't ask again\" y mostrará la ventana con todos los paquetes opcionales faltantes de nuevo.",
  "a_faq_installation_3": "Esto puede suceder si no tienes una carpeta Assets/Resources. La herramienta intentará crearla, pero los permisos del sistema de archivos podrían impedirlo. Sí, puedes crear el activo manualmente: haz clic derecho en la carpeta Resources, selecciona Create -> Localization -> Settings. La herramienta lo encontrará automáticamente.",
  "a_faq_installation_4": "Sí. La herramienta utiliza Resources.Load(), que busca un activo por nombre en todas las carpetas llamadas Resources en tu proyecto. Lo importante es que el archivo mantenga su nombre LocalizationSettings.asset.",
  "a_faq_installation_5": "Sí. Puedes abrir Window -> Package Manager, hacer clic en el icono \"+\" y seleccionar \"Add package by name...\". Introduce los nombres de los paquetes: com.unity.nuget.newtonsoft-json y com.unity.editorcoroutines.",
  "a_faq_notes_1": "Sí. Si no añades LanguageSelector a la lista de ignorados, el analizador tratará su TMP_Dropdown como un desplegable regular. Encontrará las opciones predeterminadas \"Option A, Option B, Option C\" que crea Unity y añadirá claves para ellas a tus archivos de traducción. Esto saturará tus archivos con claves innecesarias, ya que LanguageSelector eliminará estas opciones en tiempo de ejecución y creará las suyas de todos modos.",
  "a_faq_notes_2": "Sí, la fuente no cambiará. Esto es necesario porque LanguageSelector cambia directamente la propiedad label.text. Sin un LocalizedText en este objeto, el sistema de localización no sabe que este elemento necesita que se le apliquen estilos (fuente, RTL) cuando el idioma cambia. Un LocalizedText vacío con isStyleOnly sirve como un \"marcador\" para el sistema, diciendo: \"Observa este objeto y aplícale estilos, pero no toques su texto\".",
  "a_faq_notes_3": "El enfoque más eficiente es almacenar en caché la cadena de formato en Start() o en un método [OnLanguageChange], y usar string.Format regular en Update(). Ejemplo: private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } Esto evita buscar la clave en el diccionario en cada frame, lo cual es significativamente más rápido.",
  "a_faq_runtime_api_key_distinction": "<strong>Q: ¿Cuál es la diferencia entre 'Claves de Servicio de Traducción' y 'Clave API en Tiempo de Ejecución'?</strong><br>A: <strong>Claves de Servicio de Traducción</strong> (OpenAI, DeepL) se utilizan en el <strong>Unity Editor</strong> para generar traducciones. Se almacenan en el registro de tu computadora (EditorPrefs) y NO se incluyen en la compilación.<br>La <strong>Clave API en Tiempo de Ejecución</strong> es utilizada por el <strong>Game Build</strong> para obtener Actualizaciones en Vivo. Sí se incluye en la compilación (encriptada).",
  "a_faq_tts_voices": "En tu <strong>Translation Profile</strong> (Inspector), usa la lista 'Voice Mappings'. Puedes mapear un patrón Regex (p. ej., <code>^hero_.*</code>) a un ID de Voz específico. El generador elegirá automáticamente la voz correcta según el nombre de la clave.",
  "a_faq_window_actions_1": "La herramienta intentará reenviar el lote exacto que falló, de acuerdo con la configuración de la Política de Reintento (número de intentos y retraso). Si fallan todos los intentos para este lote, el proceso de traducción para el idioma actual se interrumpirá y se registrará un error en la consola. La traducción para los siguientes idiomas en la cola no comenzará.",
  "a_faq_window_actions_2": "Los valores vacíos reemplazarán las traducciones existentes. El proceso de importación considera el archivo CSV como la \"fuente de la verdad\". Si el valor para la clave welcome_message en la columna ru está vacío, la traducción rusa actual para esta clave se sobrescribirá.",
  "a_faq_window_actions_3": "Sí, lo hará. Las funciones en la \"Danger Zone\" escanean todos los prefabs en el proyecto (AssetDatabase.FindAssets(\"t:Prefab\")), no solo los especificados en la lista de análisis, para garantizar la limpieza más completa posible.",
  "a_faq_window_actions_4": "En tu documento de Google Sheets, la columna debe titularse \"Developer Notes\". En las celdas de esta columna, puedes escribir comentarios como de costumbre. Para especificar marcadores de posición, simplemente añade una línea como @placeholders: {username}, {score} en el texto del comentario. La herramienta reconocerá automáticamente esta directiva al importar.",
  "a_faq_window_actions_5": "La herramienta solo funciona con una hoja a la vez. La URL de importación incluye un parámetro gid=..., que identifica de forma única una hoja específica en el documento. Para importar datos de otra hoja, debes copiar su URL (con un GID diferente) y realizar la importación de nuevo.",
  "a_faq_window_assets_1": "El escáner de activos los carga especificando el tipo esperado (AssetDatabase.LoadAssetAtPath(path, expectedType)). Para la categoría AudioClip, solo buscará y cargará archivos que Unity reconozca como AudioClips. Si ambos archivos son clips de audio válidos, el que se procese al final se incluirá en la tabla, sobrescribiendo efectivamente el anterior. Se recomienda evitar tales duplicados.",
  "a_faq_window_assets_2": "Sí, así es exactamente como funciona. \"Analyze Project\" encuentra el componente Image, mira el nombre del sprite asignado a él (p. ej., icon_play_es), extrae la clave (icon_play) y el idioma (es) de él, y luego añade un componente LocalizedAsset a ese GameObject y escribe la clave icon_play en él.",
  "a_faq_window_assets_3": "Sí, puedes. No habrá conflictos, ya que se crea una tabla de activos separada (LocalizedAssetTable) para cada categoría. Las claves de la categoría \"Sprites\" no se superponen con las claves de la categoría \"AudioClips\", incluso si se llaman igual.",
  "a_faq_window_assets_4": "Sí, lo hará. El escáner utiliza la opción SearchOption.AllDirectories, lo que significa que comprobará recursivamente todas las subcarpetas dentro de la Scan Folder que especifiques.",
  "a_faq_window_content_1": "No, no lo hará. La lista Scenes to Parse se utiliza exclusivamente para que la herramienta sepa qué escenas abrir y analizar en busca de texto. De ninguna manera está relacionada con las escenas que terminarán en la build final de tu juego.",
  "a_faq_window_content_2": "No, no lo hará. La lista temporal almacena una referencia directa al objeto en la escena. Cuando creas un prefab, es un nuevo activo. Sus instancias son objetos diferentes, y la regla de ignorar no se aplicará a ellas. Para ignorar prefabs permanentemente, deben añadirse a la lista de ignorados como un activo de prefab.",
  "a_faq_window_content_3": "Sí, se eliminará. Cuando haces clic en Update Keys, el analizador vuelve a escanear todo el proyecto. Verá que el tipo TMPro.TMP_Text debe ignorarse y no generará una clave para él. Durante el proceso de comparación de claves antiguas y nuevas, determinará que la clave antigua ya no se utiliza y la marcará como \"Removed\".",
  "a_faq_window_content_4": "No, no lo hará. \"Pin\" guarda la ruta absoluta en la jerarquía de la escena en el momento en que se hace clic en el botón (p. ej., Canvas/Panel/Button). Esta ruta no está relacionada con la lógica del prefab. Las instancias del prefab tendrán la misma ruta, pero si cambias el nombre del objeto padre en la escena, \"Pin\" dejará de funcionar tanto para el original como para las instancias.",
  "a_faq_window_content_5": "Se guardará la ruta completa desde la raíz de la escena. Por ejemplo, MyPrefab(Clone)/Content/Icon. Esta ruta \"anclada\" solo funcionará en la escena donde la creaste. En otras escenas, es poco probable que se encuentre una ruta así.",
  "a_faq_window_preview_1": "No, no se guardará. PreviewSafetyBridge intercepta el evento de guardado de activos (OnWillSaveAssets) y llama automáticamente a RevertEditorPreview() antes de que Unity escriba los cambios en el disco. Por lo tanto, el prefab se guardará en su estado original, sin localizar.",
  "a_faq_window_preview_2": "PreviewRecoveryService maneja la recuperación después de un bloqueo. Si Unity se bloquea, el servicio detecta el archivo de respaldo en el siguiente inicio e intenta restaurar el estado de la escena. Si la recuperación automática falla, es posible que debas seleccionar manualmente \"Revert to Original\" en la ventana de la herramienta.",
  "a_faq_window_preview_3": "Sí, lo harán. PrefabUtility.InstantiatePrefab en Modo Edición llama a Awake() y OnEnable(). Si estos métodos contienen lógica que no debería ejecutarse en el editor (p. ej., acceder a singletons que solo existen en Modo Reproducción), podría causar errores. Se recomienda usar if (Application.isPlaying) o #if UNITY_EDITOR para proteger dicho código.",
  "a_faq_window_report_1": "Sí, se interrumpirá. Cualquier nueva acción que requiera el bloqueo de la UI (como Update Keys) detendrá la corrutina de búsqueda actual. Aparecerá un cuadro de diálogo, pidiéndote que detengas la búsqueda actual para comenzar una nueva.",
  "a_faq_window_report_2": "La categoría \"Duplicates\" mostrará todas las fuentes para esa clave. Verás una entrada para la clave, y el campo \"Source\" enumerará todas las rutas (en la escena 1 y la escena 2). El botón \"Find\" en este caso abrirá una lista desplegable, lo que te permitirá elegir a qué objeto navegar.",
  "a_faq_window_report_3": "Sí. El sistema de búsqueda está específicamente entrenado para reconocer fuentes como script MyScript.cs. Cuando haces clic en \"Find\", buscará el activo MyScript.cs en el proyecto y lo resaltará (ping) en la ventana Project.",
  "a_faq_window_settings_1": "Sí, lo harán. Al cambiar el modo, la herramienta realiza una \"migración segura\": vuelve a analizar todo el proyecto, crea nuevas claves de acuerdo con las nuevas reglas, pero mapea las claves antiguas y nuevas a través del texto original. Luego transfiere todas tus traducciones y comentarios existentes de las claves antiguas a las nuevas. Tus traducciones no se perderán.",
  "a_faq_window_settings_2": "Se utilizará la DefaultPluralRule, que es adecuada para el inglés y la mayoría de los idiomas europeos (formas para \"one\" y \"other\").",
  "a_faq_window_settings_3": "No, no se incluirán. Solo los activos ubicados en una carpeta StreamingAssets o Resources están garantizados de ser incluidos en la build. Si especificas una ruta diferente, la localización funcionará en el editor, pero no funcionará en el juego compilado, ya que los archivos de traducción no serán parte de la build.",
  "a_faq_window_settings_4": "Sí. EditorPrefs es almacenamiento local para cada computadora. Necesitarás ingresar la <strong>Clave API del Servicio de Traducción</strong> (para uso en el Editor como OpenAI/DeepL) en cada máquina. Sin embargo, la <strong>Clave API en Tiempo de Ejecución</strong> (utilizada en compilaciones) se almacena en la configuración del proyecto y se comparte mediante control de versiones (encriptada).",
  "code_async_example": "using Ankonoanko.Localization.Next;\n\nprivate async void Start() {\n    // Correct way to load localized assets with Addressables\n    var sprite = await LocalizationManager.Instance.GetLocalizedAssetAsync<Sprite>(\"flag_icon\");\n    myImage.sprite = sprite;\n}",
  "code_bridge_example": "// Using the generated class (Strongly Typed)\nstring text = AnkoLoc.MyKey;\n\n// Instead of using strings\nstring text = _(\"MyKey\");",
  "code_custom_attribute_example": "// Using custom attributes for automatic scanning\npublic class MyScript : MonoBehaviour {\n    [LocalizableField]\n    public string npcName; // Automatically found\n\n    [Header(\"Title\")] \n    // If you add \"Header\" to Attributes to Scan, this will also be found!\n    public string sectionTitle;\n}",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing System.Text.RegularExpressions;\nusing UnityEngine;\nusing Ankonoanko.Localization.Next;\n\n// TEMPLATE for creating a parser for a custom component.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings,\n        string prefabContextPath,\n        Dictionary<string, string> textToKeyMap = null,\n        List<Regex> ignoreRegexes = null,\n        bool migrationActive = false)\n    {\n        // 1. Check if the object has the custom component we need.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Exit if the component is not found\n        }\n        \n        // 2. Get the text from the custom component's fields.\n        string titleText = component.Title;\n        \n        // 3. Check if the text is valid for localization.\n        // We use ParsingLogic helper to check against ignore patterns\n        if (ParsingLogic.IsValidLocalizableText(titleText, ignoreRegexes))\n        {\n            // 4. Generate the key and source using helpers from ParsingLogic.\n            string key = ParsingLogic.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode, prefabContextPath, null, textToKeyMap);\n            string source = ParsingLogic.GetSourceStringForObject(gameObject, prefabContextPath);\n            \n            // 5. Return the result.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Repeat for other fields...\n        string descriptionText = component.Description;\n        if (ParsingLogic.IsValidLocalizableText(descriptionText, ignoreRegexes))\n        {\n            string key = ParsingLogic.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode, prefabContextPath, null, textToKeyMap) + \"_desc\";\n            string source = ParsingLogic.GetSourceStringForObject(gameObject, prefabContextPath);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "code_custom_provider_example": "using System;\nusing System.Collections.Generic;\nusing System.Threading.Tasks;\nusing UnityEngine;\n\nnamespace Ankonoanko.Localization.Next\n{\n    [AssetProviderPlugin(\n        \"My Custom System\",  // ← Name visible to user\n        \"Description of your asset loading system\",  // ← Short description\n        Author = \"Your Name\",\n        Version = \"1.0\"\n    )]\n    public class MyCustomProvider : IAssetProvider\n    {\n        private Dictionary<string, UnityEngine.Object> _loadedAssets = new();\n        private string _currentLanguage;\n\n        public string ProviderName => \"My Asset System\";\n        public bool SupportsSyncLoading => true;\n        public bool SupportsAsyncLoading => true;\n\n        public void Initialize(LocalizationSettings settings) { /* Init system */ }\n\n        public T Load<T>(string key) where T : UnityEngine.Object {\n            if (_loadedAssets.TryGetValue(key, out var cached)) return (T)cached;\n            T asset = Resources.Load<T>(key); // Replace with your logic\n            if (asset != null) _loadedAssets[key] = asset;\n            return asset;\n        }\n\n        public async Task<T> LoadAsync<T>(string key) where T : UnityEngine.Object {\n            return await Task.Run(() => Load<T>(key));\n        }\n\n        public void Unload(string key) => _loadedAssets.Remove(key);\n        public void UnloadAll() => _loadedAssets.Clear();\n        public bool Exists(string key) => true;\n        public void Dispose() => UnloadAll();\n\n        public void SetCurrentLanguage(string lang) {\n            _currentLanguage = lang;\n            UnloadAll(); // Clear cache for new language\n        }\n    }\n}",
  "code_example_attribute": "using Ankonoanko.Localization.Next;\nusing UnityEngine;\nusing System.Collections.Generic;\n\n// 1. Unattached & Base Classes (No MonoBehaviour needed)\npublic class BaseData { \n    [LocalizableField] protected string rarity = \"Common\"; \n}\n\npublic class MegaTest : BaseData // Inherited fields are scanned!\n{\n    // 2. Basic Fields (Public, Private, Protected)\n    [LocalizableField] private string _private = \"Private Field\";\n    [LocalizableField] public string PublicField = \"Public Field\";\n\n    // 3. Properties (Auto & Full)\n    [LocalizableField] public string AutoProp { get; set; } = \"Auto Property\";\n    [LocalizableField] public string GetOnly { get; } = \"Get Only Property\";\n\n    // 4. Static & Constants (Global text)\n    public const string GLOBAL_CONST = \"Global Const Value\";\n    [LocalizableField] public static string StaticField = \"Static Global Text\";\n    \n    // Roslyn resolves these references during scan:\n    private const string LOCAL_CONST = \"LocalConst\";\n    [LocalizableField] public string ReferenceConst = LOCAL_CONST;\n    [LocalizableField] public string GlobalConstRef = GLOBAL_CONST;\n\n    // 5. String Concatenation & Interpolation (Calculated at parse time)\n    [LocalizableField] public string Concat1 = \"Hello \" + \"World\";\n    [LocalizableField] public string Concat2 = \"Prefix: \" + LOCAL_CONST;\n    \n    // 6. Custom Keys & Attributes\n    [LocalizableField(\"main_menu_title\")] public string Title = \"Game Title\";\n    [LocalizableField(key: \"custom_key_syntax\")] public string KeySyntax = \"Explicit Key\";\n    \n    [Header(\"Header Text\")] // Scanned if 'Header' added to Attributes to Scan\n    [Tooltip(\"Tooltip Text\")]\n    public string annotatedField;\n    \n    // 7. Collections (Arrays, Lists, Target-typed new)\n    [LocalizableField] public string[] Array1 = { \"A\", \"B\" };\n    [LocalizableField] public List<string> List1 = new List<string> { \"C\", \"D\" };\n    [LocalizableField] public List<string> ListNew = new() { \"E\", \"F\" }; // C# 9.0+\n    \n    // 8. Nested Objects (Deep Recursion)\n    [System.Serializable]\n    public class DialogStep {\n        [LocalizableField] public string actorName;\n        [LocalizableField] public string message;\n    }\n    [LocalizableField] public DialogStep introStep; \n    [LocalizableField] public List<DialogStep> dialogSelect; // List of objects!\n}",
  "code_example_attribute_limitations": "[LocalizableField]\npublic Dictionary<string, string> Dict; // FAIL: Dictionary (Use Lists)\n\n[LocalizableField]\npublic int Number = 5; // FAIL: Non-string types",
  "code_example_function": "// 1. Add Static Import for short syntax\nusing static Ankonoanko.Localization.Next.LocalizationManager; \n\npublic class RuntimeExample : MonoBehaviour {\n    void Demo() {\n        // 2. Simple Key/Text lookup\n        _(\"Hello World\");\n        \n        // 3. Indexed Formatting ({0}, {1})\n        _(\"Score: {0} / {1}\", 10, 20); \n\n        // 4. Named Arguments (Smart Formatting)\n        // Uses anonymous object. Key = \"welcome_user\"\n        _(\"welcome_user\", new { name = \"Hero\", level = 5 }); \n\n        // 5. Pluralization (Integer argument)\n        // Automatically finds key_one, key_few, key_many\n        _(\"coins_count\", 5); \n\n        // 6. Genderization (Gender enum)\n        // Automatically finds key_male, key_female\n        _(\"npc_greeting\", Gender.Female);\n\n        // 7. Manual Dictionary (High performance / Dynamic)\n        var args = new Dictionary<string, object> { { \"rank\", \"S\" } };\n        _(\"rank_msg\", args);\n\n        // 8. Nesting (Translating arguments recursively)\n        _(\"Element: {0}\", _(\"Fire\")); \n    }\n}",
  "code_example_plurals": "using static Ankonoanko.Localization.Next.LocalizationManager;\nusing Ankonoanko.Localization.Next;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Keys: \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Texts: \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Automatically selects the correct form\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Keys: \"user_greeted_male\", \"user_greeted_female\"\n        // Texts: \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "code_script_rule_example": "// Supporting custom or third-party functions\n// Before: The scanner only sees _(\"key\") calls\nstring text = MyLegacySystem.Translate(\"old_key\");\nstring i2Text = LocalizationManager.GetTranslation(\"I2_KEY\");\n\n// After: Add a Script Parsing Rule with regex pattern\n// These keys will now be automatically indexed and managed by the tool!",
  "copy_code_copied": "¡Copiado!",
  "copy_code_copy": "Copiar",
  "copy_code_error": "Error",
  "error_loading_message": "Por favor, comprueba tu conexión y actualiza.",
  "error_loading_title": "Error de Carga",
  "h1_ai_audio": "Audio IA / Texto a Voz",
  "h1_ai_profiles": "Perfiles de IA y Traducción",
  "h1_api_snippets": "API y fragmentos de código",
  "h1_components": "Componentes Principales (asignados automáticamente)",
  "h1_extending": "Ampliación de la Funcionalidad",
  "h1_faq": "Preguntas Frecuentes y Solución de Problemas",
  "h1_font_glyph_manager": "Gestor de Fuentes y Glifos",
  "h1_important_notes": "Notas Importantes y Advertencias",
  "h1_introduction": "Introducción",
  "h1_loc_tool_window": "Ventana \"Localization Tool\"",
  "h1_migration_tool": "Herramienta de Migración",
  "h1_quick_start": "Inicio Rápido y Configuración",
  "h1_tms": "Integración externa de TMS (Crowdin, Loco, Phrase, Transifex)",
  "h1_translation_editor": "Editor de la Tabla de Traducción",
  "h1_usage_examples": "Ejemplos de Uso",
  "h2_ai_assistant": "Comandos del asistente de IA",
  "h2_ai_audio_setup": "Configuración",
  "h2_ai_audio_usage": "Uso",
  "h2_ai_context": "Contexto y glosario",
  "h2_ai_profiles_overview": "Perfiles de traducción",
  "h2_async_api": "API asíncrona (Addressables)",
  "h2_backup_manager": "Gestor de Copias de Seguridad",
  "h2_bridge_generation": "Generar puentes C# (Acceso tipado fuertemente)",
  "h2_custom_ai": "IA personalizada y modelos",
  "h2_custom_asset_provider": "Crear un Proveedor de Activos Personalizado",
  "h2_custom_attributes": "Escaneo de atributos personalizados",
  "h2_custom_parser": "Creando un analizador personalizado",
  "h2_example_attribute": "Atributo [LocalizableField]",
  "h2_example_components": "Componentes y ejemplos listos para usar",
  "h2_example_components_updated": "LanguageSelector.cs Actualizado",
  "h2_example_function": "Función _() y atributo [OnLanguageChange]",
  "h2_example_plurals": "Plurales y género",
  "h2_faq_addressables": "Addressables y Migración",
  "h2_faq_audio": "Audio IA / Texto a Voz",
  "h2_faq_components": "Componentes principales",
  "h2_faq_editor": "Editor de traducción",
  "h2_faq_examples": "Ejemplos de uso y código",
  "h2_faq_extending": "Ampliando la funcionalidad",
  "h2_faq_installation": "Instalación y comienzo rápido",
  "h2_faq_notes": "Matices importantes y advertencias",
  "h2_faq_window": "\"Ventana de la herramienta de localización\"",
  "h2_font_glyph_manager_features": "Características",
  "h2_in_editor_preview": "Vista previa en el editor y Prefab",
  "h2_initial_setup": "Configuración inicial",
  "h2_installation": "Instalación",
  "h2_key_features": "Características Clave",
  "h2_live_updates_guide": "Guía de Actualizaciones en Vivo",
  "h2_localizedasset": "Activo localizado",
  "h2_localizedasset_updated": "LocalizedAsset Carga Asíncrona",
  "h2_localizedbehaviour": "Comportamiento localizado",
  "h2_localizeddropdown": "Desplegable localizado",
  "h2_localizedprefab": "LocalizedPrefab",
  "h2_localizedtext": "Texto localizado",
  "h2_migration_custom": "Crear Perfiles Personalizados",
  "h2_migration_google_sheets": "Clave de Google Sheets",
  "h2_migration_import_formats": "Formatos de Importación (CSV y Google Sheets)",
  "h2_migration_stubs": "Migración Segura y Stubs de Emergencia",
  "h2_migration_tool_features": "Características",
  "h2_migration_workflow": "Guía del Flujo de Trabajo de Migración",
  "h2_preview_overlay": "Superposición de Vista de Escena",
  "h2_safety_caps": "Límites y Cuotas de Seguridad",
  "h2_script_parsing_rules": "Reglas de análisis de scripts (Compatibilidad)",
  "h2_tab_actions": "\"Acciones\" pestaña",
  "h2_tab_assets": "\"Activos\" pestaña",
  "h2_tab_content": "Pestaña \"Contenido\"",
  "h2_tab_report": "\"Informe\" pestaña",
  "h2_tab_settings": "\"Configuración\" pestaña",
  "h2_tab_tutorials": "\"Tutorials\" pestaña",
  "h2_tms_setup": "Configuración y uso",
  "h2_tms_supported": "Servicios compatibles",
  "h2_uitklocalization": "UITKLocalization",
  "h2_visual_debugging_guide": "Depuración Visual",
  "h2_window_footer": "Pie de ventana (Barra de estado)",
  "h2_window_header": "Encabezado de ventana y barra de herramientas",
  "h2_window_sidebar": "Menú principal (Barra lateral)",
  "h3_actions_autotranslate": "Traducción automática",
  "h3_actions_danger": "Zona peligrosa",
  "h3_actions_data": "Gestión de datos",
  "h3_actions_editor": "Editor de traducción",
  "h3_actions_parsing": "Análisis",
  "h3_actions_tms_integration": "Servicios externos (TMS)",
  "h3_assets_automation": "Automatización",
  "h3_assets_categories": "Categorías de activos",
  "h3_assets_folder_gen": "Generación de carpetas",
  "h3_assets_loading": "Estrategia de carga",
  "h3_assets_storage": "Configuración de almacenamiento",
  "h3_attribute_cheat_sheet": "Referencia Rápida: Qué hacer y qué no hacer",
  "h3_attribute_features": "Tipos y Características Compatibles",
  "h3_attribute_limitations": "Limitaciones",
  "h3_content_components_ignore": "Tipos de componentes a ignorar",
  "h3_content_dynamic_keys": "Prefijos de claves dinámicas",
  "h3_content_dynamic_texts": "Textos dinámicos",
  "h3_content_objects_ignore": "Objetos a ignorar",
  "h3_content_prefabs": "Carpetas de Prefab",
  "h3_content_regex": "Patrones Regex ignorados",
  "h3_content_scenes": "Escenas a analizar",
  "h3_content_script_rules": "Reglas de análisis de scripts",
  "h3_content_scripts_ignore": "Scripts a ignorar",
  "h3_custom_provider_steps": "Pasos de Implementación",
  "h3_faq_window_actions": "Pestaña \"Actions\" (Acciones)",
  "h3_faq_window_assets": "Pestaña \"Assets\" (Activos)",
  "h3_faq_window_content": "Pestaña \"Content\" (Contenido)",
  "h3_faq_window_preview": "Vista Previa en el Editor",
  "h3_faq_window_report": "Pestaña \"Report\" (Informe)",
  "h3_faq_window_settings": "Pestaña \"Settings\" (Configuración)",
  "h3_mode_auto": "AutoGenerateKeysOnly (Estándar)",
  "h3_mode_hybrid": "Modos híbridos (Prioridad personalizada)",
  "h3_mode_text": "UseTextAsKey (Simplificado)",
  "h3_report_all_keys": "Todas las claves",
  "h3_settings_debugging": "Depuración",
  "h3_settings_general": "Configuración general",
  "h3_settings_keygen": "Generación de claves",
  "h3_settings_languages": "Gestión de idiomas",
  "h3_settings_liveupdates": "Actualizaciones en tiempo real",
  "h3_settings_pseudo": "Configuración de pseudo‑localización",
  "h3_settings_runtimeapi": "API en tiempo de ejecución",
  "h3_settings_tools": "Herramientas generales y de desarrollo",
  "h3_tutorials_list": "Lista de tutoriales",
  "lbl_not_supported": "NO Compatible",
  "lbl_supported": "Totalmente Compatible",
  "li_actions_1": "<strong>Parsing:</strong><ul><li><strong>Update Keys:</strong> Escaneo completo del proyecto definido por la configuración de la pestaña 'Content'.</li><li><strong>Scan Selected Assets:</strong> Escanea SÓLO los archivos/carpetas actualmente seleccionados en la Vista de Proyecto. Más seguro para actualizaciones parciales ya que deshabilita automáticamente 'Remove Missing Keys'.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor:</strong> Abre una ventana separada y más conveniente para editar todas las traducciones.",
  "li_actions_3": "<strong>Gestión de Datos:</strong> Utiliza para intercambiar datos con traductores (Exportar/Importar a CSV/XML/YAML/XLIFF, importar desde Google Sheets). <strong>Google Sheets:</strong> Soporta tanto enlaces de 'Editar' como URLs de 'Publicar en la Web' (verifica el parámetro GID).",
  "li_actions_4": "<strong>Auto-Translation:</strong> Rellena automáticamente todas las cadenas de traducción vacías utilizando el <strong>Translation Profile</strong> activo.",
  "li_actions_5": "<strong>Danger Zone:</strong> Contiene botones para eliminar completamente todos los componentes de localización del proyecto. ¡Úsalo con precaución!",
  "li_ai_1": "<strong>Create Profile:</strong> Clic derecho en la vista Project -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Services:</strong> Soporta DeepL, Google Translate, Microsoft Azure y <strong>Custom AI</strong>.",
  "li_ai_3": "<strong>Settings:</strong> Cada perfil almacena su propia Clave API, límites (tamaño de lote, caracteres máximos) y configuración del modelo.",
  "li_ai_4": "<strong>AIPresetsGenerator:</strong> Utiliza el generador incorporado para crear rápidamente perfiles para servicios populares (OpenAI, Gemini, Claude, Ollama).",
  "li_ai_audio_generate": "En <strong>Translation Table Editor</strong>, selecciona filas/celdas -> Clic derecho -> <strong>Generate Audio</strong>.",
  "li_ai_audio_hash": "<strong>Actualización Inteligente y Hashing:</strong> La herramienta calcula un hash MD5 de tu contenido de texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus créditos de API. Detecta si la traducción ha cambiado desde la última generación de audio. El editor resalta estas filas con un icono 'Outdated' (amarillo), lo que te permite actualizar SÓLO las líneas modificadas. Esta característica de procesamiento por lotes inteligente previene llamadas API innecesarias y reduce costes al regenerar audio. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus créditos de API.",
  "li_ai_audio_profile": "En <strong>Settings</strong>, selecciona el <strong>Active Audio Profile</strong> (p. ej., OpenAI TTS o ElevenLabs).",
  "li_ai_audio_save": "Los archivos se guardan en la carpeta especificada en el perfil.",
  "li_ai_audio_voice_mapping": "<strong>Asignación de voces (Multihablante):</strong> Asigna diferentes voces de IA a distintos personajes automáticamente. Utiliza la lista <strong>Voice Mappings</strong> para enlazar patrones Regex (p. ej., <code>^hero_.*</code>) a IDs de voz específicos. La herramienta seleccionará automáticamente la voz correcta según el nombre de la clave durante la generación de audio.",
  "li_ai_provider_settings": "<strong>Configuración del Proveedor:</strong> Cada servicio permite la configuración de Claves API, Modelos (p.ej., GPT-4o, Sonnet) y parámetros específicos de voz (Estabilidad, Similaridad).",
  "li_api_async_method": "<strong>GetLocalizedAssetAsync&lt;T&gt;:</strong> Utiliza esto para cargar assets Addressables de forma asíncrona. Devuelve un <code>Task&lt;T&gt;</code>.",
  "li_api_gender_method": "GetGendered: GetGendered(string baseKey, Gender gender) devuelve una traducción específica de género.",
  "li_api_plural_method": "<strong>GetPlural:</strong> <code>GetPlural(string baseKey, double count)</code> devuelve la forma plural correcta según las reglas específicas del idioma.",
  "li_api_set_lang_method": "<strong>SetLanguage:</strong> Una corrutina (<code>IEnumerator</code>) para cambiar el idioma. Siempre usa <code>StartCoroutine()</code>.",
  "li_assets_1": "<strong>Crear una estructura de carpetas (opcional):</strong> En la sección <strong>2. Asset Folder Generation</strong>, haz clic en <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Configurar categorías y reglas de nomenclatura:</strong> En la sección <strong>3. Asset Categories & Scanning</strong>, asegúrate de que la <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) coincida con tus archivos (p. ej., <code>button_ok_es.png</code>).",
  "li_assets_3": "<strong>Coloca tus activos:</strong> Pon los activos localizados en las carpetas.",
  "li_assets_4": "<strong>Escanear activos:</strong> En la sección <strong>4. Automation</strong>, haz clic en <strong>Scan Assets & Update Tables</strong>. El proceso de limpieza se ha vuelto más seguro: ahora solo se eliminan los archivos de tabla antiguos (<code>.asset</code>), no la carpeta completa.",
  "li_assets_5": "<strong>Vincular activos a objetos:</strong> Haz clic en <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Addressables Integration:</strong> Si el modo <strong>Addressables</strong> está habilitado, los activos se registrarán automáticamente en grupos de Addressables con direcciones en la forma <code>{Category}/{Language}/{Key}</code> durante el escaneo.",
  "li_assets_addressables_naming": "<strong>Convención de Nombres:</strong> Al escanear, la herramienta establece automáticamente las Direcciones de Addressable en el formato <code>{Category}/{Language}/{Key}</code>. <strong>No cambies el nombre</strong> de estas direcciones manualmente, ya que LocalizationManager se basa en este formato específico para cargar activos en tiempo de ejecución.",
  "li_assets_auto_folders": "<strong>Auto-Generate Folders:</strong> Si está habilitado, la herramienta creará automáticamente la estructura de directorios necesaria para todos los idiomas compatibles durante la primera localización de assets.",
  "li_assets_folder_gen": "<strong>Folder Generation:</strong> Crea automáticamente la estructura de carpetas para assets localizados según tus reglas.",
  "li_assets_storage_path": "<strong>Asset Storage Path:</strong> Define el directorio raíz para todos los assets localizados (Sprites, Audio, etc.). Usa la variable <code>{lang}</code> para especificar cómo se estructuran las carpetas por idioma.",
  "li_assistant_1": "<strong>Configurable:</strong> Define comandos en tu Translation Profile (p. ej., \"Fix Grammar\", \"Make Formal\", \"Shorten for UI\").",
  "li_assistant_2": "<strong>Batch Processing:</strong> Selecciona múltiples celdas para aplicar el comando a todas ellas a la vez.",
  "li_assistant_3": "<strong>Custom Commands:</strong> Define tus propias indicaciones en el inspector <strong>Translation Profile</strong> (Lista de <code>AIAssistantCommand</code>). Cada comando tiene una <strong>Label</strong> (aparece en el menú contextual) y un <strong>Prompt</strong> (las instrucciones enviadas a la IA, p. ej., 'Reescribir en estilo pirata').",
  "li_attr_feat_1": "<strong>Colecciones:</strong> Soporta <code>List&lt;string&gt;</code> y <code>string[]</code>. Las claves se generan con sufijos <code>_0</code>, <code>_1</code>, etc. Incluso puedes usar una clave personalizada en el propio campo de lista para prefijar todos los elementos.",
  "li_attr_feat_2": "<strong>Modificadores de acceso:</strong> Funciona con campos <code>private</code>, <code>protected</code>, <code>internal</code> y <code>public</code>.",
  "li_attr_feat_3": "<strong>Atributos personalizados:</strong> En la configuración de la <em>Pestaña de Contenido</em>, puedes añadir <code>HeaderAttribute</code>, <code>TooltipAttribute</code>, o cualquier nombre de atributo personalizado. ¡El analizador tratará entonces los campos con estos atributos (p. ej., <code>[Header(\"Texto\")]</code>) como cadenas localizables!",
  "li_attr_feat_4": "<strong>Objetos Anidados:</strong> Escanea recursivamente campos dentro de clases o structs marcados con <code>[System.Serializable]</code>. Esto incluye instancias únicas y listas de objetos anidados.",
  "li_attr_feat_5": "<strong>Cadenas Formateadas:</strong> Soporta cadenas interpoladas (<code>$\"Text {0}\"</code>), cadenas verbatim (<code>@\"Text\"</code>), y concatenación (<code>\"A\" + \"B\"</code>).",
  "li_attr_limit_1": "<strong>Se Admiten Propiedades:</strong> El analizador escanea tanto <code>Fields</code> como <code>Properties</code>. Se requiere un Getter.",
  "li_attr_limit_2": "<strong>Diccionarios:</strong> <code>Dictionary&lt;T, string&gt;</code> no es directamente compatible para el análisis.",
  "li_attr_limit_3": "<strong>Campos estáticos:</strong> Compatibles mediante análisis estático (regex) en archivos de código, pero generalmente se recomienda usar campos de instancia para una detección robusta en GameObjects.",
  "li_backup_desc": "Rastrea cambios y restaura versiones anteriores de tus traducciones.",
  "li_backup_rollback": "<strong>Rollback:</strong> Revertir instantáneamente las claves seleccionadas o toda la tabla a un estado anterior.",
  "li_backup_snapshots": "<strong>Snapshots:</strong> Crea puntos de restauración con nombre antes de operaciones masivas.",
  "li_cheat_base_private": "<strong>Campos Privados Base:</strong> Admitidos (El escáner lee directamente los archivos de la clase base)",
  "li_cheat_collections": "<code>List&lt;string&gt;</code>, <code>string[]</code> Arrays",
  "li_cheat_concatenation": "<strong>Concatenación de Cadenas:</strong> <code>\"A\" + \"B\"</code> (Admitido)",
  "li_cheat_constructor_args": "<strong>Argumentos de Constructor Complejos:</strong> <code>new Item(\"Name\" + index)</code>",
  "li_cheat_dictionaries": "<strong>Diccionarios</strong> (No serializable por el inspector de Unity de forma natural)",
  "li_cheat_headers": "Atributos como <code>[Header(\"...\")]</code> (Totalmente Admitidos)",
  "li_cheat_nested_lists": "<strong>Listas de Objetos Anidados</strong> (p. ej. <code>List&lt;ItemData&gt;</code>)",
  "li_cheat_non_literals": "<strong>Variables y constantes:</strong> <code>const string s = \"Value\";</code> or <code>static string</code> (Compatible, Roslyn resuelve valores del mismo archivo)",
  "li_cheat_private": "<code>private</code> / <code>protected</code> campos (Admitidos)",
  "li_cheat_properties": "<strong>Propiedades:</strong> <code>{ get; set; }</code> (Se admiten auto-propiedades y propiedades completas)",
  "li_cheat_scriptable_objects": "<strong>ScriptableObjects</strong> (Admitidos si están referenciados)",
  "li_cheat_serializable": "Clase <code>[Serializable]</code> anidada (Elementos de inventario, Nodos de diálogo)",
  "li_cheat_static": "<strong>Campos Estáticos:</strong> <code>public static string</code> (Totalmente admitidos)",
  "li_cheat_structs": "<strong>Estructuras y Registros:</strong> Admitidos (Escaneo recursivo)",
  "li_cheat_ternary": "<strong>Lógica/Ternario:</strong> <code>cond ? \"A\" : \"B\"</code> (El analizador no puede determinar el valor)",
  "li_cheat_unattached": "<strong>Scripts Desacoplados:</strong> Admitidos (El escáner lee todos los archivos .cs del proyecto)",
  "li_content_1": "<strong>Scenes to Parse:</strong> Arrastra y suelta todas las escenas para el análisis aquí.",
  "li_content_2": "<strong>Prefab Folders:</strong> Especifica carpetas con prefabs. Ahora es compatible con paginación y búsqueda para proyectos grandes.",
  "li_content_3": "<strong>Dynamic Texts:</strong> Introduce aquí las cadenas que se crean exclusivamente en código (p. ej., \"Game Over\").",
  "li_content_4": "<strong>Component Types to Ignore:</strong> Especifica los tipos de Componentes de Unity que deben omitirse durante el escaneo.",
  "li_content_5": "<strong>Pin to Ignore:</strong> Esta función te permite \\\"fijar\\\" un objeto de la escena a la lista de ignorados de forma persistente.",
  "li_content_6": "<strong>Scripts to Ignore:</strong> Añade scripts C# específicos O carpetas completas para excluirlos del análisis.",
  "li_content_7": "<strong>Dynamic Key Prefixes:</strong> Lista de prefijos para claves (p. ej., <code>Item_</code>) que no se eliminarán durante la limpieza.",
  "li_content_dynamic_keys": "<strong>Dynamic Key Prefixes:</strong> Define prefijos (p. ej., <code>quest_item_</code>) que deben reconocerse como potencialmente dinámicos. Esto ayuda a la herramienta a distinguir entre etiquetas UI estáticas y claves basadas en datos.",
  "li_content_dynamic_texts": "<strong>Dynamic Text Rules:</strong> Configura patrones para textos que se actualizan dinámicamente mediante código. Esto evita que el escáner cree claves redundantes para textos que cambian en tiempo de ejecución.",
  "li_content_regex_example": "<strong>Ejemplo de Wrapper Personalizado:</strong> Si utilizas una función personalizada como <code>MyGame.Loc(\"KEY\")</code>, agrega una Regla de Análisis de Script con la expresión regular: <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>.",
  "li_content_regex_presets": "<strong>Patrones de Expresión Regular Ignorados:</strong> Haga clic en <strong>'Agregar Patrón Común'</strong> para excluir rápidamente contenido dinámico como URLs, correos electrónicos, etc.",
  "li_content_scanner": "<strong>Escáner de Código Roslyn:</strong> Un motor de análisis estático profundo que entiende los árboles de sintaxis C# para una detección robusta de claves.",
  "li_content_scanner_details_1": "<strong>Detección Inteligente de Llamadas:</strong> encuentra automáticamente llamadas a <code>LocalizationManager._(\"Text\")</code>, <code>_(\"Text\")</code> y <code>GetTranslation(\"Text\")</code>. Impone el modo <strong>Text-As-Key</strong> para estas llamadas para asegurar que funciones en tiempo de ejecución como Pluralización y Género funcionen correctamente.",
  "li_content_scanner_details_2": "<strong>Resolución de Constantes:</strong> El escáner es lo suficientemente inteligente para resolver variables de cadena `const` o `static readonly`. Si usas <code>_ (MyConst)</code>, encontrará el valor de `MyConst` (si está definido en la misma clase) y lo usará como texto fuente.",
  "li_content_scanner_details_3": "<strong>Atributo y Metadatos:</strong> Escanea cualquier campo o propiedad con `[LocalizableField]`, `[Header]` o `[Tooltip]` (si está configurado). Maneja <strong>Arreglos</strong>, <strong>Listas</strong> y incluso <strong>Clases Serializables Anidadas</strong> de forma recursiva.",
  "li_content_scanner_details_4": "<strong>Compatibilidad con C# Moderno:</strong> Compatibilidad total con la sintaxis de C# 9.0+ , incluyendo expresiones tipadas por objetivo <code>new()</code>, creación implícita de arreglos y cadenas interpoladas (`$\"String {0}\"`).",
  "li_content_script_rules_attributes": "<strong>Atributos a Analizar:</strong> Define atributos personalizados (como <code>[Header]</code> o <code>[Tooltip]</code>) que el analizador debe reconocer como fuentes de cadenas localizables.",
  "li_content_script_rules_bridge_name": "<strong>Nombre de la Clase Bridge:</strong> Permite definir el nombre de la clase estática generada.",
  "li_content_script_rules_bridges": "<strong>Generar Bridges C#:</strong> Crea automáticamente una clase estática (p.ej., <code>AnkoLoc</code>) que proporciona acceso tipado a todas las claves, eliminando cadenas mágicas y habilitando la autocompletación del IDE.",
  "li_context_1": "<strong>Developer Notes:</strong> Los comentarios de la tabla de traducción se pasan a la IA como contexto.",
  "li_context_2": "<strong>Object Path:</strong> Si no existe ningún comentario, la ruta de jerarquía del objeto (p. ej., <code>MainMenu/Canvas/StartButton</code>) se utiliza como contexto de reserva.",
  "li_context_3": "<strong>Glossary:</strong> Puedes cargar un glosario CSV en el perfil para forzar traducciones específicas para términos y nombres.",
  "li_context_4": "<strong>Descripción del proyecto:</strong> Describe el entorno y la audiencia de tu juego para ayudar a la IA a comprender el contexto general.",
  "li_context_5": "<strong>Tono y estilo:</strong> Define la personalidad deseada (p.ej., 'Amistoso', 'Profesional', 'Pirata') y las reglas de formato.",
  "li_context_glossary": "<strong>Gestor de diccionario:</strong> Interactúa directamente con el glosario para 'Agregar', 'Editar' o 'Eliminar' términos. Soporta sensibilidad a mayúsculas y tipos 'No traducir'.",
  "li_context_optimization": "<strong>Optimización de tokens:</strong> El sistema compacta inteligentemente el contexto y reutiliza la caché para minimizar el uso de tokens y los costos.",
  "li_custom_ai_1": "<strong>GenericAIService:</strong> Una implementación flexible que puede comunicarse con APIs compatibles con OpenAI (incluidos LLMs locales a través de Ollama).",
  "li_custom_ai_2": "<strong>Plantillas y Autenticación:</strong> Personaliza completamente la solicitud. <ul><li><strong>Auth:</strong> Configura <code>Auth Header Key</code> (p.ej., <code>Authorization</code>) y <code>Format</code> (p.ej., <code>Bearer {0}</code>). Soporta clave API en parámetros de consulta.</li><li><strong>Plantilla de Cuerpo:</strong> Usa una plantilla JSON con marcadores como <code>{model}</code> y <code>{prompt}</code> para texto, o <code>{input}</code> y <code>{voice}</code> para audio.</li><li><strong>Ruta de Respuesta:</strong> Define la ruta JSON al resultado (p.ej., <code>choices[0].message.content</code>).</li></ul>",
  "li_custom_ai_3": "<strong>Built-in Safety Features:</strong> Repara automáticamente las etiquetas de formato rotas (como <ph0>) a menudo devueltas por modelos de IA, asegurando traducciones fiables y consistentes.",
  "li_custom_parser_1": "Crea un nuevo script C# en la carpeta <strong>Editor</strong> de tu proyecto.",
  "li_custom_parser_2": "Copia la plantilla de abajo en él.",
  "li_custom_parser_3": "Modifica la lógica para que coincida con tu componente.",
  "li_custom_provider_manual_reg": "<strong>Registro manual:</strong> Para escenarios avanzados (como inyección de DI o inicialización perezosa), puedes registrar manualmente tu proveedor mediante <code>AssetProviderFactory.RegisterCustomProvider(\"MyID\", myInstance)</code> durante la inicialización.",
  "li_custom_provider_step_1": "<strong>Implementa la interfaz:</strong> Crea una nueva clase que implemente <code>IAssetProvider</code>. Necesitarás definir cómo <code>Load&lt;T&gt;</code> (sincrónico) y <code>LoadAsync&lt;T&gt;</code> (asíncrono) cargan los assets usando la API de tu sistema.",
  "li_custom_provider_step_2": "<strong>Define el ciclo de vida:</strong> Implementa <code>Initialize</code>, <code>Dispose</code> y <code>UnloadAll</code>. Estos métodos son llamados por el <code>LocalizationManager</code> al cambiar de idioma o al limpiar recursos.",
  "li_custom_provider_step_3": "<strong>Seguridad de idioma:</strong> El método <code>SetCurrentLanguage</code> se llama cada vez que cambia el idioma activo. Úsalo para actualizar rutas internas o volver a obtener los metadatos de los assets.",
  "li_custom_provider_step_4": "<strong>Auto‑descubrimiento (recomendado):</strong> Decora tu clase con el atributo <code>[AssetProviderPlugin]</code>. Esto hace que tu proveedor sea visible instantáneamente en el <strong>Settings Tab -&gt; Asset Loading Strategy</strong> desplegable.",
  "li_editor_1": "<strong>Agrupación Inteligente:</strong> Las claves para plurales y género (p. ej., <code>apple_count_one</code>, <code>apple_count_few</code>) se combinan automáticamente en grupos plegables.",
  "li_editor_2": "<strong>Edición Avanzada:</strong> Haz clic en una celda para abrir la ventana emergente <strong>MultiLineEditWindow</strong>. Muestra el texto de origen para comparación y valida los marcadores de posición.",
  "li_editor_3": "<strong>Selección avanzada:</strong> Soporta modos de selección flexibles: celdas individuales, filas completas o columnas específicas (idiomas). Usa <code>Ctrl+Click</code> y <code>Shift+Click</code> para selecciones complejas.",
  "li_editor_4": "<strong>Acciones masivas:</strong> Ejecuta operaciones en miles de celdas a la vez. Haz clic derecho en tu selección para: <ul><li><strong>Auto‑traducción:</strong> Rellenar traducciones faltantes usando el Perfil de IA activo.</li><li><strong>Rellenar desde origen:</strong> Restablecer rápidamente las traducciones.</li><li><strong>Alternar bloqueo:</strong> Protege las traducciones 'perfectas' de sobrescrituras accidentales.</li><li><strong>Generar audio:</strong> Procesar por lotes TTS para las frases seleccionadas.</li></ul>",
  "li_editor_5": "<strong>Navegación de alto rendimiento:</strong> El editor usa una vista virtualizada 'MultiColumnListView' para un desplazamiento fluido con más de 10k claves. Soporta navegación con teclado (Flechas/Tab) y atajos de nivel industrial: <code>Ctrl+S</code> (Guardar), <code>Ctrl+Z/Y</code> (Deshacer/Rehacer), <code>Ctrl+F</code> (Enfocar búsqueda).",
  "li_editor_6": "<strong>Preajustes de búsqueda avanzados:</strong> Audita tu proyecto usando filtros especializados: <ul><li><strong>Estado:</strong> Sin traducir (Actual/Cualquier idioma), Idéntico al origen, Bloqueado.</li><li><strong>Contenido:</strong> Tiene comentarios, Tiene/Faltan marcadores de posición, Tiene problemas de longitud (detectado automáticamente).</li><li><strong>Estructura:</strong> Pluralizado, con género, o ambos.</li><li><strong>Audio:</strong> Audio faltante, Desactualizado (desajuste de hash).</li></ul>",
  "li_editor_7": "<strong>Gestión inteligente de audio:</strong> Rastrea la 'frescura' de tus archivos TTS. Si editas el texto de la traducción, aparece un <strong>Indicador amarillo (Desactualizado)</strong> que indica que el hash del archivo de audio ya no coincide con el texto. Un clic regenera solo los archivos obsoletos.",
  "li_editor_8": "<strong>Mecanismo de bloqueo:</strong> Explicación: <ul><li><strong>Celdas/Filas bloqueadas:</strong> Previene cualquier modificación por <strong>Auto‑traducción</strong>, <strong>Importación CSV/Google</strong> o <strong>Rellenar desde origen</strong>.</li><li><strong>Caso de uso:</strong> Bloquea traducciones 'doradas' que han sido verificadas manualmente por hablantes nativos.</li><li><strong>Control masivo:</strong> Bloquea idiomas completos o características específicas (como nombres de personajes) en todo el proyecto.</li></ul>",
  "li_editor_layout": "<strong>Diseño dinámico de múltiples paneles:</strong> Usa el sistema de 3 paneles para fijar columnas 'fijas' (como Claves) al lado izquierdo mientras desplazas más de 20 idiomas en el centro. Alterna la visibilidad de columnas mediante el menú contextual del encabezado.",
  "li_editor_regex": "<strong>Búsqueda con expresiones regulares:</strong> Tanto la ventana principal como el editor de tabla soportan <strong>Expresiones regulares</strong>. Si tu consulta contiene símbolos como <code>* + ? ^ $ [ ] ( ) { } | .</code>, se trata automáticamente como una expresión regular (p.ej., <code>^item_.*</code> para encontrar todas las claves que empiezan con 'item_').",
  "li_editor_structure": "<strong>Tablas y grupos:</strong> Los datos se organizan en Tablas (Archivos), mostrados como Grupos (Carpetas) en el editor para una mejor navegación.",
  "li_editor_ui_test": "<strong>Pruebas de UI integradas:</strong> <ul><li><strong>Control deslizante de expansión de longitud:</strong> Simula la expansión del texto (0% - 100%) para ver cómo tu UI maneja idiomas más largos como alemán o ruso sin salir del editor.</li><li><strong>Renderizador de texto enriquecido:</strong> Alterna el renderizado de etiquetas (<code>&lt;b&gt;</code>, <code>&lt;color&gt;</code>) para verificar el estilo sin ejecutar el juego.</li></ul>",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code>:</strong> Un componente listo para usar para crear una lista desplegable de UI para cambiar de idioma. Encuentra automáticamente todos los idiomas disponibles y gestiona su cambio.<br><strong>Cómo usar:</strong> Simplemente añade el componente <code>LanguageSelector</code> a tu escena (p. ej., en un GameObject vacío) y especifica tu <code>TMP_Dropdown</code> en el inspector.",
  "li_example_components_2": "<strong>Code Examples:</strong> Para aprender técnicas avanzadas como trabajar con <code>[LocalizableField]</code>, la función <code>_()</code>, plurales y género, estudia los archivos <code>StatPurchaseTest.cs</code> y <code>TestLocalization.cs</code>. Demuestran claramente la implementación de todas las características principales de la herramienta en código.",
  "li_example_components_new": "<strong>Nuevo (v2.0):</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code>. Returns <code>IEnumerator</code>. Must be yielded.",
  "li_example_components_old": "<strong>Antiguo:</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (synchronous void) - <strong>Obsoleto</strong>. Use Coroutine version.",
  "li_feature_1": "<strong>Análisis Avanzado:</strong> Escaneo automático de escenas, prefabs, UI Toolkit (UXML) y scripts C#, incluidos campos marcados con el atributo <code>[LocalizableField]</code>, así como clases y listas anidadas.",
  "li_feature_10": "<strong>Gestor de Copias de Seguridad:</strong> Una herramienta integrada para crear y restaurar copias de seguridad.",
  "li_feature_11": "<strong>Impulsado por IA:</strong> Soporte para OpenAI, Anthropic (Claude), Google Gemini y LLMs locales (Ollama) a través de perfiles personalizables.",
  "li_feature_12": "<strong>Texto a Voz (TTS):</strong> Generación de archivos de audio para cadenas localizadas mediante IA (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Herramientas de Migración:</strong> Herramientas para la transición automática desde los plugins I2 Localization y Unity Localization.",
  "li_feature_14": "<strong>Gestor de Fuentes y Glifos:</strong> Herramienta para analizar los caracteres utilizados y encontrar glifos faltantes en las fuentes.",
  "li_feature_15": "<strong>Depuración Visual:</strong> Iconos en la jerarquía y etiquetas en la Vista de Escena para una depuración rápida.",
  "li_feature_2": "<strong>Localización de Cualquier Activo:</strong> Gestión de sprites, audio, prefabs, materiales, etc.",
  "li_feature_3": "<strong>Editor de traducción potente:</strong> Una interfaz centralizada con guardado automático, soporte completo de Deshacer/Rehacer, agrupación inteligente de claves y acciones de multiselección.",
  "li_feature_4": "<strong>IA y traducción automática:</strong> Sistema de perfiles que soporta DeepL, Google, Microsoft y <strong>IA personalizada (OpenAI, Gemini, Claude, Ollama)</strong> con conciencia de contexto.",
  "li_feature_5": "<strong>Importación/Exportación Flexible:</strong> Soporte para CSV, XML, YAML, XLIFF e importación directa desde Google Sheets.",
  "li_feature_6": "<strong>Vista Previa en Vivo:</strong> Previsualiza cualquier idioma en la Vista de Escena o en el <strong>Modo Prefab</strong> sin ejecutar el juego.",
  "li_feature_7": "<strong>Soporte de plural y género:</strong> Soporte completo de CLDR (v43). Incluye reglas para <strong>Asian</strong> (Ninguna), <strong>English/Germanic</strong> (Uno, Otro), <strong>French</strong> (Uno 0-1), <strong>Slavic</strong> (Uno, Pocos, Muchos - RU, UK, PL), <strong>Arabic</strong>, <strong>Celtic</strong>, <strong>Baltic</strong> (LT, LV), y más.",
  "li_feature_8": "<strong>Soporte Completo para RTL:</strong> Visualización correcta de idiomas de derecha a izquierda.",
  "li_feature_9": "<strong>Actualizaciones en Vivo:</strong> Carga traducciones actualizadas desde un servidor remoto al inicio del juego.",
  "li_feature_tool_translation": "<strong>Interfaz totalmente traducida:</strong> La interfaz de la herramienta es localizable. Puedes cambiar el idioma del editor usando el menú desplegable en el <strong>encabezado de la ventana principal</strong>.",
  "li_font_global": "<strong>Informe global:</strong> Genera un informe de todos los glifos faltantes en todos los idiomas.",
  "li_font_glyph_analyze": "Analiza todas las traducciones y comprueba si la fuente asignada (TMP_FontAsset) soporta todos los caracteres utilizados.",
  "li_font_glyph_copy": "Permite copiar todos los caracteres únicos de los idiomas para la generación de atlas de fuentes. Incluye <strong>filtros para excluir ASCII, números y puntuación</strong> para optimizar el espacio de textura.",
  "li_font_glyph_missing": "Muestra una lista de glifos faltantes.",
  "li_font_glyph_workflow": "<strong>Flujo de Trabajo para TMP:</strong> 1. Ejecuta Escanear. 2. Selecciona un idioma con glifos faltantes. 3. Haz clic en <strong>'Copy Character Set'</strong>. 4. Abre Window -> TextMeshPro -> Font Asset Creator. 5. Pega el portapapeles en el campo 'Character Sequence (Custom Range)' para generar un atlas que contenga exactamente los caracteres que tu juego necesita.",
  "li_font_unicode": "<strong>Rangos Unicode:</strong> Muestra los rangos Unicode específicos usados en tus traducciones (p.ej., Latin básico, Cirílico) para optimizar los recursos de fuentes.",
  "li_footer_status": "<strong>Estado y Progreso:</strong> Retroalimentación en tiempo real sobre tareas de análisis, importación o generación de IA.",
  "li_header_lang_selector": "<strong>Idioma del Editor:</strong> Cambia el idioma de la interfaz de la herramienta. La UI de la herramienta es totalmente localizable.",
  "li_header_preview_btn": "<strong>Alternar Vista Previa:</strong> Activa o desactiva rápidamente la vista previa en el editor. Usa el botón 'Revert' para restaurar los valores originales de la escena.",
  "li_header_toolbar_buttons": "<strong>Barra de Herramientas Global:</strong> Acceso directo a Documentación, Discord, Settings Asset, Verificador de Dependencias y página de Reseña.",
  "li_install_1": "<strong>IMPORTANTE (Actualización v2.0):</strong> Si actualizas desde v1.x, <strong>DEBES eliminar</strong> la carpeta antigua `Ankonoanko` antes de importar. La versión 2.0 requiere una instalación limpia debido a cambios en los espacios de nombres.",
  "li_install_2": "La herramienta comprobará automáticamente las dependencias necesarias. Confirma la instalación en el cuadro de diálogo que aparece.",
  "li_install_3": "Las dependencias requeridas (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) son necesarias para la funcionalidad básica.",
  "li_install_4": "Las dependencias opcionales (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) activan características adicionales.",
  "li_install_5": "Haz clic en <strong>Install Selected</strong> para instalar los paquetes recomendados.",
  "li_install_6": "Después de la instalación, abre la ventana principal de la herramienta a través del menú <strong>Tools -> Localization Tool</strong>.",
  "li_install_7": "Si planeas usar la carga asíncrona de activos, instala el paquete <strong>Addressables</strong> a través del Gestor de Paquetes.",
  "li_live_updates_1": "<strong>Activar:</strong> en Settings, marca 'Enable Live Updates'.",
  "li_live_updates_2": "<strong>Fuente:</strong> Proporciona una <code>Live Update URL</code> que devuelva un diccionario JSON, o una <code>Google Sheet URL</code>.",
  "li_live_updates_3": "<strong>Caché:</strong> Las traducciones se almacenan en caché localmente en <code>liveUpdateCachePath</code> para asegurar que el juego funcione sin conexión.",
  "li_live_updates_4": "<strong>Seguridad:</strong> Usa la <strong>Runtime API Key</strong> (encriptada) si tu servidor requiere autenticación.",
  "li_localizedtext_1": "<code>localizationKey</code>: La clave usada para encontrar la traducción. Puede ser generada automáticamente o asignada manualmente.",
  "li_localizedtext_2": "<code>isStyleOnly</code>: Si <code>true</code>, el componente solo aplicará estilos (fuente, RTL) pero no cambiará el texto en sí. Crítico para elementos de texto dinámico (p.ej., texto actualizado mediante llamadas `_()` en scripts).",
  "li_localizedtext_3": "<code>originalSourceText</code>: El texto original en el idioma base. Utilizado como reserva (fallback).",
  "li_localizedtext_key_override": "<strong>Sobrescritura Manual de Clave:</strong> Puedes hacer clic en el ícono 'Edit' junto a la clave para introducirla manualmente. Usa 'X' para volver a la generación automática. Esto funciona para <code>LocalizedText</code>, <code>LocalizedDropdown</code> (para cada opción individualmente), y <code>UITKLocalization</code>.",
  "li_localizedtext_search_key": "<strong>Buscar en tabla:</strong> Haz clic en el ícono de lupa para abrir instantáneamente la Tabla de traducción y enfocarte en esa clave específica.",
  "li_migration_csv_details_1": "<strong>Filtrado inteligente:</strong> El importador omite automáticamente filas que parecen rutas de assets (p.ej., <code>.png</code>, <code>.mp3</code>, <code>Assets/...</code>) para mantener limpia tu base de datos de texto.",
  "li_migration_csv_details_2": "<strong>Columna 'Type':</strong> Si existe una columna 'Type' (formato I2), solo se importan las filas marcadas como 'Text' o con tipo vacío. Para importar assets, usa los Perfiles de migración para mapearlos a <code>LocalizedAsset</code>.",
  "li_migration_csv_req_1": "<strong>Columna de clave:</strong> Debe llamarse <code>Key</code> (sin distinción de mayúsculas) o estar definida en tu Perfil de migración.",
  "li_migration_csv_req_2": "<strong>Columnas de idioma:</strong> Cualquier columna no marcada como ignorada se trata como un código de idioma (p.ej., 'en', 'ja', 'English'). La herramienta intenta hacer una coincidencia difusa con los idiomas de tu proyecto.",
  "li_migration_csv_req_3": "<strong>Comentarios:</strong> Las columnas llamadas <code>Desc</code>, <code>Description</code> o <code>Comment</code> se importan como notas de desarrollador. Esta lista es configurable en el <strong>Migration Profile</strong>.",
  "li_migration_custom_1": "Haz clic derecho en la vista de Proyecto -> Crear -> Anko Localization -> Perfil de migración.",
  "li_migration_custom_2": "<strong>Reglas:</strong> Define reglas de conversión (si [Source Component] con [Context Filter], entonces convertir a [Target Component]). Las reglas admiten <strong>Priority</strong> (los números más altos se procesan primero), <strong>Harvest Assets</strong> (extrae y registra automáticamente los assets referenciados como Sprites o Audio), y <strong>Context Filtering</strong> para distinguir entre múltiples componentes en el mismo objeto.",
  "li_migration_fallback_keys": "<strong>Campos de clave de reserva:</strong> Especifique nombres de campo adicionales para comprobar al extraer claves de componentes heredados. Útil si su sistema anterior usa nombres de propiedad no estándar para las claves.",
  "li_migration_gs_1": "<strong>Acceso:</strong> La hoja debe estar compartida ('Cualquiera con el enlace puede verla') o publicada en la web.",
  "li_migration_gs_2": "<strong>Pestañas de hoja (GID):</strong> La URL debe incluir el parámetro <code>gid=...</code>. Esto indica a la herramienta exactamente qué pestaña leer (p.ej., <code>gid=0</code> suele ser la primera pestaña/hoja).",
  "li_migration_ignored_headers": "<strong>Encabezados CSV ignorados:</strong> Defina columnas que deben omitirse durante la importación (p.ej., 'Type', 'Description'). Esto evita que la herramienta trate columnas de metadatos como datos de idioma.",
  "li_migration_legacy_components": "<strong>Componentes heredados adicionales:</strong> Enumere manualmente los nombres de componentes que la herramienta debe detectar como 'legacy' durante el escaneo de migración, incluso si no se define una regla de conversión directa.",
  "li_migration_profile_details": "<strong>Configuración Avanzada del Perfil:</strong><ul><li><code>CsvKeyHeader</code>: El nombre del encabezado para la columna de Clave.</li><li><code>CsvCommentHeaders</code>: Lista de encabezados a tratar como notas/comentarios de desarrollador.</li><li><code>IgnoredCsvHeaders</code>: Columnas a omitir (metadatos como 'Type' o 'Status') para evitar que se consideren como idiomas.</li><li><code>AssetExtensions</code>: Tipos de archivo reconocidos como assets durante el escaneo.</li><li><code>FallbackKeyFields</code>: Nombres de campos adicionales a comprobar si el campo de clave principal está vacío.</li></ul>",
  "li_migration_rule_fields": "<strong>Configuración de Regla:</strong><ul><li><code>Priority</code>: Los valores más altos se procesan primero. Úsalo para manejar casos específicos antes que los genéricos.</li><li><code>Context Filter</code>: Aplica la regla solo si un componente específico (p.ej., <code>Text</code>) está presente en el mismo objeto.</li><li><code>Harvest Assets</code>: Si está habilitado, extrae el asset actual (p.ej., Sprite) del componente heredado y lo registra en la tabla de assets.</li><li><code>Asset Field Path</code>: Ruta al campo que contiene la referencia al asset para la recolección.</li><li><code>Additional Data Path</code>: Utilizado para componentes complejos como Dropdowns para recolectar múltiples valores/opciones.</li></ul>",
  "li_migration_stubs_1": "<strong>Problema:</strong> Eliminaste los assets del plugin antiguo. Unity detecta scripts faltantes (p.ej., componente <code>Localize</code> ausente). El editor entra en modo de error de compilación.",
  "li_migration_stubs_2": "<strong>Solución:</strong> La función 'Emergency Stubs' genera clases ligeras y vacías con los mismos nombres y espacios de nombres exactos que el plugin antiguo. Esto satisface al compilador.",
  "li_migration_stubs_3": "<strong>Flujo de Trabajo:</strong> 1. Haz clic en <strong>Enable Emergency Stubs</strong> (esto agrega <code>ANKO_ENABLE_MIGRATION_STUBS</code> a la Configuración del Proyecto). 2. Elimina la carpeta del plugin antiguo. 3. Unity recompila con éxito usando clases falsas. 4. Ejecuta el <strong>Component Converter</strong> para reemplazar los stubs con componentes oficiales. 5. Haz clic en <strong>Disable Stubs</strong> una vez completada la refactorización.",
  "li_migration_tool_converter": "<strong>Paso 2: Conversor de Componentes:</strong> Escanea escenas y prefabs. Reemplaza automáticamente los componentes antiguos (p. ej., <code>Localize</code>) por <code>LocalizedText</code> / <code>LocalizedAsset</code>, transfiriendo las claves.",
  "li_migration_tool_fields": "<strong>Configuración de perfil:</strong> Tipo configurable 'Source Plugin' y reglas de 'Asset Mapping' garantizan la transferencia correcta de texturas y audio.",
  "li_migration_tool_import": "<strong>Paso 1: Importación de Datos:</strong> Importa archivos CSV (I2) o XLIFF (Unity Loc) para crear una base de datos de claves.",
  "li_migration_tool_profiles": "<strong>Perfiles de migración:</strong> Crea perfiles personalizados para mapear activos y configuraciones de plugins de terceros (I2, Unity Loc).",
  "li_migration_tool_safemode": "<strong>Modo Seguro y Stubs de Emergencia:</strong> Los componentes se desactivan en lugar de eliminarse. Incluye la característica crítica <strong>Emergency Stubs</strong> (activada mediante el símbolo de definición <code>ANKO_ENABLE_MIGRATION_STUBS</code>): genera clases falsas de marcador de posición para I2 Localization o Unity Localization para que tu proyecto pueda compilar inmediatamente después de eliminar esos plugins. Esto evita errores como \"The type name 'Localize' could not be found\" y te da tiempo para refactorizar correctamente tu código y usar el nuevo sistema. Enable Stubs permite corregir errores de compilación tras eliminar el plugin de localización antiguo.",
  "li_migration_tool_setup": "<strong>Paso 0: Configuración:</strong> Configura los nombres de los componentes (p. ej., <code>Localize</code> para I2) y los campos donde se almacena la clave. Hay preajustes disponibles.",
  "li_migration_workflow_1": "<strong>1. Copia de seguridad:</strong> Confirma tu proyecto en el control de versiones (Git) o haz una copia de seguridad de archivos antes de comenzar.",
  "li_migration_workflow_2": "<strong>2. Habilitar Stubs:</strong> Abre la Herramienta de Migración -> pestaña 'Safe Mode'. Haz clic en <strong>Enable Emergency Stubs</strong> para tu sistema objetivo (I2/UnityLoc). Esto crea clases falsas ligeras en tu proyecto.",
  "li_migration_workflow_3": "<strong>3. Eliminar plugin antiguo:</strong> Elimina la carpeta del plugin antiguo (p.ej., 'Assets/Plugins/I2'). Unity recompilará. Gracias a Stubs, <strong>NO</strong> obtendrás errores de 'Type not found', preservando todas tus referencias de componentes en prefabs.",
  "li_migration_workflow_4": "<strong>4. Importar datos:</strong> En la pestaña 'Import Data', carga tu CSV/XLIFF de origen. Verifica la vista previa y haz clic en <strong>Import</strong>. Esto rellena las tablas de traducción de AnKo.",
  "li_migration_workflow_5": "<strong>5. Convertir componentes:</strong> En la pestaña 'Component Converter', selecciona 'Entire Project' y haz clic en <strong>Scan & Convert</strong>. La herramienta reemplaza los stubs antiguos con componentes 'LocalizedText'/'LocalizedAsset', transfiriendo las claves.",
  "li_migration_workflow_6": "<strong>6. Limpieza:</strong> Una vez que todo funcione, haz clic en <strong>Disable Stubs</strong> y permite que Unity recompile nuevamente.",
  "li_notes_1": "<strong>Copias de Seguridad:</strong> Crea siempre una copia de seguridad a través de <strong>Translation Table Editor -> Manage Backups</strong> antes de realizar cambios importantes. Las copias de seguridad se almacenan en la carpeta <code>LocalizationBackups</code> <strong>en la raíz del proyecto (fuera de la carpeta Assets)</strong> para mantener limpio tu proyecto de Unity y reducir los tiempos de importación.",
  "li_notes_2": "<strong>Seguridad de la Clave API:</strong> La clave para trabajar en el editor se almacena localmente en tu máquina (en <code>EditorPrefs</code>) y no entra en el repositorio. Para las claves necesarias en la build del juego, utiliza la sección <strong>Runtime API Key</strong>.",
  "li_notes_3": "<strong>Carpeta <code>StreamingAssets</code>:</strong> Los archivos de traducción deben estar en una subcarpeta de <code>Assets/StreamingAssets/</code> para ser incluidos en la build del juego.",
  "li_notes_4": "<strong>\"A prueba de fallos\":</strong> La herramienta te protege automáticamente de guardar accidentalmente datos temporales del modo de vista previa en una escena o prefab.",
  "li_notes_5": "<strong>Rendimiento:</strong> La llamada <code>_()</code> es rápida, pero en bucles que se ejecutan en cada frame (p. ej., en <code>Update</code>), intenta almacenar el resultado en caché en una variable.",
  "li_notes_6": "<strong>Excluir <code>LanguageSelector</code> del análisis:</strong> El objeto con el componente <code>LanguageSelector</code> y su <code>TMP_Dropdown</code> deben añadirse a la lista <strong>Ignore Specific Objects</strong> en la pestaña <strong>Content</strong>. Esto es necesario para evitar que el analizador cree claves adicionales para las opciones desplegables, ya que el script <code>LanguageSelector</code> las rellena dinámicamente en tiempo de ejecución. Ignorar previene conflictos y mantiene limpios los archivos de traducción.",
  "li_notes_7": "<strong>Fuentes para <code>LanguageSelector</code>:</strong> Para que el idioma seleccionado en el <code>TMP_Dropdown</code> actualice correctamente su fuente, añade manualmente un componente <code>LocalizedText</code> vacío al objeto <strong>Label</strong> hijo del Dropdown y marca la casilla <code>isStyleOnly</code>.",
  "li_notes_addressables_code": "<strong>Código y Addressables:</strong> Si cambias al modo <strong>Addressables (Async)</strong>, DEBES usar <code>GetLocalizedAssetAsync<T>()</code> en tus scripts. Llamar al síncrono <code>GetLocalizedAsset<T>()</code> devolverá null y registrará una advertencia para evitar bloqueos del hilo principal.",
  "li_notes_addressables_sync_warning": "<strong>Síncrono vs Asíncrono:</strong> Si cambias al modo <strong>Addressables (Async)</strong>, DEBES actualizar tu código para usar <code>GetLocalizedAssetAsync<T>()</code>. Llamar al método síncrono devolverá null y registrará una advertencia para evitar congelar el hilo principal.",
  "li_preview_1": "<strong>Cómo funciona:</strong> Selecciona un idioma de la lista, y la herramienta aplicará instantáneamente las traducciones, fuentes, configuraciones RTL y activos correspondientes a todos los objetos localizables en la escena activa o prefab abierto.",
  "li_preview_2": "<strong>Marcadores de Posición:</strong> Si se selecciona un estilo de marcador de posición (p. ej., <strong>Accents</strong> o <strong>Brackets</strong>) en la pestaña <strong>Settings</strong>, estos marcadores de posición se mostrarán en el modo de vista previa en lugar de las traducciones reales. Esto es ideal para probar el diseño y encontrar elementos no localizados.",
  "li_preview_3": "<strong>Seguridad:</strong> Todos los cambios realizados en el modo de vista previa son temporales. La herramienta revertirá automáticamente todo a su estado original cuando selecciones \"<strong>Revert to Original</strong>\", cierres la ventana, cambies de escena o antes de guardar una escena/prefab (gracias al componente <code>LocalizationPreviewProtector</code>).",
  "li_preview_4": "<strong>Protección contra Fallos:</strong> El sistema hace una copia de seguridad automática del estado de la escena en la carpeta <code>Library</code> antes de la vista previa. Si Unity falla o cierras forzosamente mientras previsualizas, la herramienta detecta el archivo de recuperación en el siguiente inicio y ofrece restaurar el estado original de la escena.",
  "li_preview_overlay_1": "<strong>Acceso:</strong> La superposición aparece automáticamente en la Vista de Escena. Puedes alternarla mediante el menú Unity Overlay (<code>Space</code> key in Scene View).",
  "li_preview_overlay_2": "<strong>Funcionalidad:</strong> Proporciona un menú desplegable para cambiar rápidamente el Idioma de Vista Previa actual sin abrir la ventana principal.",
  "li_report_1": "<strong>Categorías:</strong> Todas las Claves, Añadidas, Actualizadas (texto cambiado), Eliminadas, Duplicadas, Migradas, Omitidas (sin cambios).",
  "li_report_2": "<strong>Búsqueda Avanzada:</strong> Haz clic en el botón <strong>Find</strong> junto a cualquier entrada para encontrar instantáneamente el objeto correspondiente en el proyecto. La búsqueda funciona de forma asíncrona, no bloquea el editor y busca en todas las escenas y prefabs.",
  "li_report_all_keys": "<strong>Todas las Claves:</strong> Una lista de todas las claves de localización detectadas en el proyecto con opciones de búsqueda y filtrado.",
  "li_report_btn_clear": "<strong>Borrar Informe:</strong> Elimina todos los resultados del escaneo de la memoria de la sesión actual.",
  "li_report_btn_copy_all": "<strong>Copiar Todas las Claves:</strong> Copia todas las claves de localización de la categoría actual al portapapeles del sistema.",
  "li_report_btn_load_last": "<strong>Cargar Último Escaneo:</strong> Restaura instantáneamente los resultados del análisis de proyecto más reciente sin volver a escanear.",
  "li_report_btn_save": "<strong>Guardar Informe:</strong> Exporta los resultados del escaneo actual a un archivo de texto o CSV para documentación o auditoría externa.",
  "li_report_source_filter": "<strong>Filtro de Origen:</strong> Restringe los resultados por su origen (p.ej., mostrar solo claves encontradas en Scripts, Scenes o Prefabs).",
  "li_safety_global_limit": "<strong>Límite mensual global:</strong> El <code>monthlyCharLimit</code> (por defecto: 500,000 caracteres) actúa como un disyuntor para todas las solicitudes. Puedes alternar advertencias mediante <code>enableApiLimitWarning</code>.",
  "li_safety_profile_limit": "<strong>Límites de perfil:</strong> Cada Translation Profile permite establecer su propio 'Max Chars Per Request' y 'Batch Size'.",
  "li_settings_1": "<strong>Modo de Generación de Claves:</strong> Define la estrategia para crear identificadores únicos para tu texto:<ul><li><code>AutoGenerateKeysOnly</code> <strong>(Predeterminado - Recomendado)</strong>: Genera claves basadas en el nombre de la escena/prefab y la jerarquía del objeto (p.ej., <code>scene_Menu_BtnPlay_682412</code>). Ideal para proyectos grandes ya que garantiza unicidad y es inmune a cambios de texto.</li><li><code>UseTextAsKey</code>: Usa el texto original como clave (p.ej., \"Start Game\" → <code>Start Game</code>). Ideal para prototipado rápido donde las claves deben ser legibles por humanos.</li><li><code>AutoGenerateWithCustomKeys</code> <strong>(Híbrido)</strong>: El modo más flexible. Primero verifica si un componente ya tiene una clave asignada manualmente o un <code>[LocalizableField(key=\"...\")]</code>. Si no existe clave, genera una jerárquica. <em>Usa esto para preservar el trabajo existente mientras automatizas contenido nuevo.</em></li><li><code>UseTextAsKeyWithCustomPriority</code> <strong>(Híbrido)</strong>: Similar al anterior, pero recurre al texto mismo si no se encuentra una clave manual. Respeta los componentes y datos existentes.</li><li><code>Manual</code>: El escáner nunca crea nuevas claves. Solo actualiza objetos que ya tienen un componente de localización con una clave. Perfecto para control manual estricto.</li></ul>",
  "li_settings_10": "<strong>Dev Tools:</strong> En la parte inferior de la pestaña Settings, puedes encontrar botones de utilidad como <strong>Clear Saved Language Pref</strong> (restablece el idioma guardado en PlayerPrefs para que el juego comience de nuevo con el idioma Predeterminado).",
  "li_settings_11": "<strong>Technical Dropdown Options:</strong> Una lista de valores de cadena (valores predeterminados: 'Option A', 'Option B', 'Option C') que el analizador <strong>ignorará</strong> al escanear Dropdowns. Esto mantiene limpia tu tabla de traducción del texto de marcador de posición de UI predeterminado de Unity.",
  "li_settings_2": "<strong>Language Management:</strong><ul><li><strong>Source Language:</strong> El idioma utilizado en tus escenas/prefabs de Unity (idioma de desarrollo).</li><li><strong>Default Language:</strong> El idioma seleccionado en el primer inicio del juego si el idioma del sistema del usuario no es compatible.</li><li><strong>List:</strong> Gestiona los idiomas admitidos, asigna <strong>Font Assets</strong> específicos y habilita el soporte <strong>RTL</strong>.</li></ul>",
  "li_settings_3": "<strong>Configuración General:</strong> Configuración del comportamiento a nivel de proyecto:<ul><li><code>Translations Save Path</code>: El directorio raíz donde se almacenan los archivos de traducción <code>.json</code>. Para acceso en tiempo de ejecución, debe estar dentro de <code>Assets/Resources</code> o <code>Assets/StreamingAssets</code>.</li><li><code>Safe Mode</code>: Una capa de protección que bloquea operaciones (como Auto‑Translate) si se detectan inconsistencias del proyecto o dependencias faltantes.</li><li><code>Remove Missing Keys</code>: Si está habilitado, el escáner eliminará automáticamente entradas de la base de datos que ya no estén presentes en ninguna escena o prefab durante la actualización del proyecto.</li><li><code>Parse Inactive Objects</code>: Determina si la herramienta debe escanear y localizar GameObjects desactivados u ocultos.</li><li><code>Parse All Prefabs</code>: Escanea cada prefab del proyecto. Si está desactivado, solo se procesan los prefabs en carpetas especificadas en la pestaña <strong>Content</strong>.</li><li><code>Fill Comments By Paths</code>: Rellena automáticamente el campo 'Comment' en la tabla de traducción con la ruta de jerarquía de la escena/prefab del objeto.</li><li><code>Split Files by Language</code>: Divide la base de datos de traducción en varios archivos (p.ej., <code>en.json</code>, <code>ja.json</code>). Altamente recomendado para proyectos grandes para reducir la carga de memoria en tiempo de ejecución.</li><li><code>Allow Empty Source/Keys</code>: Permite que la herramienta registre y rastree objetos incluso si su texto fuente está vacío. Útil para texto dinámico que se establece exclusivamente mediante código.</li><li><code>Attach to Regex-Ignored Text</code>: Obliga a la herramienta a añadir componentes de localización a objetos cuyo texto coincide con una expresión regular de exclusión (como números), permitiendo una sobrescritura manual.</li><li><code>Find Settings Asset</code>: Un botón de utilidad que localiza e selecciona instantáneamente el archivo <code>LocalizationSettings.asset</code> en la ventana del Proyecto.</li></ul>",
  "li_settings_4": "<strong>Depuración y Pruebas:</strong><ul><li><code>Placeholder Style</code>: Elige el estilo para mostrar marcadores de posición en el modo de vista previa.</li><li><code>Pseudo-Localization</code>: Selecciona <strong>'Custom Pseudo'</strong> para revelar configuraciones avanzadas de prueba de diseño (Factor de Expansión, Acentos y Delimitadores).</li></ul>",
  "li_settings_5": "<strong>Live Updates:</strong> Configuración para cargar traducciones desde un servidor remoto.",
  "li_settings_6": "<strong>Clave API en tiempo de ejecución:</strong> Almacena de forma segura tu clave API para <strong>Live Updates</strong> (obtener nuevas traducciones en el juego). Esto es diferente de las claves del Servicio de Traducción usadas en el Editor. La clave está <strong>ofuscada</strong> (encriptada) en la compilación para evitar su extracción fácil mediante búsqueda de texto, pero recuerda: ningún secreto del lado del cliente es 100% seguro.",
  "li_settings_7": "<strong>Estrategia de carga de activos:</strong> Elección entre <code>Resources (Legacy)</code>, <code>Addressables (Async)</code> y <code>Custom</code>. Advertencia: Cambiar este modo requiere volver a escanear el proyecto. El modo Addressables se recomienda encarecidamente para móvil y WebGL para reducir el uso de memoria.",
  "li_settings_8": "<strong>Auto‑Traducción:</strong> Utiliza el sistema de <strong>Translation Profiles</strong> para localización impulsada por IA. La configuración incluye:<ul><li><code>Text & Audio Profiles</code>: Selecciona o crea perfiles ScriptableObject para configurar diferentes servicios (p.ej., OpenAI, DeepL, Google).</li><li><code>Presets Folder</code>: El directorio donde se almacenan tus presets y perfiles de traducción.</li><li><code>Target Languages</code>: Una lista de todos los idiomas del proyecto con estado en tiempo real, barras de progreso y recuento de caracteres para el perfil seleccionado.</li><li><code>Start Auto Translation</code>: Inicia el proceso para todos los idiomas seleccionados usando los perfiles especificados.</li></ul>",
  "li_settings_9": "<strong>Mejoras de Depuración:</strong><ul><li><code>Show Hierarchy Icons</code>: Muestra íconos de estado (Marca Verde / Advertencia Amarilla) en la jerarquía. <strong>Performance Optimized:</strong> Usa caché para asegurar cero latencia incluso en escenas grandes.</li><li><code>Show Scene View Labels</code>: Depuración visual directamente en la Vista de Escena. Las etiquetas son interactivas: Haz clic derecho en cualquier etiqueta de escena para copiar instantáneamente la clave de localización al portapapeles.</li></ul>",
  "li_settings_asset_folder_rule": "<strong>Regla de Estructura de Carpetas:</strong> Define cómo se estructuran las subcarpetas al generar assets localizados (p.ej., <code>{lang}/{category}</code>).",
  "li_settings_bridge_name": "<strong>Nombre de la Clase Bridge:</strong> Permite personalizar el nombre de la clase estática generada (por defecto es <code>AnkoLoc</code>).",
  "li_settings_general_safe_mode": "<strong>Modo Seguro:</strong> Garantiza que las operaciones críticas no se ejecuten si pueden causar estados de proyecto inconsistentes.",
  "li_settings_icons_legend": "<strong>Leyenda de Iconos de Jerarquía:</strong><br>🟢 (Tick Verde): Localizado y Clave establecida.<br>🔴 (Error Rojo): Componente localizado presente, pero <strong>falta la Clave</strong>.<br>🟡 (Advertencia Amarilla): Componente Text/Image encontrado, pero <strong>no hay componente de Localización</strong> adjunto.<br>🐛 (Error): Objeto <strong>Ignorado</strong> por la configuración.",
  "li_settings_lang_culture_fallback": "<strong>Usar Fallback de Cultura:</strong> Si falta un dialecto regional específico (p.ej., <code>en-AU</code>), la herramienta intentará usar el idioma base (<code>en</code>) antes de recurrir al <strong>Default Language</strong>.",
  "li_settings_lang_follow_system": "<strong>Seguir el Idioma del Sistema:</strong> Cambia automáticamente el idioma del juego para que coincida con el idioma del SO del jugador en el primer lanzamiento.",
  "li_settings_live_updates_security": "<strong>Seguridad:</strong> Las claves API en tiempo de ejecución están encriptadas (AES) en la compilación para evitar extracción casual. Siempre usa HTTPS.",
  "li_settings_pseudo_accents": "<strong>Usar Acentos:</strong> Reemplaza caracteres estándar por versiones acentuadas (p.ej., <code>å</code>, <code>é</code>). Usa esto para asegurar que tus fuentes soporten todos los glifos requeridos.",
  "li_settings_pseudo_brackets": "<strong>Agregar Corchetes:</strong> Envuelve el texto en <code>[ ]</code> para verificar el inicio y fin de las cadenas localizadas, ayudando a identificar problemas de truncamiento o concatenación.",
  "li_settings_pseudo_expand_length": "<strong>Expandir Longitud:</strong> Simula la expansión de texto típica en idiomas como alemán o ruso añadiendo caracteres al final.",
  "li_settings_pseudo_expansion_factor": "<strong>Factor de Expansión:</strong> Multiplicador para la simulación de longitud de texto (p.ej., 2.0 hará que el texto sea el doble de largo).",
  "li_settings_pseudo_prefix": "<strong>Prefijo Personalizado:</strong> Añade una cadena específica (p.ej., <code>PSEUDO-</code>) al inicio de cada texto localizado.",
  "li_settings_pseudo_suffix": "<strong>Sufijo Personalizado:</strong> Añade una cadena específica al final de cada texto localizado.",
  "li_settings_return_source": "<strong>Devolver Fuente si Falta:</strong> Si está habilitado, el sistema devolverá el texto en el idioma fuente (o la propia clave) si no se encuentra traducción para el idioma actual.",
  "li_settings_tms_timeout": "<strong>Tiempo de Espera TMS:</strong> Especifica el tiempo máximo de espera (en segundos) para solicitudes de red a servicios TMS externos.",
  "li_settings_tool_check_deps": "<strong>Verificar Dependencias:</strong> Vuelve a escanear el proyecto en busca de paquetes requeridos (como Newtonsoft) e integraciones opcionales.",
  "li_settings_tool_cleanup": "<strong>Limpieza Completa del Proyecto:</strong> Una herramienta destructiva que elimina todos los componentes y datos de Anko Localization del proyecto (¡usar con precaución!).",
  "li_settings_tool_clear_prefs": "<strong>Borrar Preferencias de Idioma:</strong> Restablece el idioma guardado en PlayerPrefs, obligando al juego a usar el idioma predeterminado o del sistema en el próximo lanzamiento.",
  "li_settings_tool_font_manager": "<strong>Gestor de Fuentes:</strong> Abre el Gestor de Fuentes y Glifos para analizar caracteres faltantes y generar assets de fuentes optimizados.",
  "li_settings_tool_migration": "<strong>Herramienta de Migración:</strong> Facilita mover datos y componentes de I2 Localization o Unity Localization.",
  "li_settings_tool_test_center": "<strong>Centro de Pruebas de Localización:</strong> Una herramienta de diagnóstico para verificar la salud del proyecto, comprobar referencias rotas y asegurar la integridad de la localización.",
  "li_setup_1": "<strong>Crear Configuración:</strong> Al abrir por primera vez, la herramienta creará un archivo <code>LocalizationSettings.asset</code> en la carpeta <code>Assets/Resources</code>.",
  "li_setup_2": "<strong>Configurar idiomas y modo:</strong> En la pestaña <strong>Settings</strong>, asegúrese de que su <strong>Source Language</strong> sea correcta. Además, verifique el <strong>Key Generation Mode</strong> (el predeterminado es <code>AutoGenerateKeysOnly</code>, que se recomienda para la mayoría de los proyectos).",
  "li_setup_3": "<strong>Especificar Contenido para Analizar:</strong> En la pestaña <strong>Content</strong>, añade todas las escenas para el análisis a la lista <strong>Scenes to Parse</strong>. Si utilizas prefabs con texto, asegúrate de que sus carpetas se añadan a <strong>Prefab Folders</strong>.",
  "li_setup_4": "<strong>Primera Ejecución del Analizador:</strong> Ve a la pestaña <strong>Actions</strong> y haz clic en el botón <code>Update Keys</code>. La herramienta escaneará tu proyecto, creará archivos de traducción y añadirá automáticamente los componentes necesarios (<code>LocalizedText</code>, <code>LocalizedAsset</code>, etc.) a los objetos de juego.",
  "li_setup_5": "<strong>Configuración y Builds (CRÍTICO):</strong> La herramienta añade automáticamente <code>LocalizationSettings.asset</code> a <code>Project Settings -> Player -> Preloaded Assets</code>. <br>⚠️ <strong>Comprobación de Seguridad:</strong> Si la configuración falta en Preloaded Assets y no está en una carpeta Resources, la herramienta <strong>bloqueará la build</strong> con una <code>BuildFailedException</code> para evitar que el juego se bloquee al inicio.",
  "li_sidebar_presets": "<strong>Presets de Búsqueda:</strong> Filtros predefinidos para tareas comunes como encontrar cadenas sin traducir o claves con marcadores faltantes.",
  "li_sidebar_search": "<strong>Búsqueda Global:</strong> Busca claves o texto específicos en todas las tablas de tu proyecto.",
  "li_tms_crowdin": "<strong>Crowdin:</strong> Requiere ID de proyecto y clave API. Soporta la carga del XLIFF de origen y la descarga de traducciones como un archivo ZIP. <em>Avanzado:</em> <code>File Name</code> (la ruta de destino en Crowdin).",
  "li_tms_loco": "<strong>Loco (localise.biz):</strong> Requiere clave API. Integración simple y rápida para proyectos más pequeños. <em>Avanzado:</em> <code>Import/Export Params</code> (permite agregar banderas adicionales de la API de Loco como <code>&tag=v1</code> o <code>&status=translated</code>).",
  "li_tms_phrase": "<strong>Phrase:</strong> Gestión de localización de nivel empresarial. <em>Avanzado:</em> <code>Update Translations/Descriptions</code> banderas para controlar si Phrase sobrescribe los datos existentes al subir.",
  "li_tms_transifex": "<strong>Transifex (v3):</strong> Soporta slugs de organización/proyecto y autenticación con token API. <em>Avanzado:</em> <code>Resource Slug</code> (crea automáticamente el recurso si no existe).",
  "li_tutorials_1": "<strong>Aprendizaje interactivo:</strong> Las guías resaltan elementos UI específicos y esperan sus acciones.",
  "li_tutorials_2": "<strong>Lecciones disponibles:</strong>",
  "li_tutorials_editor": "<strong>Editor de traducción:</strong> Funciones avanzadas del editor tipo hoja de cálculo.",
  "li_tutorials_list": "<strong>Lista de tutoriales:</strong> Accede a guías interactivas de las funciones principales de la herramienta.",
  "li_tutorials_migration": "<strong>Migración:</strong> Cómo pasar de otros sistemas de localización (I2, Unity Localization).",
  "li_tutorials_quickstart": "<strong>Inicio rápido:</strong> Configuración básica para texto y recursos.",
  "li_tutorials_size": "<strong>Tamaño del tutorial:</strong> Ajusta la escala de la UI y la verbosidad de las guías interactivas (Compacto a Extra Grande). Ubicado en el encabezado de la pestaña Tutoriales.",
  "li_vis_debug_1": "<strong>Iconos de jerarquía:</strong> Detecta instantáneamente problemas (Clave faltante, Componente faltante). Optimizado para no impactar el rendimiento.",
  "li_vis_debug_2": "<strong>Etiquetas de Vista de Escena:</strong> Muestra la clave sobre cada objeto localizado. <strong>Click derecho</strong> en una etiqueta para 'Copy Key' o 'Select Object'.",
  "li_vis_debug_3": "<strong>Superposiciones:</strong> Usa la superposición de la vista de escena (barra espaciadora) para cambiar los idiomas de vista previa al instante.",
  "lightbox_aria_close": "Cerrar visor de imágenes",
  "lightbox_image_alt": "Vista ampliada",
  "mindmap_edge_configure": "1. Configurar",
  "mindmap_edge_creates_components": "Crea Componentes",
  "mindmap_edge_defines_rules": "Define reglas para",
  "mindmap_edge_edited_in": "Editado en",
  "mindmap_edge_enables_reaction": "Habilita la reacción a través de",
  "mindmap_edge_extends": "Amplía",
  "mindmap_edge_generates": "Genera",
  "mindmap_edge_manages_assets": "Gestiona activos para",
  "mindmap_edge_opens": "Abre",
  "mindmap_edge_parse_project": "3. Analizar Proyecto",
  "mindmap_edge_processed_by": "Procesado por",
  "mindmap_edge_recommends_for": "Recomienda para",
  "mindmap_edge_relates_to": "Se relaciona con",
  "mindmap_edge_reports_on": "Informa sobre",
  "mindmap_edge_see_faq": "Ver FAQ",
  "mindmap_edge_specify_content": "2. Especificar Contenido",
  "mindmap_edge_warns_about": "Advierte sobre",
  "mindmap_node_ai_ecosystem": "Ecosistema de IA",
  "mindmap_node_async_code": "Asíncrono / Addressables",
  "mindmap_node_dev_tools": "Herramientas y Utilidades",
  "mindmap_node_tms_integration": "Integración de TMS",
  "mindmap_preset_ai": "IA y Automatización",
  "mindmap_preset_dev": "Flujo de Trabajo del Desarrollador",
  "mindmap_preset_full": "Vista Completa",
  "mindmap_preset_quick_start": "Inicio Rápido",
  "mindmap_preset_tools": "Herramientas e Integraciones",
  "mindmap_preset_translator": "Flujo de Trabajo del Traductor",
  "mindmap_toggle_title": "Mostrar Mapa Mental",
  "my_notes_title": "Mis Notas",
  "no_notes_message_new": "Pasa el ratón sobre el texto para añadir una nota.",
  "notes_add_title": "Añadir una nota a este bloque",
  "notes_close_title": "Cerrar",
  "notes_delete_title": "Eliminar nota",
  "notes_edit_text": "Editar",
  "notes_edit_title": "Editar nota",
  "notes_goto_title": "Ir al texto",
  "notes_placeholder": "Tu nota...",
  "on_this_page_title": "En Esta Página",
  "p_actions_1": "La pestaña de trabajo principal.",
  "p_ai_assistant": "En el Editor de la Tabla de Traducción, ahora puedes ejecutar comandos de IA personalizados en las celdas seleccionadas a través del menú contextual (Clic derecho -> AI: ...).",
  "p_ai_audio_economy": "<strong>Ahorro de Costes:</strong> La herramienta calcula un hash MD5 de tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus créditos de API. Si cambias una traducción, el sistema marca solo ese archivo de audio específico como 'Outdated'. Usa 'Generate Missing/Outdated' para regenerar solo lo que cambió, ahorrando créditos de API. La herramienta hashea tu texto y solo regenera los archivos de audio si el texto de origen ha cambiado, ahorrando tus créditos de API a través de lotes inteligentes.",
  "p_ai_context": "Para mejorar la calidad de la traducción, la IA ahora recibe contexto adicional:",
  "p_ai_intro": "La herramienta usa un sistema de <strong>Translation Profile</strong> (ScriptableObject). Esto mantiene la configuración del servicio de traducción en activos de perfil individuales, permitiéndote cambiar configuraciones fácilmente.",
  "p_api_snippets_intro": "El <code>LocalizationManager.cs</code> proporciona una API robusta para la gestión de localización en tiempo de ejecución. A continuación se presentan los métodos clave que usarás en tus scripts.",
  "p_assets_1": "Esta pestaña está dedicada por completo a la localización de recursos no textuales.",
  "p_async_api": "Al usar Addressables, los activos no se cargan instantáneamente. Debes usar la API asíncrona para evitar caídas de fotogramas.",
  "p_bridge_description": "La herramienta incluye un generador de clases estáticas para el acceso a claves, lo que le permite usar referencias tipadas fuertemente en lugar de cadenas mágicas. Esto ayuda a prevenir errores tipográficos y habilita la autocompleción del IDE.",
  "p_bridge_usage_title": "Ejemplo de uso:",
  "p_components_intro": "Estos componentes son el \"puente\" entre tus objetos en la escena y la base de datos de traducción. \"Escuchan\" los cambios de idioma y sustituyen automáticamente el texto o activo correcto.",
  "p_content_1": "Aquí le dices a la herramienta dónde buscar exactamente el texto. La interfaz ha sido completamente rediseñada para una mejor usabilidad.",
  "p_custom_ai": "El tipo de servicio <strong>Custom AI</strong> te permite conectar cualquier LLM a través de la API REST.",
  "p_custom_asset_provider_1": "Desarrollar un proveedor personalizado le permite integrar su propio sistema de gestión de activos (p. ej., un cargador de nube personalizado, un sistema interno de empaquetado específico o un repositorio de activos impulsado por base de datos) directamente en el flujo de trabajo de localización.",
  "p_custom_asset_provider_intro": "El sistema Asset Provider abstrae cómo se cargan los assets (Sprites, Audio, Prefabs, etc.) en tiempo de ejecución. Utiliza un <strong>Plugin Registry</strong> que descubre automáticamente cualquier implementación de clase de <code>IAssetProvider</code> marcada con el atributo <code>[AssetProviderPlugin]</code>. Esto permite una integración fluida de sistemas de carga personalizados (como cargadores en la nube o empaquetado interno) sin modificar el núcleo del toolkit.",
  "p_custom_attributes_description": "Además de las llamadas a funciones, puede marcar cualquier campo de cadena en sus scripts como localizable usando atributos personalizados. Por defecto, la herramienta reconoce <code>[LocalizableField]</code>, pero puede agregar cualquier nombre de atributo (como <code>[Header]</code> o <code>[Tooltip]</code>) a la lista de <strong>Attributes to Scan</strong>.",
  "p_custom_parser_1": "Puedes ampliar fácilmente el sistema para admitir componentes personalizados creando tu propia clase de analizador.",
  "p_editor_1": "Se abre a través de <strong>Tools -> Localization -> Translation Table Editor</strong>. Esta es la herramienta principal para editar traducciones manualmente.",
  "p_example_attribute_1": "La forma más poderosa de localizar variables de script. Funciona con campos <strong>private, protected y public</strong>. El analizador maneja recursivamente <strong>Matrices, Listas</strong> y <strong>Clases serializables anidadas</strong>. Incluso puede generar claves para otros atributos (como <code>[Header]</code> o <code>[Tooltip]</code>) si está configurado en Configuraciones.",
  "p_example_components_1": "El proyecto incluye scripts listos para usar que sirven como excelentes ejemplos.",
  "p_example_components_updated": "El código ha cambiado. La carga del idioma (especialmente al usar Addressables) ahora es asíncrona.",
  "p_example_function_1": "Utiliza la función <code>_()</code> para texto dinámico que cambia durante el juego. El método que actualiza la UI debe estar marcado con el atributo <code>[OnLanguageChange]</code> para que se llame automáticamente cuando se cambie el idioma. Se añadirá automáticamente un componente <code>LocalizedBehaviour</code> al objeto para este propósito.",
  "p_example_plurals_1": "La herramienta ahora utiliza reglas más precisas para diferentes grupos de idiomas.",
  "p_font_glyph_manager_access": "Acceso a través de <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "p_intro_1": "Esta herramienta es una solución integral para localizar juegos y aplicaciones en Unity. Automatiza el proceso de recolección de texto y activos, gestiona las traducciones a través de una potente interfaz, se integra con servicios de traducción automática (incluida la IA personalizada) y actualiza dinámicamente el contenido localizado en el juego.",
  "p_live_updates_guide": "El sistema Live Updates permite que su juego obtenga nuevas traducciones de un servidor remoto o de Google Sheet en tiempo de ejecución, sin requerir una nueva compilación.",
  "p_localizedasset_1": "Se utiliza para intercambiar activos según el idioma. Detecta automáticamente el tipo de componente. Soporta: <ul><li><strong>2D:</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Texturas (<code>RawImage</code>).</li><li><strong>Audio/Vídeo:</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animación:</strong> <code>MeshFilter</code> (Mallas), <code>Renderer</code> (Materiales), <code>Animator</code> (Controlador), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "Para los componentes con la opción <strong>Play on Awake</strong> (como <code>AudioSource</code>, <code>VideoPlayer</code>), <code>LocalizedAsset</code> intercepta correctamente la reproducción automática, intercambia el activo y luego comienza la reproducción para evitar reproducir contenido no localizado.",
  "p_localizedasset_updated": "El componente ahora soporta carga asíncrona. Ten en cuenta que puede haber un ligero retraso al cambiar de idioma si los activos se cargan desde la nube/disco (Addressables).",
  "p_localizedbehaviour_1": "Un componente de utilidad que permite que tus scripts reaccionen a los cambios de idioma. Encuentra y llama automáticamente a los métodos marcados con el atributo <code>[OnLanguageChange]</code>.",
  "p_localizeddropdown_1": "Añadido a <code>Dropdown</code> y <code>TMP_Dropdown</code> para traducir sus opciones.",
  "p_localizedprefab_1": "Un componente para localizar prefabs completos. Funciona de forma no destructiva: no modifica el prefab original, sino que crea una instancia de la versión localizada como un objeto hijo, deshabilitando todos los scripts (<code>MonoBehaviour</code>), renderizadores (<code>Renderer</code>) y colliders (<code>Collider</code>) en el objeto original. Esto evita la ejecución de lógica dual y artefactos visuales. Para un funcionamiento correcto en tiempo de ejecución, su orden de ejecución se establece en -100 (<code>[DefaultExecutionOrder(-100)]</code>) para asegurar que se ejecute antes que otros scripts.",
  "p_localizedtext_1": "El componente principal para mostrar texto traducido. Se coloca en objetos con <code>Text</code>, <code>TMP_Text</code> y <code>TextMesh</code>.",
  "p_migration_custom": "Puedes crear tus propios perfiles de migración para admitir sistemas personalizados o configuraciones de proyecto específicas. Cada perfil contiene una lista de <strong>Reglas</strong> que definen cómo deben convertirse los componentes y sus campos. Las reglas se verifican en orden de su <strong>Prioridad</strong>.",
  "p_migration_custom_advanced": "Los perfiles de migración ofrecen configuraciones avanzadas para afinar el proceso de importación y detección:",
  "p_migration_google_sheet": "Puede importar directamente desde una URL de Google Sheet sin descargar archivos.",
  "p_migration_import_csv": "La herramienta admite archivos CSV estándar (separados por comas). La primera fila debe ser el encabezado.",
  "p_migration_stubs": "Un problema común al migrar es que eliminar el plugin antiguo (p. ej., I2) rompe la compilación, impidiendo que Unity compile la propia herramienta de migración.",
  "p_migration_tool_access": "Acceso a través de <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "p_migration_tool_desc": "Herramienta para la transición desde otros sistemas de localización (I2 Localization, Unity Localization).",
  "p_preview_1": "Justo debajo del encabezado se encuentra la lista desplegable <strong>Preview Language</strong>. Esta potente característica te permite ver cómo se verá la localización en cualquier idioma directamente en la ventana <strong>Scene</strong> o en el <strong>Modo Prefab</strong>, sin ejecutar el juego.",
  "p_preview_overlay": "Para una iteración aún más rápida, puede cambiar de idioma directamente desde la Vista de Escena usando el <strong>Localization Preview Overlay</strong> dedicado.",
  "p_report_1": "Después de cada análisis, este informe muestra la imagen completa del estado de tu localización.",
  "p_safety_caps": "Para evitar costos altos accidentales o verificaciones de tráfico extensas:",
  "p_script_parsing_rules_description": "La herramienta puede configurarse para reconocer claves de localización usadas en funciones personalizadas o incluso en sistemas competidores (como I2 Localization) sin modificar su código existente. Esto se logra definiendo patrones regex que el escáner utiliza para extraer claves de sus scripts.",
  "p_script_parsing_rules_usage": "En la pestaña <strong>Content</strong>, bajo <strong>Script Parsing Rules</strong>, puede agregar reglas que coincidan con sus llamadas a funciones específicas. Por ejemplo, para soportar <code>I2.Loc.Get(\"key\")</code>, puede añadir una regla con un patrón que capture la cadena dentro de los paréntesis.",
  "p_settings_1": "Tu centro de control. Aquí defines las reglas globales para todo el proceso de localización.",
  "p_tms_intro": "La herramienta ahora admite sincronización con sistemas de gestión de traducción populares. Puedes enviar claves fuente y descargar traducciones directamente dentro de Unity.",
  "p_tms_setup": "1. Ve a <strong>Settings -> TMS Integration</strong>.<br>2. Selecciona tu proveedor de servicio.<br>3. Introduce las claves API y los IDs de proyecto.<br>4. Usa los botones <strong>Push</strong> (Subir claves) y <strong>Pull</strong> (Descargar traducciones) en la ventana de Settings.",
  "p_tutorials_1": "La pestaña Tutorials ofrece guías interactivas paso a paso para ayudarle a dominar las funciones de la herramienta directamente dentro del Unity Editor.",
  "p_uitklocalization_1": "Añadido a objetos con un <code>UIDocument</code>. Soporta la localización de <strong>Labels, Buttons, HelpBox, Foldout, ProgressBar (title), TextField (label & placeholder), DropdownField (label & choices), RadioButton, RadioButtonGroup, ToggleButtonGroup (Unity 2023+), y Tooltips</strong> en cualquier elemento. Los identificadores son estables al renombrar si los IDs se establecen en UI Builder.",
  "p_window_footer": "Muestra el estado actual, el progreso de las operaciones en segundo plano y la versión de la herramienta.",
  "p_window_header": "La barra superior brinda acceso global a los controles de vista previa y herramientas utilitarias que persisten sin importar la pestaña seleccionada.",
  "p_window_sidebar": "La barra lateral gestiona la navegación entre diferentes pestañas funcionales y herramientas de búsqueda global.",
  "page_title": "Documentación de la Herramienta de Localización de Unity",
  "q_faq_addressables_1": "Habilité el modo Addressables, pero los activos no se cargan. ¿Qué debo comprobar?",
  "q_faq_addressables_2": "¿Cómo añado soporte para DeepL/Google?",
  "q_faq_addressables_3": "El migrador muestra errores de compilación después de eliminar I2/UnityLoc. ¿Cómo puedo solucionar esto?",
  "q_faq_audio_smart_update": "¿Cómo ahorra la herramienta créditos de API al regenerar archivos de audio?",
  "q_faq_components_1": "El componente LocalizedPrefab desactiva los MonoBehaviours en el objeto original. ¿Qué ocurre si el objeto original tiene un script que crea otros objetos o se suscribe a eventos en Awake()?",
  "q_faq_components_2": "Si el prefab original (LocalizedPrefab) tiene un Rigidbody u otro componente de física, ¿se deshabilitará? ¿Afectará esto a la física si el prefab localizado no lo tiene?",
  "q_faq_components_3": "El componente LocalizedAsset almacena el nombre del componente de destino como una cadena (_targetComponentTypeName). ¿Qué pasa si cambio el nombre de un script de componente personalizado o lo muevo a otro ensamblado (Assembly Definition)? ¿Dejará de funcionar LocalizedAsset para él?",
  "q_faq_components_4": "Si hay dos componentes Image en el mismo GameObject, ¿cómo sabe LocalizedAsset cuál localizar? ¿Funcionará con ambos o solo con el primero que encuentre?",
  "q_faq_components_5": "La documentación establece que LocalizedPrefab tiene un orden de ejecución de -100. ¿Qué pasa si tengo otro script con un orden de ejecución de -110 que intenta encontrar un objeto hijo creado por LocalizedPrefab en su Awake()? ¿LocalizedPrefab habrá instanciado su instancia a tiempo?",
  "q_faq_components_6": "El componente LocalizedText tiene una opción isStyleOnly. Si la habilito y luego llamo a myLocalizedText.SetFormattedText(\"new_key\") en el código, ¿cambiará el texto o solo el estilo (fuente/RTL)?",
  "q_faq_components_7": "LocalizedBehaviour encuentra automáticamente métodos con el atributo [OnLanguageChange]. ¿Encontrará métodos privados y protegidos, o deben ser públicos?",
  "q_faq_components_8": "El componente LocalizedAsset intercepta Play on Awake. ¿Qué pasa si otro script en el mismo objeto intenta acceder al activo (p. ej., audioSource.clip.length) en Awake() o Start() antes de que LocalizedAsset lo haya intercambiado? ¿Es posible una NullReferenceException o el uso del activo antiguo?",
  "q_faq_custom_keys_attribute": "¿Puedo usar mi propio atributo para las claves en lugar de [LocalizableField]?",
  "q_faq_custom_provider_1": "¿Por qué mi proveedor personalizado no aparece en el menú desplegable de Settings?",
  "q_faq_editor_1": "¿Qué tiene mayor prioridad para la validación de marcadores de posición: la directiva @placeholders: en el comentario o los marcadores de posición encontrados en el texto del idioma de origen? Por ejemplo, si el texto de origen tiene {name} y el comentario dice @placeholders: {username}.",
  "q_faq_editor_2": "Si cometo un error tipográfico en la directiva (p. ej., @placeholder: en lugar de @placeholders:), ¿se ignorará o la herramienta emitirá una advertencia?",
  "q_faq_editor_3": "El sistema de autoguardado crea archivos en la carpeta Backups/AutoSaves. ¿Se eliminarán automáticamente estos archivos después de un guardado manual exitoso o al cerrar la ventana?",
  "q_faq_editor_4": "Si cambio los anchos de columna en el editor, ¿se guardarán estos ajustes entre sesiones de Unity?",
  "q_faq_editor_5": "¿La ventana emergente de edición de texto (MultiLineEditWindow) admite su propia pila Deshacer/Rehacer (a través de Ctrl+Z) para los cambios realizados dentro de ella?",
  "q_faq_examples_1": "¿Qué sucede si los nombres de las propiedades en el tipo anónimo pasado a la función _() no coinciden con los marcadores de posición en la cadena? Por ejemplo, _(\"Hello, {username}\", new { user_name = \"Bob\" }). ¿Habrá un error o simplemente no se reemplazará el marcador de posición?",
  "q_faq_examples_2": "El atributo [LocalizableField] funciona para campos privados. ¿Funcionará para campos estáticos?",
  "q_faq_examples_3": "Si pongo el atributo [OnLanguageChange] en un método con parámetros (p. ej., void UpdateUI(string newLang)), ¿qué sucederá? ¿Habrá un error de compilación o una advertencia en tiempo de ejecución?",
  "q_faq_examples_4": "Estoy usando _(\"apple_count\", count). Si no hay clave apple_count_one para el idioma actual (para count = 1), ¿qué forma elegirá el sistema? ¿Usará apple_count_other como reserva?",
  "q_faq_examples_5": "La función _(\"key\", new { username = \"Alex\" }) utiliza un tipo anónimo. ¿Esto no creará una \"carga\" excesiva en el recolector de basura (GC) con llamadas frecuentes en un método Update() en comparación con pasar un Dictionary<string, object> pre-creado?",
  "q_faq_examples_6": "Mi método marcado con [OnLanguageChange] no se está llamando. ¿Por qué?",
  "q_faq_extending_1": "¿Se llamará automáticamente a mi analizador personalizado después de cada Update Keys? ¿Necesito registrarlo en algún lugar, o basta con tener una clase que implemente ITextComponentParser en el proyecto?",
  "q_faq_extending_2": "¿Qué pasa si ocurre una excepción en mi analizador personalizado? ¿Interrumpirá todo el proceso de análisis o continuará la herramienta de forma segura con otros analizadores?",
  "q_faq_installation_1": "¿Qué pasa si mi proyecto ya tiene el paquete com.unity.nuget.newtonsoft-json de otro activo? ¿Intentará el instalador de dependencias actualizarlo o lo ignorará?",
  "q_faq_installation_2": "Accidentalmente hice clic en \"Skip for Now\" y marqué \"Don't ask again\" para dependencias opcionales (p. ej., para soporte CSV). ¿Cómo puedo volver a abrir la ventana del instalador para instalarlas?",
  "q_faq_installation_3": "La herramienta no creó LocalizationSettings.asset en Assets/Resources. ¿Por qué pudo haber sucedido esto y puedo crearlo manualmente a través del menú Assets -> Create?",
  "q_faq_installation_4": "¿Puedo mover el archivo LocalizationSettings.asset a otra carpeta Resources, por ejemplo, Assets/MyGame/Resources? ¿La herramienta seguirá encontrándolo?",
  "q_faq_installation_5": "El instalador de dependencias se congeló o dio un error. ¿Puedo instalar las dependencias (Newtonsoft Json, Editor Coroutines) manualmente a través del Administrador de Paquetes de Unity?",
  "q_faq_notes_1": "La documentación recomienda añadir LanguageSelector a la lista de ignorados. ¿Qué se romperá exactamente si me olvido de hacerlo? ¿Se crearán claves adicionales para \"Option A, Option B\"?",
  "q_faq_notes_2": "Si me olvido de añadir un LocalizedText vacío con la casilla isStyleOnly habilitada en el Label dentro del TMP_Dropdown utilizado por LanguageSelector, ¿la fuente no cambiará? ¿Por qué es necesario esto?",
  "q_faq_notes_3": "No se recomienda llamar a _() en el método Update(). Pero, ¿qué pasa si necesito actualizar el texto en cada frame (p. ej., un temporizador)? ¿Cuál es la forma más eficiente de hacerlo, almacenando en caché solo la cadena de formato?",
  "q_faq_tts_voices": "¿Cómo asigno voces específicas a los personajes?",
  "q_faq_window_actions_1": "¿Qué pasa si se pierde la conexión a Internet durante una traducción automática por lotes? ¿Intentará la herramienta reintentar el lote fallido según la Política de Reintento, o se interrumpirá el proceso por completo?",
  "q_faq_window_actions_2": "Si importo un archivo CSV que contiene claves que ya existen en el proyecto pero con valores vacíos para algunos idiomas, ¿estos valores vacíos reemplazarán mis traducciones existentes o se ignorarán?",
  "q_faq_window_actions_3": "La sección \"Danger Zone\" permite eliminar todos los componentes. ¿Eliminará componentes de prefabs que se encuentran en carpetas no especificadas en Prefab Folders en la pestaña Content?",
  "q_faq_window_actions_4": "Al importar desde Google Sheets, ¿cómo debo formatear la columna de comentarios para que funcione la validación de marcadores de posición usando la directiva @placeholders:?",
  "q_faq_window_actions_5": "¿Puede la herramienta importar datos de varias hojas de un solo documento de Google Sheets, o solo funciona con una hoja por GID?",
  "q_faq_window_assets_1": "¿Qué pasa si tengo dos activos con la misma clave pero diferentes tipos en la misma carpeta de escaneo (p. ej., sound_effect_en.mp3 y sound_effect_en.wav)? ¿Cuál terminará en la tabla de activos?",
  "q_faq_window_assets_2": "Si hago clic en Scan Assets & Analyze Project, y hay un objeto Image en la escena para el que ya existe un sprite localizado, pero el objeto Image en sí aún no tiene un componente LocalizedAsset, ¿la herramienta añadirá el componente e insertará automáticamente la clave?",
  "q_faq_window_assets_3": "¿Puedo usar la misma Naming Rule para diferentes categorías de activos si tienen diferentes Scan Folders? ¿Esto causará conflictos?",
  "q_faq_window_assets_4": "Si un activo localizable (p. ej., button_ok_es.png) no está en la raíz de la Scan Folder, sino en una subcarpeta, ¿lo encontrará el escáner?",
  "q_faq_window_content_1": "¿Qué pasa si añado una escena a Scenes to Parse que no está incluida en la Configuración de Build? ¿Afectará esto a algo más que el proceso de análisis en sí?",
  "q_faq_window_content_2": "Añadí un objeto a Ignore Specific Objects (la lista temporal). Si creo un prefab a partir de este objeto, ¿también se ignorará la instancia de este prefab?",
  "q_faq_window_content_3": "Si añado el componente TMPro.TMP_Text a Parsing Ignores -> Ignore Component Types, pero hay un objeto en la escena con un LocalizedText que ya hace referencia a este TMP_Text, ¿qué sucederá en el próximo Update Keys? ¿Se eliminará la clave?",
  "q_faq_window_content_4": "La documentación dice que \"Pin\" guarda la ruta completa al objeto y se romperá si se le cambia el nombre. ¿Qué pasa si hago un prefab del objeto y luego cambio el nombre del objeto original? ¿\"Pin\" seguirá funcionando para las instancias del prefab?",
  "q_faq_window_content_5": "Si uso \"Pin\" para un objeto hijo dentro de una instancia de prefab, ¿qué ruta se guardará: relativa a la raíz del prefab o a la raíz de la escena? ¿Funcionará en otras escenas?",
  "q_faq_window_preview_1": "Abrí un prefab en Modo Prefab, apliqué la Vista Previa en el Editor y presioné Ctrl+S. ¿Se guardarán los datos temporales de la vista previa en el activo del prefab? ¿Cómo maneja LocalizationPreviewProtector este caso?",
  "q_faq_window_preview_2": "Si habilito la Vista Previa en el Editor y el editor de Unity falla, y el archivo Temp/localization_preview_recovery.json se corrompe (p. ej., JSON vacío o inválido), ¿qué sucederá en el próximo lanzamiento?",
  "q_faq_window_preview_3": "En el modo de Vista Previa en el Editor para LocalizedPrefab, se crea una instancia temporal. ¿Se ejecutarán los métodos Awake() y Start() en esta instancia? ¿Podría esto causar errores si no están diseñados para ejecutarse en Modo Edición?",
  "q_faq_window_report_1": "El botón \"Find\" busca el objeto de forma asíncrona. ¿Qué pasa si inicio una búsqueda e inmediatamente hago clic en Update Keys? ¿Se interrumpirá la búsqueda?",
  "q_faq_window_report_2": "Si una clave se usa en varios lugares (p. ej., en dos botones diferentes en diferentes escenas), ¿cómo se mostrará esto en el informe bajo la categoría \"Duplicates\"?",
  "q_faq_window_report_3": "Si hago clic en \"Find\" para una clave que solo se usa en código (a través de la función _()), ¿qué sucederá? ¿Podrá la herramienta encontrar y resaltar el script C#?",
  "q_faq_window_settings_1": "Puedo cambiar el Modo de Generación de Claves de UseTextAsKey a AutoGenerateKeysOnly a mitad del proyecto. ¿Qué sucederá exactamente con mis traducciones existentes? ¿Se mapearán a las nuevas claves?",
  "q_faq_window_settings_2": "Si añado un idioma con un código que no tiene reglas de pluralización (p. ej., \"kz\" para kazajo) a la lista de Supported Languages, ¿qué regla se utilizará por defecto?",
  "q_faq_window_settings_3": "¿Qué pasa si especifico el Translations Path no en StreamingAssets, sino en una carpeta normal como Assets/MyTranslations? ¿Se incluirán los archivos json en la build del juego?",
  "q_faq_window_settings_4": "La clave API de traducción automática se almacena en EditorPrefs. Si estoy trabajando en el proyecto en dos computadoras diferentes, ¿necesito ingresar la clave en cada máquina por separado?",
  "tip_best_practice": "<strong>Consejo Profesional:</strong> Si necesitas localizar una Propiedad, crea un campo de respaldo con <code>[LocalizableField]</code> y expón la propiedad por separado.",
  "toc_search_placeholder": "Buscar documentación...",
  "toc_title": "Tabla de Contenidos",
  "toggle_notes_title": "Alternar Notas",
  "warning_box_components": "<strong>Nota Importante:</strong> Todos los componentes descritos a continuación se añaden a los objetos de juego automáticamente durante el análisis (cuando haces clic en el botón <code>Update Keys</code>). No es necesario que los añadas manualmente.",
  "warning_tms_overwrite": "<strong>Warning:</strong> Descargar desde TMS sobrescribirá las traducciones locales de las claves coincidentes. Asegúrate de que tu TMS sea la única fuente de verdad."
}