{
  "page_title": "Documentation de l'Outil de Localisation Unity",
  "toc_title": "Table des Matières",
  "toc_search_placeholder": "Rechercher dans la documentation...",
  "nav_introduction": "1. Introduction",
  "nav_quick_start": "2. Démarrage Rapide",
  "nav_components": "3. Composants de Base",
  "nav_loc_tool_window": "4. Fenêtre \"Localization Tool\"",
  "nav_translation_editor": "5. Éditeur de Traduction",
  "nav_ai_profiles": "6. Profils d'IA et de Traduction (Nouveau v1.1)",
  "nav_usage_examples": "7. Exemples d'Utilisation",
  "nav_important_notes": "8. Notes Importantes",
  "nav_extending": "9. Extension des Fonctionnalités",
  "nav_faq": "10. FAQ et Dépannage",
  "nav_migration_tool": "11. Outil de Migration",
  "nav_font_glyph_manager": "12. Gestionnaire de Polices et de Glyphes",
  "nav_pseudo_tool": "13. Outil de Pseudo-Localisation",
  "nav_ai_audio": "14. Audio IA / Synthèse Vocale (Text-to-Speech)",
  "nav_key_features": "Fonctionnalités Clés",
  "nav_installation": "2.1. Installation",
  "nav_initial_setup": "2.2. Configuration Initiale",
  "nav_localizedtext": "3.1. LocalizedText",
  "nav_localizedasset": "3.2. LocalizedAsset",
  "nav_localizedprefab": "3.3. LocalizedPrefab",
  "nav_uitklocalization": "3.4. UITKLocalization",
  "nav_localizeddropdown": "3.5. LocalizedDropdown",
  "nav_localizedbehaviour": "3.6. LocalizedBehaviour",
  "nav_context_menu": "3.7. Menu Contextuel",
  "nav_in_editor_preview": "4.1. Aperçu dans l'Éditeur et des Prefabs",
  "nav_tab_settings": "4.2. Onglet \"Settings\" (Paramètres)",
  "nav_tab_content": "4.3. Onglet \"Content\" (Contenu) (Refonte)",
  "nav_tab_actions": "4.4. Onglet \"Actions\"",
  "nav_tab_assets": "4.5. Onglet \"Assets\" (Ressources)",
  "nav_tab_report": "4.6. Onglet \"Report\" (Rapport)",
  "nav_ai_profiles_overview": "6.1. Profils de Traduction",
  "nav_custom_ai": "6.2. IA et Modèles Personnalisés",
  "nav_ai_context": "6.3. Contexte et Glossaire",
  "nav_ai_assistant": "6.4. Commandes de l'Assistant IA",
  "nav_example_components": "7.1. Composants Prêts à l'Emploi",
  "nav_example_attribute": "7.2. Attribut [LocalizableField]",
  "nav_example_function": "7.3. Fonction _()",
  "nav_example_plurals": "7.4. Pluriels et Genre",
  "nav_custom_parser": "9.1. Créer un Analyseur (Parser) Personnalisé",
  "nav_faq_installation": "10.1. Installation et Démarrage Rapide",
  "nav_faq_components": "10.2. Composants de Base",
  "nav_faq_window": "10.3. Fenêtre \"Localization Tool\"",
  "nav_faq_window_actions": "10.3. Fenêtre \"Localization Tool\" - Onglet \"Actions\"",
  "nav_faq_window_assets": "10.3. Fenêtre \"Localization Tool\" - Onglet \"Assets\"",
  "nav_faq_window_report": "10.3. Fenêtre \"Localization Tool\" - Onglet \"Report\"",
  "nav_faq_editor": "10.4. Éditeur de Traduction",
  "nav_faq_examples": "10.5. Exemples d'Utilisation et Code",
  "nav_faq_notes": "10.6. Nuances et Avertissements Importants",
  "nav_faq_extending": "10.7. Extension des Fonctionnalités",
  "h1_introduction": "Introduction",
  "p_intro_1": "Cet outil est une solution complète pour la localisation de jeux et d'applications dans Unity. Il automatise le processus de collecte de texte et de ressources, gère les traductions via une interface puissante, s'intègre aux services de traduction automatique (y compris l'IA personnalisée) et met à jour dynamiquement le contenu localisé dans le jeu.",
  "h2_key_features": "Fonctionnalités Clés",
  "li_feature_1": "<strong>Analyse Avancée :</strong> Balayage automatique des scènes, prefabs, UI Toolkit (UXML) et scripts C#, y compris les champs marqués de l'attribut <code>[LocalizableField]</code>, ainsi que les classes et listes imbriquées.",
  "li_feature_2": "<strong>Localisation de Toute Ressource :</strong> Gestion des sprites, audio, prefabs, matériaux, etc.",
  "li_feature_3": "<strong>Éditeur de Traduction Puissant :</strong> Une interface centralisée avec sauvegarde automatique, support complet Annuler/Rétablir (Undo/Redo), regroupement intelligent des clés, et <strong>Nouveau en v1.1 :</strong> actions de multi-sélection.",
  "li_feature_4": "<strong>IA et Traduction Automatique (v1.1) :</strong> Nouveau système de Profils prenant en charge DeepL, Google, Microsoft et <strong>l'IA Personnalisée (OpenAI, Gemini, Claude, Ollama)</strong> avec conscience du contexte.",
  "li_feature_5": "<strong>Import/Export Flexible :</strong> Support des formats CSV, XML, YAML, XLIFF et importation directe depuis Google Sheets.",
  "li_feature_6": "<strong>Aperçu en Direct :</strong> Prévisualisez n'importe quelle langue dans la Vue Scène ou le <strong>Mode Prefab</strong> sans exécuter le jeu.",
  "li_feature_7": "<strong>Support du Pluriel et du Genre :</strong> Gestion correcte des formes plurielles (avec règles pour les langues slaves, arabes et autres) et du genre.",
  "li_feature_8": "<strong>Support RTL Complet :</strong> Affichage correct des langues de droite à gauche.",
  "li_feature_9": "<strong>Mises à Jour en Direct :</strong> Chargez les traductions à jour depuis un serveur distant au démarrage du jeu.",
  "li_feature_10": "<strong>Gestionnaire de Sauvegardes :</strong> Un outil intégré pour créer et restaurer des sauvegardes.",
  "li_feature_11": "<strong>Alimenté par l'IA :</strong> Support pour OpenAI, Anthropic (Claude), Google Gemini et LLM locaux (Ollama) via des profils personnalisables.",
  "li_feature_12": "<strong>Synthèse Vocale (TTS) :</strong> Génération de fichiers audio pour les chaînes localisées à l'aide de l'IA (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Outils de Migration :</strong> Outils pour la transition automatique depuis les plugins I2 Localization et Unity Localization.",
  "li_feature_14": "<strong>Gestionnaire de Polices et de Glyphes :</strong> Outil d'analyse des caractères utilisés et de recherche des glyphes manquants dans les polices.",
  "li_feature_15": "<strong>Débogage Visuel :</strong> Icônes dans la hiérarchie et étiquettes dans la Vue Scène pour un débogage rapide.",
  "h1_quick_start": "Démarrage Rapide et Configuration",
  "h2_installation": "2.1. Installation",
  "li_install_1": "Copiez la ressource dans votre dossier de projet Unity.",
  "li_install_2": "L'outil vérifiera automatiquement les dépendances nécessaires. Confirmez l'installation dans la boîte de dialogue qui apparaît.",
  "li_install_3": "Les dépendances requises (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) sont nécessaires pour les fonctionnalités de base.",
  "li_install_4": "Les dépendances optionnelles (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) activent des fonctionnalités supplémentaires.",
  "li_install_5": "Cliquez sur <strong>Install Selected</strong> pour installer les packages recommandés.",
  "li_install_6": "Après l'installation, ouvrez la fenêtre principale de l'outil via le menu <strong>Tools -> Localization Tool</strong>.",
  "li_install_7": "Si vous prévoyez d'utiliser le chargement asynchrone des ressources, installez le package <strong>Addressables</strong> via le Gestionnaire de Paquets.",
  "h2_initial_setup": "2.2. Configuration Initiale",
  "li_setup_1": "<strong>Créer les Paramètres :</strong> Lors de la première ouverture, l'outil créera un fichier <code>LocalizationSettings.asset</code> dans le dossier <code>Assets/Resources</code>.",
  "li_setup_2": "<strong>Configurer les Langues :</strong> Dans l'onglet <strong>Settings</strong> sous <strong>Language Management</strong>, assurez-vous que votre langue principale (par exemple, <code>en</code> pour l'anglais) est sélectionnée comme <strong>Source Language</strong>. Activez toutes les langues que vous prévoyez de prendre en charge.",
  "li_setup_3": "<strong>Spécifier le Contenu à Analyser :</strong> Dans l'onglet <strong>Content</strong>, ajoutez toutes les scènes à analyser à la liste <strong>Scenes to Parse</strong>. Si vous utilisez des prefabs avec du texte, assurez-vous que leurs dossiers sont ajoutés à <strong>Prefab Folders</strong>.",
  "li_setup_4": "<strong>Première Exécution de l'Analyseur :</strong> Allez dans l'onglet <strong>Actions</strong> et cliquez sur le bouton <code>Update Keys</code>. L'outil analysera votre projet, créera des fichiers de traduction et ajoutera automatiquement les composants nécessaires (<code>LocalizedText</code>, <code>LocalizedAsset</code>, etc.) aux objets du jeu.",
  "li_setup_5": "<strong>Paramètres et Builds (CRITIQUE) :</strong> L'outil ajoute automatiquement <code>LocalizationSettings.asset</code> à <code>Project Settings -> Player -> Preloaded Assets</code>. <br>⚠️ <strong>Vérification de Sécurité :</strong> Si les paramètres sont manquants dans Preloaded Assets et ne se trouvent pas dans un dossier Resources, l'outil <strong>bloquera la construction</strong> avec une <code>BuildFailedException</code> pour empêcher le jeu de planter au démarrage.",
  "h1_components": "Composants de Base (attribués automatiquement)",
  "warning_box_components": "<strong>Note Importante :</strong> Tous les composants décrits ci-dessous sont ajoutés aux objets du jeu automatiquement lors de l'analyse (lorsque vous cliquez sur le bouton <code>Update Keys</code>). Vous n'avez pas besoin de les ajouter manuellement.",
  "p_components_intro": "Ces composants sont le \"pont\" entre vos objets dans la scène et la base de données de traduction. Ils \"écoutent\" les changements de langue et substituent automatiquement le texte ou la ressource correcte.",
  "h2_localizedtext": "3.1. LocalizedText",
  "p_localizedtext_1": "Le composant principal pour afficher le texte traduit. Il est placé sur les objets avec <code>Text</code>, <code>TMP_Text</code> et <code>TextMesh</code>.",
  "li_localizedtext_1": "<code>localizationKey</code> : La clé utilisée pour trouver la traduction. Générée automatiquement.",
  "li_localizedtext_2": "<code>isStyleOnly</code> : Si <code>true</code>, le composant appliquera uniquement les styles (police, RTL) mais ne changera pas le texte lui-même. Utile pour les éléments dont le texte est géré par un autre script (par exemple, <code>LanguageSelector</code>).",
  "li_localizedtext_3": "<code>originalSourceText</code> : Le texte original dans la langue de base. Utilisé comme solution de repli.",
  "h2_localizedasset": "3.2. LocalizedAsset",
  "p_localizedasset_1": "Utilisé pour échanger des ressources en fonction de la langue. Détecte automatiquement le type de composant. Prend en charge : <ul><li><strong>2D :</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Textures (<code>RawImage</code>).</li><li><strong>Audio/Vidéo :</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animation :</strong> <code>MeshFilter</code> (Meshes), <code>Renderer</code> (Materials), <code>Animator</code> (Controller), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "Pour les composants avec l'option <strong>Play on Awake</strong> (comme <code>AudioSource</code>, <code>VideoPlayer</code>), <code>LocalizedAsset</code> intercepte correctement la lecture automatique, échange la ressource, puis démarre la lecture pour éviter de lire du contenu non localisé.",
  "h2_localizedprefab": "3.3. LocalizedPrefab",
  "p_localizedprefab_1": "Un composant pour localiser des prefabs entiers. Il fonctionne de manière non destructive : il ne modifie pas le prefab original mais crée une instance de la version localisée en tant qu'objet enfant, désactivant tous les scripts (<code>MonoBehaviour</code>), les rendus (<code>Renderer</code>) et les colliders (<code>Collider</code>) sur l'objet original. Cela empêche l'exécution d'une double logique et les artefacts visuels. Pour un fonctionnement correct au moment de l'exécution, son ordre d'exécution est défini sur -100 (<code>[DefaultExecutionOrder(-100)]</code>) pour s'assurer qu'il s'exécute avant les autres scripts.",
  "h2_uitklocalization": "3.4. UITKLocalization",
  "p_uitklocalization_1": "Ajouté aux objets avec un <code>UIDocument</code>. Prend en charge la localisation des Labels, des Buttons, des <strong>Placeholders de TextField, des choix de DropdownField, des options de RadioButtonGroup et ToggleButtonGroup</strong>. Les identifiants sont stables malgré les renommages si les IDs sont définis dans UI Builder.",
  "h2_localizeddropdown": "3.5. LocalizedDropdown",
  "p_localizeddropdown_1": "Ajouté aux <code>Dropdown</code> et <code>TMP_Dropdown</code> pour traduire leurs options.",
  "h2_localizedbehaviour": "3.6. LocalizedBehaviour",
  "p_localizedbehaviour_1": "Un composant utilitaire qui permet à vos scripts de réagir aux changements de langue. Il trouve et appelle automatiquement les méthodes marquées de l'attribut <code>[OnLanguageChange]</code>.",
  "h2_context_menu": "3.7. Menu Contextuel \"Analyze for Localization\"",
  "p_context_menu_1": "Pour ajouter rapidement un <code>LocalizedAsset</code> à un objet, vous pouvez faire un clic droit sur le composant souhaité (par exemple, <code>Image</code>, <code>AudioSource</code>) dans l'inspecteur et sélectionner <strong>Analyze for Localization</strong>. L'outil ajoutera et configurera le composant lui-même. (Ceci est facultatif mais peut être utilisé pour un ajout manuel).",
  "h1_loc_tool_window": "Fenêtre \"Localization Tool\"",
  "h2_in_editor_preview": "4.1. Aperçu dans l'Éditeur et des Prefabs",
  "p_preview_1": "Juste en dessous de l'en-tête se trouve la liste déroulante <strong>Preview Language</strong>. Cette fonctionnalité puissante vous permet de voir à quoi ressemblera la localisation dans n'importe quelle langue directement dans la fenêtre <strong>Scene</strong> ou le <strong>Mode Prefab</strong>, sans exécuter le jeu.",
  "li_preview_1": "<strong>Comment ça fonctionne :</strong> Sélectionnez une langue dans la liste, et l'outil appliquera instantanément les traductions, les polices, les paramètres RTL et les ressources correspondants à tous les objets localisables de la scène active ou du prefab ouvert.",
  "li_preview_2": "<strong>Placeholders :</strong> Si un style de placeholder (par exemple, <strong>Accents</strong> ou <strong>Brackets</strong>) est sélectionné dans l'onglet <strong>Settings</strong>, ces placeholders seront affichés en mode aperçu au lieu des traductions réelles. C'est idéal pour tester la mise en page et trouver les éléments non localisés.",
  "li_preview_3": "<strong>Sécurité :</strong> Toutes les modifications effectuées en mode aperçu sont temporaires. L'outil rétablira automatiquement tout à son état d'origine lorsque vous sélectionnez \"<strong>Revert to Original</strong>\", fermez la fenêtre, changez de scène ou avant de sauvegarder une scène/un prefab (grâce au composant <code>LocalizationPreviewProtector</code>).",
  "li_preview_4": "<strong>Protection contre les plantages :</strong> Le système sauvegarde automatiquement l'état de la scène dans le dossier <code>Library</code> avant l'aperçu. Si Unity se bloque ou si vous quittez de force pendant l'aperçu, l'outil détecte le fichier de récupération au prochain lancement et propose de restaurer l'état original de la scène.",
  "h2_tab_settings": "4.2. Onglet \"Settings\" (Paramètres)",
  "p_settings_1": "Votre centre de contrôle. Ici, vous définissez les règles globales pour l'ensemble du processus de localisation.",
  "li_settings_1": "<strong>Key Generation Mode :</strong> Choisissez comment les clés seront créées.<ul><li><code>UseTextAsKey</code> : Le texte lui-même devient la clé. Idéal pour les prototypes.</li><li><code>AutoGenerateKeysOnly</code> : La clé est générée en fonction de la hiérarchie et du nom de l'objet. Fiable pour la production.</li><li><code>Manual</code> : L'analyseur ne générera **PAS** automatiquement de clés. Il ne mettra à jour que les objets qui ont déjà une clé attribuée.</li><li><code>UseTextAsKeyWithCustomPriority</code> / <code>AutoGenerateWithCustomKeys</code> : Modes hybrides permettant des clés personnalisées via des attributs de code.</li><li><strong>Migration Sûre :</strong> Vous pouvez changer de mode à tout moment ; l'outil tente de migrer les traductions existantes.</li></ul>",
  "li_settings_2": "<strong>Language Management :</strong><ul><li><strong>Source Language :</strong> La langue utilisée dans vos scènes/prefabs Unity (langue de développement).</li><li><strong>Default Language :</strong> La langue sélectionnée au premier lancement du jeu si la langue système de l'utilisateur n'est pas prise en charge.</li><li><strong>List :</strong> Gérez les langues prises en charge, attribuez des <strong>Font Assets</strong> spécifiques et activez le support <strong>RTL</strong>.</li></ul>",
  "li_settings_3": "<strong>General Settings :</strong><ul><li><code>Parse Prefabs</code> : Active l'analyse des prefabs.</li><li><code>Split files by language</code> : Détermine comment stocker les traductions (un grand fichier ou un fichier par langue).</li><li><code>Translations Path</code> : Le chemin de stockage des fichiers de traduction <code>.json</code>. Important : le dossier doit se trouver à l'intérieur de <code>Assets/StreamingAssets/</code>.</li></ul>",
  "li_settings_4": "<strong>Debugging & Testing :</strong><ul><li><code>Placeholder Style</code> : Choisissez le style d'affichage des placeholders en mode aperçu.</li></ul>",
  "li_settings_5": "<strong>Live Updates :</strong> Paramètres pour le chargement des traductions à partir d'un serveur distant.",
  "li_settings_6": "<strong>Runtime API Key :</strong> Stocke en toute sécurité votre clé API pour la traduction automatique en jeu. La clé est **obfusquée** (chiffrée) dans la construction pour empêcher une extraction facile via la recherche de chaînes, mais rappelez-vous : aucun secret côté client n'est sécurisé à 100%.",
  "li_settings_7": "<strong>Asset Loading Strategy :</strong> Choix entre <code>Resources (Legacy)</code> (chargement synchrone, ancienne méthode) et <code>Addressables (Async)</code> (chargement asynchrone, recommandé pour les grands projets).",
  "li_settings_8": "<strong>Auto-Translation :</strong> Utilise maintenant le système de <strong>Translation Profiles</strong>. Vous devez créer une ressource de profil (Clic droit -> Create -> Localization -> Translation Profile) ou sélectionner un préréglage dans le dossier <code>Localization/Presets</code>. Les profils prennent en charge : Google Translate, DeepL, Microsoft, OpenAI, Claude, Gemini, Ollama. Dans les paramètres, sélectionnez <strong>Active Text Profile</strong> (pour le texte) et <strong>Active Audio Profile</strong> (pour la TTS).",
  "li_settings_9": "<strong>Debugging Enhancements :</strong><ul><li><code>Show Hierarchy Icons</code> : Affiche des icônes d'état (Coche Verte / Avertissement Jaune) dans la hiérarchie. <strong>Performances Optimisées :</strong> Utilise la mise en cache pour garantir un lag nul même dans les grandes scènes.</li><li><code>Show Scene View Labels</code> : Débogage visuel directement dans la Vue Scène. Les étiquettes sont interactives : faites un clic droit sur n'importe quelle étiquette de scène pour copier instantanément la clé de localisation dans le presse-papiers.</li><li><code>Pseudo-Localization</code> : Testez l'expansion de la mise en page de l'interface utilisateur sans traduction.</li></ul>",
  "li_settings_10": "<strong>Dev Tools :</strong> Au bas de l'onglet Paramètres, vous trouverez des boutons utilitaires comme <strong>Clear Saved Language Pref</strong> (réinitialise la langue sauvegardée dans PlayerPrefs afin que le jeu démarre à nouveau avec la langue par défaut).",
  "li_settings_11": "<strong>Technical Dropdown Options :</strong> Une liste de valeurs de chaîne (par défaut : 'Option A', 'Option B', 'Option C') que l'analyseur <strong>ignorera</strong> lors de l'analyse des Dropdowns. Cela permet de garder votre table de traduction propre du texte de placeholder d'interface utilisateur par défaut d'Unity.",
  "li_assistant_3": "<strong>Commandes Personnalisées :</strong> Vous n'êtes pas limité aux préréglages ! Ouvrez l'inspecteur de votre ressource <strong>Translation Profile</strong> pour ajouter vos propres invites (par exemple, 'Réécrire en style pirate', 'Vérifier l'orthographe'). Celles-ci apparaîtront automatiquement dans le menu contextuel de l'éditeur.",
  "li_font_glyph_workflow": "<strong>Flux de Travail pour TMP :</strong> 1. Exécutez l'analyse (Scan). 2. Sélectionnez une langue avec des glyphes manquants. 3. Cliquez sur <strong>'Copy Character Set'</strong>. 4. Ouvrez Window -> TextMeshPro -> Font Asset Creator. 5. Collez le contenu du presse-papiers dans le champ 'Character Sequence (Custom Range)' pour générer un atlas contenant exactement les caractères dont votre jeu a besoin.",
  "li_assets_addressables_naming": "<strong>Convention de Nommage :</strong> Lors de l'analyse, l'outil définit automatiquement les Adresses Addressable au format <code>{Category}/{Language}/{Key}</code>. **Ne renommez pas** ces adresses manuellement, car le LocalizationManager se base sur ce format spécifique pour charger les ressources au moment de l'exécution.",
  "p_ai_audio_economy": "<strong>Économie de Coûts :</strong> L'outil calcule un hachage MD5 de votre texte et ne régénère les fichiers audio que si le texte source a changé, économisant ainsi vos crédits API. Si vous modifiez une traduction, le système marque uniquement ce fichier audio spécifique comme 'Obsolète'. Utilisez 'Generate Missing/Outdated' pour régénérer uniquement ce qui a changé, économisant des crédits API. L'outil hache votre texte et ne régénère les fichiers audio que si le texte source a changé, économisant vos crédits API grâce au regroupement intelligent.",
  "li_content_regex_example": "<strong>Exemple de Wrapper Personnalisé :</strong> Si vous utilisez une fonction personnalisée comme <code>MyGame.Loc(\"KEY\")</code>, ajoutez une Script Parsing Rule avec l'expression régulière : <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>. L'analyseur capturera désormais les clés de votre code personnalisé.",
  "li_settings_icons_legend": "<strong>Légende des Icônes de Hiérarchie :</strong><br>🟢 (Coche Verte) : Localisé et Clé définie.<br>🔴 (Erreur Rouge) : Composant localisé présent, mais **Clé manquante**.<br>🟡 (Avertissement Jaune) : Composant Texte/Image trouvé, mais **aucun composant de localisation** n'est attaché.<br>🐛 (Bug) : L'objet est **Ignoré** par les paramètres.",
  "h2_tab_content": "4.3. Onglet \"Content\" (Contenu) (Refonte en v1.1)",
  "p_content_1": "Ici, vous indiquez à l'outil où chercher exactement le texte. L'interface a été entièrement repensée pour une meilleure convivialité.",
  "li_content_1": "<strong>Scenes to Parse :</strong> Faites glisser et déposez toutes les scènes à analyser ici.",
  "li_content_2": "<strong>Prefab Folders :</strong> Spécifiez les dossiers contenant les prefabs. Prend désormais en charge la pagination et la recherche pour les grands projets.",
  "li_content_3": "<strong>Dynamic Texts :</strong> Entrez ici les chaînes qui sont créées exclusivement dans le code (par exemple, \"Game Over\").",
  "li_content_4": "<strong>Parsing Configuration :</strong> Spécifiez les scripts/objets à ignorer. Sous <strong>Attributes to Scan</strong>, vous pouvez ajouter des noms d'attributs personnalisés (par exemple, <code>[Header]</code>, <code>[TermsPopup]</code>) afin que l'analyseur traite ces champs comme du texte localisable.",
  "li_content_5": "<strong>Pin :</strong> Cette fonctionnalité vous permet \"d'épingler\" un objet de la scène à la liste d'ignorés. Au lieu d'une référence temporaire à l'objet, l'outil enregistrera son chemin complet dans la hiérarchie, rendant l'ignoré persistant entre les sessions.",
  "li_content_6": "<strong>Script Parsing Rules :</strong> Définissez des règles Regex personnalisées pour trouver des clés dans votre code. <br>🔥 **Nouveau :** Utilisez le bouton <strong>'Add Preset'</strong> pour ajouter instantanément des règles pour les ressources tierces (I2 Localization, Unity Localization) ou les wrappers standard.",
  "li_content_7": "<strong>Dynamic Key Prefixes :</strong> Liste des préfixes de clés (par exemple, <code>Item_</code>) qui ne seront pas supprimés lors du nettoyage (Remove Missing Keys), même si l'analyseur ne les a pas trouvés dans la scène.",
  "h2_tab_actions": "4.4. Onglet \"Actions\"",
  "p_actions_1": "L'onglet de travail principal.",
  "li_actions_1": "<strong>Parsing :</strong><ul><li><strong>Update Keys :</strong> Analyse complète du projet définie par les paramètres de l'onglet 'Content'.</li><li><strong>Scan Selected Assets :</strong> Analyse **UNIQUEMENT** les fichiers/dossiers actuellement sélectionnés dans la Vue Projet. Plus sûr pour les mises à jour partielles car il désactive automatiquement 'Remove Missing Keys'.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor :</strong> Ouvre une fenêtre séparée, plus pratique pour éditer toutes les traductions.",
  "li_actions_3": "<strong>Data Management :</strong> Utiliser pour échanger des données avec les traducteurs (Export/Import vers CSV/XML/YAML/XLIFF, importation depuis Google Sheets).",
  "li_actions_4": "<strong>Auto-Translation :</strong> Remplit automatiquement toutes les chaînes de traduction vides à l'aide du <strong>Translation Profile</strong> actif.",
  "li_actions_5": "<strong>Danger Zone :</strong> Contient des boutons pour supprimer complètement tous les composants de localisation du projet. À utiliser avec prudence !",
  "h2_tab_assets": "4.5. Onglet \"Assets\" (Ressources)",
  "p_assets_1": "Cet onglet est entièrement dédié à la localisation des ressources non textuelles.",
  "li_assets_1": "<strong>Créer une structure de dossiers (facultatif) :</strong> Dans la section <strong>2. Asset Folder Generation</strong>, cliquez sur <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Configurer les catégories et les règles de nommage :</strong> Dans la section <strong>3. Asset Categories & Scanning</strong>, assurez-vous que la <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) correspond à vos fichiers (par exemple, <code>button_ok_en.png</code>).",
  "li_assets_3": "<strong>Placez vos ressources :</strong> Mettez les ressources localisées dans les dossiers.",
  "li_assets_4": "<strong>Analyser les ressources :</strong> Dans la section <strong>4. Automation</strong>, cliquez sur <strong>Scan Assets & Update Tables</strong>. Le processus de nettoyage est devenu plus sûr : seuls les anciens fichiers de table (<code>.asset</code>) sont supprimés, et non le dossier entier.",
  "li_assets_5": "<strong>Lier les ressources aux objets :</strong> Cliquez sur <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Addressables Integration :</strong> Si le mode <strong>Addressables</strong> est activé, les ressources seront automatiquement enregistrées dans les groupes Addressables avec des adresses sous la forme <code>{Category}/{Language}/{Key}</code> pendant l'analyse.",
  "h2_tab_report": "4.6. Onglet \"Report\" (Rapport)",
  "p_report_1": "Après chaque analyse, ce rapport montre l'image complète de l'état de votre localisation.",
  "li_report_1": "<strong>Catégories :</strong> Toutes les Clés, Ajoutées, Mises à jour (texte modifié), Supprimées, Duplicatas, Migrées, Ignorées (inchangées).",
  "li_report_2": "<strong>Recherche Avancée :</strong> Cliquez sur le bouton <strong>Find</strong> à côté de n'importe quelle entrée pour trouver instantanément l'objet correspondant dans le projet. La recherche fonctionne de manière asynchrone, ne bloquant pas l'éditeur, et recherche dans toutes les scènes et prefabs.",
  "h1_translation_editor": "Éditeur de Table de Traduction",
  "p_editor_1": "S'ouvre via <strong>Tools -> Localization -> Translation Table Editor</strong>. C'est l'outil principal pour l'édition manuelle des traductions.",
  "li_editor_1": "<strong>Regroupement Intelligent :</strong> Les clés pour les pluriels et le genre (par exemple, <code>apple_count_one</code>, <code>apple_count_few</code>) sont automatiquement combinées en groupes réductibles.",
  "li_editor_2": "<strong>Édition Avancée :</strong> Cliquez sur une cellule pour ouvrir la fenêtre contextuelle <strong>MultiLineEditWindow</strong>. Elle affiche le texte source pour comparaison et valide les placeholders.",
  "li_editor_3": "<strong>Sélection Avancée (Nouveau) :</strong> Prend en charge la sélection de cellules individuelles, de lignes ou de colonnes entières (langues).",
  "li_editor_4": "<strong>Actions de Masse (Nouveau) :</strong> Faites un clic droit sur une sélection pour effectuer des opérations de masse : Traduire automatiquement les cellules sélectionnées, Effacer le contenu ou Supprimer les clés.",
  "li_editor_5": "<strong>Navigation Intelligente (Nouveau) :</strong> Naviguez dans la table à l'aide des flèches du clavier et des raccourcis (Ctrl+S pour enregistrer, Ctrl+Z/Y pour Annuler/Rétablir).",
  "li_editor_6": "<strong>Filtres de Validation :</strong> Utilisez des filtres avancés pour auditer votre projet : <ul><li><strong>Has Length Issues :</strong> Avertissement si la traduction est significativement plus longue que la source (+X%).</li><li><strong>Outdated Audio :</strong> Affiche les clés où le texte a changé mais l'audio n'a pas été régénéré.</li><li><strong>Missing Placeholders :</strong> Détecte si {0} est présent dans la source mais manquant dans la traduction.</li></ul>",
  "li_editor_7": "<strong>Statut Audio :</strong> La table affiche maintenant le statut des fichiers audio. Si le texte a changé mais que le fichier audio reste ancien (inadéquation de hachage), un avertissement (icône jaune) apparaîtra.",
  "li_editor_8": "<strong>Menu Contextuel Amélioré :</strong> Ajout des commandes : <strong>Generate Audio</strong> (créer une voix off pour les cellules sélectionnées) et <strong>AI Assistant</strong> (exécuter des commandes comme \"Fix Grammar\" ou \"Shorten\" en utilisant le profil d'IA sélectionné).",
  "h1_ai_profiles": "Profils d'IA et de Traduction (Nouveau v1.1)",
  "h2_ai_profiles_overview": "6.1. Profils de Traduction",
  "p_ai_intro": "La version 1.1 introduit un nouveau système de <strong>Translation Profile</strong> (ScriptableObject). Cela déplace les paramètres des services de traduction hors des paramètres globaux vers des ressources de profil individuelles, vous permettant de changer facilement de configuration.",
  "li_ai_1": "<strong>Créer un Profil :</strong> Clic droit dans la Vue Projet -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Services :</strong> Prend en charge DeepL, Google Translate, Microsoft Azure et <strong>l'IA Personnalisée</strong>.",
  "li_ai_3": "<strong>Paramètres :</strong> Chaque profil stocke sa propre clé API, ses limites (taille de lot, max. de caractères) et ses paramètres de modèle.",
  "li_ai_4": "<strong>AIPresetsGenerator :</strong> Utilisez le générateur intégré pour créer rapidement des profils pour les services populaires (OpenAI, Gemini, Claude, Ollama).",
  "h2_custom_ai": "6.2. IA et Modèles Personnalisés",
  "p_custom_ai": "Le type de service <strong>Custom AI</strong> vous permet de connecter n'importe quel LLM via l'API REST.",
  "li_custom_ai_1": "<strong>GenericAIService :</strong> Une implémentation flexible qui peut communiquer avec les API compatibles OpenAI (y compris les LLM locaux via Ollama).",
  "li_custom_ai_2": "<strong>Modèles :</strong> Personnalisez le modèle JSON du corps de la requête pour qu'il corresponde aux exigences de votre API.",
  "li_custom_ai_3": "<strong>Fonctionnalités de Sécurité Intégrées :</strong> Répare automatiquement les balises de formatage cassées (comme <ph0>) souvent renvoyées par les modèles d'IA, assurant des traductions fiables et cohérentes.",
  "h2_ai_context": "6.3. Contexte et Glossaire",
  "p_ai_context": "Pour améliorer la qualité de la traduction, l'IA reçoit désormais un contexte supplémentaire :",
  "li_context_1": "<strong>Developer Notes :</strong> Les commentaires de la table de traduction sont transmis à l'IA comme contexte.",
  "li_context_2": "<strong>Object Path :</strong> S'il n'y a pas de commentaire, le chemin de la hiérarchie de l'objet (par exemple, <code>MainMenu/Canvas/StartButton</code>) est utilisé comme contexte de repli.",
  "li_context_3": "<strong>Glossary :</strong> Vous pouvez charger un glossaire CSV dans le profil pour imposer des traductions spécifiques pour les termes et les noms.",
  "h2_ai_assistant": "6.4. Commandes de l'Assistant IA",
  "p_ai_assistant": "Dans l'Éditeur de Table de Traduction, vous pouvez maintenant exécuter des commandes d'IA personnalisées sur les cellules sélectionnées via le menu contextuel (Clic droit -> AI: ...).",
  "li_assistant_1": "<strong>Configurable :</strong> Définissez des commandes dans votre Profil de Traduction (par exemple, \"Fix Grammar\", \"Make Formal\", \"Shorten for UI\").",
  "li_assistant_2": "<strong>Traitement par Lots :</strong> Sélectionnez plusieurs cellules pour appliquer la commande à toutes en même temps.",
  "h1_usage_examples": "Exemples d'Utilisation",
  "h2_example_components": "7.1. Composants Prêts à l'Emploi et Exemples",
  "p_example_components_1": "Le projet comprend des scripts prêts à l'emploi qui servent d'excellents exemples.",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code> :</strong> Un composant prêt à l'emploi pour créer une liste déroulante d'interface utilisateur pour le changement de langue. Il trouve automatiquement toutes les langues disponibles et gère leur commutation.<br><strong>Comment l'utiliser :</strong> Ajoutez simplement le composant <code>LanguageSelector</code> à votre scène (par exemple, sur un GameObject vide) et spécifiez votre <code>TMP_Dropdown</code> dans l'inspecteur.",
  "li_example_components_2": "<strong>Exemples de Code :</strong> Pour apprendre des techniques avancées telles que travailler avec <code>[LocalizableField]</code>, la fonction <code>_()</code>, les pluriels et le genre, étudiez les fichiers <code>StatPurchaseTest.cs</code> et <code>TestLocalization.cs</code>. Ils démontrent clairement l'implémentation de toutes les principales fonctionnalités de l'outil dans le code.",
  "h2_example_attribute": "7.2. Attribut [LocalizableField]",
  "p_example_attribute_1": "La méthode préférée pour les textes qui font partie de la configuration d'un composant dans l'inspecteur. L'analyseur peut maintenant travailler avec des chaînes, des listes/tableaux de chaînes, et même des champs dans des classes <code>[System.Serializable]</code> imbriquées.",
  "code_example_attribute": "using Ankonoanko.Localization; // Requis pour [LocalizableField]\nusing UnityEngine;\nusing System.Collections.Generic;\npublic class QuestManager : MonoBehaviour\n{\n    // L'analyseur trouvera ce champ et créera une clé pour celui-ci\n    [LocalizableField]\n    private string defaultQuestFailedMessage = \"You have failed the quest.\";\n    \n    // Vous pouvez définir une clé personnalisée\n    [LocalizableField(\"custom_quest_start_dialog\")]\n    public string startDialog = \"Are you ready for an adventure?\";\n    \n    // Fonctionne avec les listes\n    [LocalizableField]\n    private List<string> missionObjectives = new List<string> { \"Find the treasure\" };\n    \n    // Et même avec des classes imbriquées !\n    [System.Serializable]\n    public class ItemInfo\n    {\n        [LocalizableField] public string Name;\n        [LocalizableField] public string Description;\n    }\n    \n    [LocalizableField]\n    private ItemInfo magicSword;\n}",
  "h2_example_function": "7.3. Fonction _() et Attribut [OnLanguageChange]",
  "p_example_function_1": "Utilisez la fonction <code>_()</code> pour le texte dynamique qui change pendant le jeu. La méthode qui met à jour l'interface utilisateur doit être marquée de l'attribut <code>[OnLanguageChange]</code> afin qu'elle soit appelée automatiquement lorsque la langue est changée. Un composant <code>LocalizedBehaviour</code> sera automatiquement ajouté à l'objet à cet effet.",
  "code_example_function": "// Pour utiliser l'appel court _(), ajoutez ces lignes\nusing static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization; // Requis pour [OnLanguageChange]\nusing UnityEngine;\nusing TMPro;\nusing System.Collections.Generic;\npublic class PlayerHUD : MonoBehaviour\n{\n    [SerializeField] private TMP_Text scoreText;\n    private int score = 100;\n    private string playerName = \"Alex\";\n    \n    void Start()\n    {\n        UpdateUI(); // Mise à jour initiale\n    }\n    \n    // Cette méthode sera appelée automatiquement lorsque la langue change\n    [OnLanguageChange]\n    void UpdateUI()\n    {\n        // 1. Placeholders indexés (comme dans string.Format)\n        // Clé : \"score_label\", Texte dans le fichier : \"Score: {0}\"\n        scoreText.text = _(\"score_label\", score); // Résultat : \"Score: 100\"\n        \n        // 2. Placeholders nommés (recommandé pour la lisibilité)\n        // Clé : \"welcome_message\", Texte : \"Welcome, {username}!\"\n        string welcomeText = _(\"welcome_message\", new { username = playerName });\n        \n        // Pour les cas complexes ou les hautes performances\n        var args = new Dictionary<string, object> { { \"username\", playerName } };\n        string welcomeText2 = _(\"welcome_message\", args);\n    }\n}",
  "h2_example_plurals": "7.4. Pluriels et Genre",
  "p_example_plurals_1": "L'outil utilise désormais des règles plus précises pour différents groupes de langues.",
  "code_example_plurals": "using static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Clés : \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Textes : \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Sélectionne automatiquement la forme correcte\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Clés : \"user_greeted_male\", \"user_greeted_female\"\n        // Textes : \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "h1_important_notes": "Notes Importantes et Avertissements",
  "li_notes_1": "<strong>Sauvegardes :</strong> Créez toujours une sauvegarde via <strong>Translation Table Editor -> Manage Backups</strong> avant des changements majeurs. Les sauvegardes sont stockées dans le dossier <code>LocalizationBackups</code> **à la racine du projet (en dehors du dossier Assets)** pour garder votre projet Unity propre et réduire les temps d'importation.",
  "li_notes_2": "<strong>Sécurité de la Clé API :</strong> La clé pour travailler dans l'éditeur est stockée localement sur votre machine (dans <code>EditorPrefs</code>) et n'entre pas dans le référentiel. Pour les clés nécessaires dans la construction du jeu, utilisez la section <strong>Runtime API Key</strong>.",
  "li_notes_3": "<strong>Dossier <code>StreamingAssets</code> :</strong> Les fichiers de traduction doivent se trouver dans un sous-dossier de <code>Assets/StreamingAssets/</code> pour être inclus dans la construction du jeu.",
  "li_notes_4": "<strong>\"Éviter les erreurs\" :</strong> L'outil vous protège automatiquement contre l'enregistrement accidentel de données temporaires du mode aperçu dans une scène ou un prefab.",
  "li_notes_5": "<strong>Performances :</strong> L'appel <code>_()</code> est rapide, mais dans les boucles qui s'exécutent à chaque image (par exemple, dans <code>Update</code>), essayez de mettre en cache le résultat dans une variable.",
  "li_notes_6": "<strong>Exclusion de <code>LanguageSelector</code> de l'analyse :</strong> L'objet avec le composant <code>LanguageSelector</code> et son <code>TMP_Dropdown</code> doivent être ajoutés à la liste <strong>Ignore Specific Objects</strong> dans l'onglet <strong>Content</strong>. Cela est nécessaire pour empêcher l'analyseur de créer des clés supplémentaires pour les options de la liste déroulante, car le script <code>LanguageSelector</code> les peuple dynamiquement au moment de l'exécution. L'ignorer empêche les conflits et maintient la propreté des fichiers de traduction.",
  "li_notes_7": "<strong>Polices pour <code>LanguageSelector</code> :</strong> Pour que la langue sélectionnée dans le <code>TMP_Dropdown</code> mette correctement à jour sa police, ajoutez manuellement un composant <code>LocalizedText</code> vide à l'objet enfant <strong>Label</strong> du Dropdown et cochez la case <code>isStyleOnly</code>.",
  "li_notes_addressables_code": "<strong>Code et Addressables :</strong> Si vous passez en mode <strong>Addressables (Async)</strong>, vous **DEVEZ** utiliser <code>GetLocalizedAssetAsync<T>()</code> dans vos scripts. L'appel du synchrone <code>GetLocalizedAsset<T>()</code> renverra null et enregistrera un avertissement pour éviter les gels du thread principal.",
  "li_content_regex_presets": "<strong>Modèles Regex Ignorés :</strong> Cliquez sur <strong>'Add Common Pattern'</strong> pour exclure rapidement le contenu dynamique comme les *URL, Emails, Dates, Prix et UUID* de la traduction sans écrire de Regex manuellement.",
  "li_notes_addressables_sync_warning": "<strong>Synchrone vs Asynchrone :</strong> Si vous passez en mode <strong>Addressables (Async)</strong>, vous **DEVEZ** mettre à jour votre code pour utiliser <code>GetLocalizedAssetAsync<T>()</code>. L'appel de la méthode synchrone renverra null et enregistrera un avertissement pour éviter de geler le thread principal.",
  "q_faq_custom_keys_attribute": "Puis-je utiliser mon propre attribut pour les clés au lieu de [LocalizableField] ?",
  "a_faq_custom_keys_attribute": "Oui. Dans l'onglet **Content Tab** sous 'Attributes to Scan', vous pouvez ajouter n'importe quel nom d'attribut (par exemple, <code>[Header]</code>, <code>[TermsPopup]</code>). L'analyseur traitera tout champ de chaîne avec cet attribut comme localisable.",
  "q_faq_tts_voices": "Comment attribuer des voix spécifiques aux personnages ?",
  "a_faq_tts_voices": "Dans votre **Translation Profile** (Inspecteur), utilisez la liste 'Voice Mappings'. Vous pouvez mapper un modèle Regex (par exemple <code>^hero_.*</code>) à un ID de voix spécifique. Le générateur choisira automatiquement la bonne voix en fonction du nom de la clé.",
  "h1_extending": "Extension des Fonctionnalités",
  "h2_custom_parser": "9.1. Créer un Analyseur Personnalisé",
  "p_custom_parser_1": "Vous pouvez facilement étendre le système pour prendre en charge des composants personnalisés en créant votre propre classe d'analyseur.",
  "li_custom_parser_1": "Créez un nouveau script C# dans le dossier **Editor** de votre projet.",
  "li_custom_parser_2": "Copiez le modèle ci-dessous dedans.",
  "li_custom_parser_3": "Modifiez la logique pour qu'elle corresponde à votre composant.",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing UnityEngine;\nusing Ankonoanko.Localization;\n\n// MODÈLE pour créer un analyseur pour un composant personnalisé.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings)\n    {\n        // 1. Vérifiez si l'objet a le composant personnalisé dont nous avons besoin.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Quitter si le composant n'est pas trouvé\n        }\n        \n        // 2. Obtenez le texte à partir des champs du composant personnalisé.\n        string titleText = component.Title;\n        \n        // 3. Vérifiez si le texte est valide pour la localisation.\n        if (TextParser.IsValidLocalizableText(titleText))\n        {\n            // 4. Générez la clé et la source à l'aide des aides de TextParser.\n            string key = TextParser.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode);\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            \n            // 5. Retournez le résultat.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Répétez pour les autres champs...\n        // (un suffixe peut être ajouté pour rendre les clés uniques)\n        string descriptionText = component.Description;\n        if (TextParser.IsValidLocalizableText(descriptionText))\n        {\n            string key = TextParser.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode) + \"_description\";\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "h1_faq": "FAQ et Dépannage",
  "h1_migration_tool": "Outil de Migration",
  "p_migration_tool_desc": "Outil pour la transition à partir d'autres systèmes de localisation (I2 Localization, Unity Localization).",
  "p_migration_tool_access": "Accès via <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "h2_migration_tool_features": "Fonctionnalités",
  "li_migration_tool_setup": "<strong>Étape 0 : Configuration :</strong> Configurez les noms des composants (par exemple, <code>Localize</code> pour I2) et les champs où la clé est stockée. Des préréglages sont disponibles.",
  "li_migration_tool_import": "<strong>Étape 1 : Importation de Données :</strong> Importez des fichiers CSV (I2) ou XLIFF (Unity Loc) pour créer une base de données de clés.",
  "li_migration_tool_converter": "<strong>Étape 2 : Convertisseur de Composants :</strong> Analysez les scènes et les prefabs. Remplace automatiquement les anciens composants (par exemple, <code>Localize</code>) par <code>LocalizedText</code> / <code>LocalizedAsset</code>, en transférant les clés.",
  "li_migration_tool_safemode": "<strong>Mode Sûr et Stubs d'Urgence :</strong> Les composants sont désactivés plutôt que supprimés. Comprend la fonctionnalité critique <strong>Emergency Stubs</strong> (activée via le symbole de définition ANKO_ENABLE_MIGRATION_STUBS) : génère de fausses classes de placeholder pour I2 Localization ou Unity Localization afin que votre projet puisse compiler immédiatement après la suppression de ces plugins. Cela évite les erreurs \"Le nom de type 'Localize' est introuvable\" et vous donne le temps de refactoriser correctement votre code pour utiliser le nouveau système. Activer les Stubs vous permet de corriger les erreurs de compilation après la suppression de l'ancien plugin de localisation.",
  "h1_font_glyph_manager": "Gestionnaire de Polices et de Glyphes",
  "p_font_glyph_manager_access": "Accès via <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "h2_font_glyph_manager_features": "Fonctionnalités",
  "li_font_glyph_analyze": "Analyse toutes les traductions et vérifie si la police attribuée (TMP_FontAsset) prend en charge tous les caractères utilisés.",
  "li_font_glyph_missing": "Affiche une liste des glyphes manquants.",
  "li_font_glyph_copy": "Permet de copier tous les caractères de langue uniques pour la génération d'atlas de polices.",
  "h1_pseudo_tool": "Outil de Pseudo-Localisation",
  "p_pseudo_tool_desc": "Outil pour tester les mises en page d'interface utilisateur avec du texte développé pour simuler des langues avec un texte plus long.",
  "p_pseudo_tool_access": "Accès via <strong>Tools -> Anko Localization Tool -> Pseudo-Localization Generator</strong>.",
  "h2_pseudo_tool_features": "Fonctionnalités",
  "li_pseudo_tool_setup": "<strong>Pseudo-Localization Generator :</strong> Générez une fausse langue (par exemple [E-x-p-a-n-d-e-d]) pour tester la résistance de votre mise en page d'interface utilisateur. Prend en charge l'expansion de la longueur du texte par un facteur (par exemple +40%) pour simuler l'expansion du texte allemand/russe.",
  "h1_ai_audio": "Audio IA / Synthèse Vocale (Text-to-Speech)",
  "h2_ai_audio_setup": "Configuration",
  "li_ai_audio_profile": "Dans <strong>Settings</strong>, sélectionnez le <strong>Active Audio Profile</strong> (par exemple, OpenAI TTS ou ElevenLabs).",
  "h2_ai_audio_usage": "Utilisation",
  "li_ai_audio_generate": "Dans l'<strong>Éditeur de Table de Traduction</strong>, sélectionnez les lignes/cellules -> Clic droit -> <strong>Generate Audio</strong>.",
  "li_ai_audio_save": "Les fichiers sont enregistrés dans le dossier spécifié dans le profil.",
  "li_ai_audio_hash": "<strong>Mise à Jour Intelligente et Hachage :</strong> L'outil calcule un hachage MD5 de votre contenu textuel et ne régénère les fichiers audio que si le texte source a changé, économisant ainsi vos crédits API. Il détecte si la traduction a changé depuis la dernière génération audio. L'éditeur met en évidence ces lignes avec une icône 'Obsolète' (jaune), vous permettant de mettre à jour **UNIQUEMENT** les lignes modifiées. Cette fonctionnalité de regroupement intelligent empêche les appels API inutiles et réduit les coûts lors de la régénération audio. L'outil hache votre texte et ne régénère les fichiers audio que si le texte source a changé, économisant ainsi vos crédits API.",
  "li_ai_audio_voice_mapping": "<strong>Voice Mapping (Multi-Haut-Parleur) :</strong> Attribuez différentes voix d'IA à différents personnages automatiquement. Dans le <strong>Translation Profile</strong>, utilisez la liste 'Voice Mappings' pour lier un modèle Regex (par exemple, <code>^hero_.*</code>) à un ID de voix spécifique. L'outil utilisera automatiquement la bonne voix en fonction du nom de la clé.",
  "h2_example_components_updated": "LanguageSelector.cs Mis à Jour",
  "p_example_components_updated": "Le code a changé. Le chargement de la langue (surtout lors de l'utilisation d'Addressables) est maintenant asynchrone.",
  "li_example_components_old": "<strong>Ancien :</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (synchrone/void).",
  "li_example_components_new": "<strong>Nouveau :</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code> (asynchrone/Coroutine).",
  "h2_localizedasset_updated": "Chargement Asynchrone de LocalizedAsset",
  "p_localizedasset_updated": "Le composant prend désormais en charge le chargement asynchrone. Notez qu'il peut y avoir un léger délai lors du changement de langue si les ressources sont chargées depuis le cloud/disque (Addressables).",
  "h2_faq_installation": "10.1. Installation et Démarrage Rapide",
  "q_faq_installation_1": "Que se passe-t-il si mon projet a déjà le package com.unity.nuget.newtonsoft-json provenant d'une autre ressource ? L'installateur de dépendances essaiera-t-il de le mettre à jour ou de l'ignorer ?",
  "a_faq_installation_1": "L'installateur vérifie l'existence du type Newtonsoft.Json.JsonConvert. Si le type existe, il considère la dépendance satisfaite et ne tentera pas d'installer ou de mettre à jour le package. Ceci est fait pour éviter les conflits de version.",
  "q_faq_installation_2": "J'ai cliqué accidentellement sur \"Skip for Now\" et coché \"Don't ask again\" pour les dépendances optionnelles (par exemple, pour le support CSV). Comment puis-je faire apparaître à nouveau la fenêtre d'installation pour les installer ?",
  "a_faq_installation_2": "Vous pouvez déclencher manuellement une vérification des dépendances à tout moment via le menu Tools -> Localization -> Check Dependencies. Cela réinitialisera le drapeau \"Don't ask again\" et affichera à nouveau la fenêtre avec tous les packages optionnels manquants.",
  "q_faq_installation_3": "L'outil n'a pas créé LocalizationSettings.asset dans Assets/Resources. Pourquoi cela aurait-il pu se produire, et puis-je le créer manuellement via le menu Assets -> Create ?",
  "a_faq_installation_3": "Cela peut se produire si vous n'avez pas de dossier Assets/Resources. L'outil essaiera de le créer, mais les autorisations du système de fichiers peuvent l'en empêcher. Oui, vous pouvez créer la ressource manuellement : faites un clic droit dans le dossier Resources, sélectionnez Create -> Localization -> Settings. L'outil le trouvera automatiquement.",
  "q_faq_installation_4": "Puis-je déplacer le fichier LocalizationSettings.asset vers un autre dossier Resources, par exemple Assets/MyGame/Resources ? L'outil le trouvera-t-il toujours ?",
  "a_faq_installation_4": "Oui. L'outil utilise Resources.Load(), qui recherche une ressource par nom dans tous les dossiers nommés Resources de votre projet. L'important est que le fichier conserve son nom LocalizationSettings.asset.",
  "q_faq_installation_5": "L'installateur de dépendances a gelé ou a donné une erreur. Puis-je installer les dépendances (Newtonsoft Json, Editor Coroutines) manuellement via le Gestionnaire de Paquets Unity ?",
  "a_faq_installation_5": "Oui. Vous pouvez ouvrir Window -> Package Manager, cliquer sur l'icône \"+\" et sélectionner \"Add package by name...\". Entrez les noms des packages : com.unity.nuget.newtonsoft-json et com.unity.editorcoroutines.",
  "h2_faq_components": "10.2. Composants de Base",
  "q_faq_components_1": "Le composant LocalizedPrefab désactive les MonoBehaviours sur l'objet original. Que se passe-t-il si l'objet original a un script qui crée d'autres objets ou s'abonne à des événements dans Awake() ? Ce code sera-t-il exécuté ?",
  "a_faq_components_1": "Non, il ne le sera pas. La désactivation d'un MonoBehaviour empêche l'appel de toutes les méthodes \"magiques\" d'Unity, y compris Awake(), OnEnable() et Start(). C'est intentionnel pour éviter l'exécution d'une double logique. Toute l'initialisation doit avoir lieu dans des scripts sur les versions localisées du prefab.",
  "q_faq_components_2": "Si le prefab original (LocalizedPrefab) a un Rigidbody ou un autre composant physique, sera-t-il désactivé ? Cela affectera-t-il la physique si le prefab localisé ne l'a pas ?",
  "a_faq_components_2": "Oui, le comportement physique de l'objet original sera neutralisé. Le composant LocalizedPrefab trouve tous les composants Rigidbody et Rigidbody2D sur son GameObject et définit leur propriété isKinematic sur true. Cela les retire effectivement des calculs de physique dynamique, empêchant un comportement indésirable comme un objet invisible qui tombe ou réagit aux collisions. Il est toujours recommandé que la version localisée du prefab contienne tous les composants physiques nécessaires pour un comportement correct.",
  "q_faq_components_3": "Le composant LocalizedAsset stocke le nom du composant cible sous forme de chaîne (_targetComponentTypeName). Que se passe-t-il si je renomme un script de composant personnalisé ou le déplace vers un autre assembly (Assembly Definition) ? LocalizedAsset cessera-t-il de fonctionner pour celui-ci ?",
  "a_faq_components_3": "Oui, il cessera de fonctionner. Le composant stocke le nom de type complet, y compris l'espace de noms et l'assembly. Le renommage du script ou son déplacement vers un autre .asmdef modifiera ce nom, et LocalizedAsset ne pourra pas trouver le composant cible. Vous devrez exécuter une autre analyse via Analyze Project & Attach Components pour qu'il mette à jour le nom.",
  "q_faq_components_4": "S'il y a deux composants Image sur le même GameObject, comment LocalizedAsset sait-il lequel localiser ? Fonctionnera-t-il avec les deux ou seulement le premier qu'il trouve ?",
  "a_faq_components_4": "Un LocalizedAsset est créé pour une instance de composant spécifique. Il détient une référence à ce composant dans le code. Si vous ajoutez manuellement un deuxième LocalizedAsset et utilisez le menu contextuel \"Analyze for Localization\" pour cibler la deuxième Image, vous aurez deux composants LocalizedAsset, chacun gérant sa propre Image. L'analyseur automatique ne créera un composant que pour la première Image avec une ressource localisable qu'il trouve.",
  "q_faq_components_5": "La documentation indique que LocalizedPrefab a un ordre d'exécution de -100. Que se passe-t-il si j'ai un autre script avec un ordre d'exécution de -110 qui essaie de trouver un objet enfant créé par LocalizedPrefab dans son Awake() ? LocalizedPrefab aura-t-il instancié son instance à temps ?",
  "a_faq_components_5": "Oui, il le fera. LocalizedPrefab crée l'instance du prefab localisé dans sa méthode OnEnable(). L'ordre d'exécution d'Unity garantit que toutes les méthodes Awake() sont exécutées avant toutes les méthodes OnEnable(). Ainsi, votre script avec l'ordre -110 exécutera son Awake(), puis LocalizedPrefab avec l'ordre -100 exécutera son Awake(), et ce n'est qu'après cela que leurs méthodes OnEnable() seront appelées dans l'ordre. Votre script ne trouvera pas l'objet car il n'aura pas encore été créé.",
  "q_faq_components_6": "Le composant LocalizedText a une option isStyleOnly. Si je l'active, puis que j'appelle myLocalizedText.SetFormattedText(\"new_key\") dans le code, le texte changera-t-il, ou seulement le style (police/RTL) ?",
  "a_faq_components_6": "La clé et le texte changeront. L'appel de SetFormattedText par programmation annule le comportement isStyleOnly pour cette mise à jour spécifique. L'option isStyleOnly est destinée à empêcher le composant de réagir aux changements de langue globaux, mais il réagira toujours à un changement de clé direct via le code.",
  "q_faq_components_7": "LocalizedBehaviour trouve automatiquement les méthodes avec l'attribut [OnLanguageChange]. Trouverat-il les méthodes privées et protégées, ou doivent-elles être publiques ?",
  "a_faq_components_7": "Il trouvera les méthodes avec n'importe quel modificateur d'accès (public, private, protected, internal). La réflexion dans Unity permet la découverte de toutes les méthodes d'instance quel que soit leur niveau d'accès.",
  "q_faq_components_8": "Le composant LocalizedAsset intercepte Play on Awake. Que se passe-t-il si un autre script sur le même objet essaie d'accéder à la ressource (par exemple, audioSource.clip.length) dans Awake() ou Start() avant que LocalizedAsset ne l'ait échangée ? Une NullReferenceException ou l'utilisation de l'ancienne ressource est-elle possible ?",
  "a_faq_components_8": "L'utilisation de l'ancienne ressource (non localisée) est possible. LocalizedAsset effectue l'échange dans son OnEnable(). Les méthodes Awake() de tous les scripts sont exécutées avant OnEnable(). Si votre script accède à audioSource.clip dans Awake(), il obtiendra le clip original. S'il y accède dans Start(), le résultat dépendra de l'ordre d'exécution du script. Pour garantir l'accès à la ressource localisée, définissez un ordre d'exécution ultérieur pour votre script ou accédez à la ressource dans une méthode marquée de [OnLanguageChange].",
  "h2_faq_window": "10.3. Fenêtre \"Localization Tool\"",
  "h3_faq_window_preview": "Aperçu dans l'Éditeur",
  "q_faq_window_preview_1": "J'ai ouvert un prefab en Mode Prefab, appliqué l'Aperçu dans l'Éditeur et appuyé sur Ctrl+S. Les données d'aperçu temporaires seront-elles enregistrées dans la ressource prefab ? Comment LocalizationPreviewProtector gère-t-il ce cas ?",
  "a_faq_window_preview_1": "Non, elles ne seront pas enregistrées. LocalizationPreviewProtector intercepte l'événement de sauvegarde des ressources (OnWillSaveAssets) et appelle automatiquement RevertEditorPreview() avant qu'Unity n'écrive les modifications sur le disque. Ainsi, le prefab sera enregistré dans son état original et non localisé.",
  "q_faq_window_preview_2": "Si j'active l'Aperçu dans l'Éditeur et que l'éditeur Unity plante, et que le fichier Temp/localization_preview_recovery.json est corrompu (par exemple, JSON vide ou invalide), que se passera-t-il au prochain lancement ?",
  "a_faq_window_preview_2": "PreviewCrashProtector est enveloppé dans un bloc try-catch. Si la désérialisation JSON échoue, une erreur sera enregistrée dans la console concernant l'incapacité de récupérer, et le processus se terminera silencieusement. Votre scène restera dans l'état \"cassé\" dans lequel elle se trouvait au moment du crash. Dans ce cas, vous devrez sélectionner manuellement \"Revert to Original\" dans la fenêtre de l'outil pour forcer un retour en arrière des modifications.",
  "q_faq_window_preview_3": "En mode Aperçu dans l'Éditeur pour LocalizedPrefab, une instance temporaire est créée. Les méthodes Awake() et Start() seront-elles exécutées sur cette instance ? Cela pourrait-il provoquer des erreurs si elles ne sont pas conçues pour s'exécuter en Mode Édition ?",
  "a_faq_window_preview_3": "Oui, elles le seront. PrefabUtility.InstantiatePrefab en Mode Édition appelle Awake() et OnEnable(). Si ces méthodes contiennent une logique qui ne devrait pas s'exécuter dans l'éditeur (par exemple, accéder à des singletons qui n'existent qu'en Mode Lecture), cela pourrait provoquer des erreurs. Il est recommandé d'utiliser if (Application.isPlaying) ou #if UNITY_EDITOR pour protéger un tel code.",
  "h3_faq_window_settings": "Onglet \"Settings\" (Paramètres)",
  "q_faq_window_settings_1": "Je peux changer le Mode de Génération de Clé de UseTextAsKey à AutoGenerateKeysOnly en milieu de projet. Que se passera-t-il exactement avec mes traductions existantes ? Seront-elles mappées aux nouvelles clés ?",
  "a_faq_window_settings_1": "Oui, elles le seront. Lors du changement de mode, l'outil effectue une \"migration sûre\" : il ré-analyse l'ensemble du projet, crée de nouvelles clés selon les nouvelles règles, mais mappe les anciennes et les nouvelles clés via le texte original. Il transfère ensuite toutes vos traductions et commentaires existants des anciennes clés vers les nouvelles. Vos traductions ne seront pas perdues.",
  "q_faq_window_settings_2": "Si j'ajoute une langue avec un code qui n'a pas de règles de pluralisation (par exemple, \"kz\" pour le Kazakh) à la liste des Langues Prises en Charge, quelle règle sera utilisée par défaut ?",
  "a_faq_window_settings_2": "La règle DefaultPluralRule sera utilisée, qui convient à l'anglais et à la plupart des langues européennes (formes pour \"one\" et \"other\").",
  "q_faq_window_settings_3": "Que se passe-t-il si je spécifie le Translations Path non pas dans StreamingAssets, mais dans un dossier ordinaire comme Assets/MyTranslations ? Les fichiers json seront-ils inclus dans la construction du jeu ?",
  "a_faq_window_settings_3": "Non, ils ne le seront pas. Seules les ressources situées dans un dossier StreamingAssets ou Resources sont garanties d'être incluses dans la construction. Si vous spécifiez un chemin différent, la localisation fonctionnera dans l'éditeur mais ne fonctionnera pas dans le jeu compilé, car les fichiers de traduction ne feront pas partie de la construction.",
  "q_faq_window_settings_4": "La clé API de traduction automatique est stockée dans EditorPrefs. Si je travaille sur le projet sur deux ordinateurs différents, dois-je saisir la clé sur chaque machine séparément ?",
  "a_faq_window_settings_4": "Oui. EditorPrefs est un stockage local pour chaque ordinateur. Vous devrez saisir la clé API sur chaque machine à partir de laquelle vous prévoyez d'utiliser la fonctionnalité de traduction automatique.",
  "h3_faq_window_content": "Onglet \"Content\" (Contenu)",
  "q_faq_window_content_1": "Que se passe-t-il si j'ajoute une scène à Scenes to Parse qui n'est pas incluse dans les Build Settings ? Cela affectera-t-il quelque chose d'autre que le processus d'analyse lui-même ?",
  "a_faq_window_content_1": "Non, cela n'affectera rien. La liste Scenes to Parse est utilisée exclusivement pour indiquer à l'outil quelles scènes ouvrir et analyser pour le texte. Elle n'est en aucun cas liée aux scènes qui se retrouveront dans la construction finale de votre jeu.",
  "q_faq_window_content_2": "J'ai ajouté un objet à Ignore Specific Objects (la liste temporaire). Si je fais un prefab de cet objet, l'instance de ce prefab sera-t-elle également ignorée ?",
  "a_faq_window_content_2": "Non, elle ne le sera pas. La liste temporaire stocke une référence directe à l'objet dans la scène. Lorsque vous créez un prefab, c'est une nouvelle ressource. Ses instances sont des objets différents, et la règle d'ignorance ne s'appliquera pas à elles. Pour ignorer définitivement les prefabs, ils doivent être ajoutés à la liste d'ignorés en tant que ressource prefab.",
  "q_faq_window_content_3": "Si j'ajoute le composant TMPro.TMP_Text à Parsing Ignores -> Ignore Component Types, mais qu'il y a un objet dans la scène avec un LocalizedText qui référence déjà ce TMP_Text, que se passera-t-il lors de la prochaine mise à jour des clés (Update Keys) ? La clé sera-t-elle supprimée ?",
  "a_faq_window_content_3": "Oui, elle le sera. Lorsque vous cliquez sur Update Keys, l'analyseur rescane l'ensemble du projet. Il verra que le type TMPro.TMP_Text doit être ignoré et ne générera pas de clé pour celui-ci. Pendant le processus de comparaison des anciennes et des nouvelles clés, il déterminera que l'ancienne clé n'est plus utilisée et la marquera comme \"Removed\".",
  "q_faq_window_content_4": "La documentation indique que \"Pin\" enregistre le chemin complet de l'objet et se brisera s'il est renommé. Que se passe-t-il si je fais un prefab à partir de l'objet, puis renomme l'objet original – \"Pin\" continuera-t-il de fonctionner pour les instances de prefab ?",
  "a_faq_window_content_4": "Non, il ne le fera pas. \"Pin\" enregistre le chemin absolu dans la hiérarchie de la scène au moment où le bouton est cliqué (par exemple, Canvas/Panel/Button). Ce chemin n'est pas lié à la logique des prefabs. Les instances de prefab auront le même chemin, mais si vous renommez l'objet parent dans la scène, \"Pin\" cessera de fonctionner à la fois pour l'original et pour les instances.",
  "q_faq_window_content_5": "Si j'utilise \"Pin\" pour un objet enfant à l'intérieur d'une instance de prefab, quel chemin sera enregistré : relatif à la racine du prefab ou à la racine de la scène ? Cela fonctionnera-t-il dans d'autres scènes ?",
  "a_faq_window_content_5": "Le chemin complet à partir de la racine de la scène sera enregistré. Par exemple, MyPrefab(Clone)/Content/Icon. Ce chemin \"épinglé\" ne fonctionnera que dans la scène où vous l'avez créé. Dans d'autres scènes, un tel chemin est peu probable d'être trouvé.",
  "h3_faq_window_actions": "Onglet \"Actions\"",
  "h3_faq_window_assets": "Onglet \"Assets\" (Ressources)",
  "h3_faq_window_report": "Onglet \"Report\" (Rapport)",
  "h2_faq_editor": "10.4. Éditeur de Traduction",
  "h2_faq_examples": "10.5. Exemples d'Utilisation et Code",
  "h2_faq_notes": "10.6. Nuances et Avertissements Importants",
  "h2_faq_extending": "10.7. Extension des Fonctionnalités",
  "q_faq_window_actions_1": "Que se passe-t-il si la connexion Internet est perdue pendant une traduction automatique par lots ? L'outil réessayera-t-il le lot échoué selon la Politique de Réessai, ou le processus sera-t-il complètement interrompu ?",
  "a_faq_window_actions_1": "L'outil tentera de renvoyer le lot exact qui a échoué, selon les paramètres de la Politique de Réessai (nombre de tentatives et délai). Si toutes les tentatives pour ce lot échouent, le processus de traduction pour la langue actuelle sera interrompu, et une erreur sera enregistrée dans la console. La traduction pour les langues suivantes dans la file d'attente ne démarrera pas.",
  "q_faq_window_actions_2": "Si j'importe un fichier CSV qui contient des clés qui existent déjà dans le projet mais avec des valeurs vides pour certaines langues, ces valeurs vides remplaceront-elles mes traductions existantes ou seront-elles ignorées ?",
  "a_faq_window_actions_2": "Les valeurs vides remplaceront les traductions existantes. Le processus d'importation considère le fichier CSV comme la \"source de vérité\". Si la valeur pour la clé welcome_message dans la colonne ru est vide, la traduction russe actuelle pour cette clé sera écrasée.",
  "q_faq_window_actions_3": "La section \"Danger Zone\" permet de supprimer tous les composants. Supprimera-t-elle les composants des prefabs qui se trouvent dans des dossiers non spécifiés dans les Prefab Folders de l'onglet Content ?",
  "a_faq_window_actions_3": "Oui, elle le fera. Les fonctions de la \"Danger Zone\" analysent tous les prefabs du projet (AssetDatabase.FindAssets(\"t:Prefab\")), et pas seulement ceux spécifiés dans la liste d'analyse, pour assurer le nettoyage le plus complet possible.",
  "q_faq_window_actions_4": "Lors de l'importation à partir de Google Sheets, comment dois-je formater la colonne des commentaires pour que la validation des placeholders à l'aide de la directive @placeholders: fonctionne ?",
  "a_faq_window_actions_4": "Dans votre document Google Sheets, la colonne doit être intitulée \"Developer Notes\". Dans les cellules de cette colonne, vous pouvez écrire des commentaires comme d'habitude. Pour spécifier des placeholders, ajoutez simplement une ligne comme @placeholders: {username}, {score} dans le texte du commentaire. L'outil reconnaîtra automatiquement cette directive lors de l'importation.",
  "q_faq_window_actions_5": "L'outil peut-il importer des données à partir de plusieurs feuilles d'un même document Google Sheets, ou ne fonctionne-t-il qu'avec une seule feuille par GID ?",
  "a_faq_window_actions_5": "L'outil ne fonctionne qu'avec une seule feuille à la fois. L'URL d'importation comprend un paramètre gid=..., qui identifie de manière unique une feuille spécifique dans le document. Pour importer des données à partir d'une autre feuille, vous devez copier son URL (avec un GID différent) et effectuer à nouveau l'importation.",
  "q_faq_window_assets_1": "Que se passe-t-il si j'ai deux ressources avec la même clé mais des types différents dans le même dossier d'analyse (par exemple, sound_effect_en.mp3 et sound_effect_en.wav) ? Lequel se retrouvera dans la table des ressources ?",
  "a_faq_window_assets_1": "Le scanneur de ressources les charge en spécifiant le type attendu (AssetDatabase.LoadAssetAtPath(path, expectedType)). Pour la catégorie AudioClip, il ne recherchera et ne chargera que les fichiers qu'Unity reconnaît comme AudioClips. Si les deux fichiers sont des clips audio valides, celui qui est traité en dernier sera inclus dans la table, écrasant effectivement le précédent. Il est recommandé d'éviter de tels doublons.",
  "q_faq_window_assets_2": "Si je clique sur Scan Assets & Analyze Project, et qu'il y a un objet Image dans la scène pour lequel un sprite localisé existe déjà, mais que l'objet Image lui-même n'a pas encore de composant LocalizedAsset, l'outil ajoutera-t-il le composant et insérera-t-il automatiquement la clé ?",
  "a_faq_window_assets_2": "Oui, c'est exactement comme ça que ça fonctionne. \"Analyze Project\" trouve le composant Image, regarde le nom du sprite qui lui est attribué (par exemple, icon_play_en), en extrait la clé (icon_play) et la langue (en), puis ajoute un composant LocalizedAsset à ce GameObject et y écrit la clé icon_play.",
  "q_faq_window_assets_3": "Puis-je utiliser la même Règle de Nommage pour différentes catégories de ressources si elles ont des Dossiers d'Analyse différents ? Cela causera-t-il des conflits ?",
  "a_faq_window_assets_3": "Oui, vous pouvez. Il n'y aura pas de conflits, car une table de ressources séparée (LocalizedAssetTable) est créée pour chaque catégorie. Les clés de la catégorie \"Sprites\" ne se chevauchent pas avec les clés de la catégorie \"AudioClips\", même si elles portent le même nom.",
  "q_faq_window_assets_4": "Si une ressource localisable (par exemple, button_ok_en.png) ne se trouve pas à la racine du Dossier d'Analyse, mais dans un sous-dossier, le scanneur la trouvera-t-il ?",
  "a_faq_window_assets_4": "Oui, il le fera. Le scanneur utilise l'option SearchOption.AllDirectories, ce qui signifie qu'il vérifiera récursivement tous les sous-dossiers du Dossier d'Analyse que vous spécifiez.",
  "q_faq_window_report_1": "Le bouton \"Find\" recherche l'objet de manière asynchrone. Que se passe-t-il si je lance une recherche et que je clique immédiatement sur Update Keys ? La recherche sera-t-elle interrompue ?",
  "a_faq_window_report_1": "Oui, elle sera interrompue. Toute nouvelle action qui nécessite un blocage de l'interface utilisateur (comme Update Keys) arrêtera la coroutine de recherche en cours. Une boîte de dialogue apparaîtra, vous invitant à arrêter la recherche actuelle pour en démarrer une nouvelle.",
  "q_faq_window_report_2": "Si une clé est utilisée à plusieurs endroits (par exemple, sur deux boutons différents dans des scènes différentes), comment cela sera-t-il affiché dans le rapport sous la catégorie \"Duplicates\" ?",
  "a_faq_window_report_2": "La catégorie \"Duplicates\" affichera toutes les sources pour cette clé. Vous verrez une entrée pour la clé, et le champ \"Source\" listera tous les chemins (dans la scène 1 et la scène 2). Le bouton \"Find\" dans ce cas ouvrira une liste déroulante, vous permettant de choisir à quel objet naviguer.",
  "q_faq_window_report_3": "Si je clique sur \"Find\" pour une clé qui n'est utilisée que dans le code (via la fonction _()), que se passera-t-il ? L'outil sera-t-il capable de trouver et de surligner le script C# ?",
  "a_faq_window_report_3": "Oui. Le système de recherche est spécifiquement formé pour reconnaître les sources comme le script MyScript.cs. Lorsque vous cliquez sur \"Find\", il recherchera la ressource MyScript.cs dans le projet et la surlignera (ping) dans la fenêtre Projet.",
  "q_faq_editor_1": "Qu'est-ce qui a la priorité la plus élevée pour la validation des placeholders : la directive @placeholders: dans le commentaire ou les placeholders trouvés dans le texte source de la langue ? Par exemple, si le texte source a {name} et que le commentaire dit @placeholders: {username}.",
  "a_faq_editor_1": "La directive @placeholders: dans le commentaire a la priorité. Elle est considérée comme une instruction explicite du développeur et la \"source de vérité\". Dans votre exemple, l'éditeur exigera {username} dans la traduction et ignorera {name} du texte source.",
  "q_faq_editor_2": "Si je fais une faute de frappe dans la directive (par exemple, @placeholder: au lieu de @placeholders:), sera-t-elle ignorée ou l'outil émettra-t-il un avertissement ?",
  "a_faq_editor_2": "Elle sera simplement ignorée. L'outil recherche une correspondance exacte de @placeholders:. Si la directive est mal orthographiée, elle sera traitée comme faisant partie d'un commentaire régulier, et la validation fonctionnera à l'ancienne - basée sur les placeholders du texte source.",
  "q_faq_editor_3": "Le système de sauvegarde automatique crée des fichiers dans le dossier Backups/AutoSaves. Ces fichiers seront-ils automatiquement supprimés après une sauvegarde manuelle réussie ou la fermeture de la fenêtre ?",
  "a_faq_editor_3": "Oui. Lors d'une sauvegarde manuelle réussie ou d'une fermeture normale de la fenêtre (lorsque vous enregistrez les modifications), tous les fichiers de sauvegarde automatique sont supprimés pour éviter de demander la récupération au prochain lancement. Ils ne restent qu'en cas de plantage de l'éditeur.",
  "q_faq_editor_4": "Si je modifie la largeur des colonnes dans l'éditeur, ces paramètres seront-ils enregistrés entre les sessions Unity ?",
  "a_faq_editor_4": "Oui. La largeur des colonnes est enregistrée dans EditorPrefs chaque fois que vous fermez la fenêtre de l'éditeur de traduction et sera restaurée la prochaine fois que vous l'ouvrirez.",
  "q_faq_editor_5": "La fenêtre contextuelle d'édition de texte (MultiLineEditWindow) prend-elle en charge sa propre pile Annuler/Rétablir (via Ctrl+Z) pour les modifications effectuées à l'intérieur ?",
  "a_faq_editor_5": "Oui. La MultiLineEditWindow a sa propre pile Annuler/Rétablir temporaire qui fonctionne tant que la fenêtre est ouverte. Cela vous permet d'annuler et de rétablir les modifications de texte dans cette fenêtre. Une fois que vous enregistrez le résultat (en fermant la fenêtre), cette modification est enregistrée comme une action unique dans la pile Annuler/Rétablir globale de l'éditeur principal.",
  "q_faq_examples_1": "Que se passe-t-il si les noms de propriété dans le type anonyme passé à la fonction _() ne correspondent pas aux placeholders dans la chaîne ? Par exemple, _(\"Hello, {username}\", new { user_name = \"Bob\" }). Y aura-t-il une erreur, ou le placeholder ne sera-t-il tout simplement pas remplacé ?",
  "a_faq_examples_1": "Il n'y aura pas d'erreur. Le placeholder {username} ne sera tout simplement pas remplacé, et vous obtiendrez la chaîne \"Hello, {username}\" en conséquence. Le remplacement ne se produit qu'avec une correspondance de nom exacte.",
  "q_faq_examples_2": "L'attribut [LocalizableField] fonctionne pour les champs privés. Fonctionnera-t-il pour les champs statiques ?",
  "a_faq_examples_2": "Oui, il le fera. L'analyseur utilise la réflexion pour trouver les champs avec les drapeaux BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static, il trouvera et traitera donc les champs statiques.",
  "q_faq_examples_3": "Si je mets l'attribut [OnLanguageChange] sur une méthode avec des paramètres (par exemple, void UpdateUI(string newLang)), que se passera-t-il ? Y aura-t-il une erreur de compilation ou un avertissement d'exécution ?",
  "a_faq_examples_3": "Il n'y aura pas d'erreur de compilation, mais un avertissement de LocalizedBehaviour apparaîtra dans la console Unity au moment de l'exécution. Il signalera qu'il a trouvé une méthode avec l'attribut mais l'a ignorée car la méthode a des paramètres. Une telle méthode ne sera pas appelée.",
  "q_faq_examples_4": "J'utilise _(\"apple_count\", count). S'il n'y a pas de clé apple_count_one pour la langue actuelle (pour count = 1), quelle forme le système choisira-t-il ? Utiliserat-il apple_count_other comme solution de repli ?",
  "a_faq_examples_4": "Oui. Si une forme spécifique (_one, _few, etc.) n'est pas trouvée, le système essaiera d'utiliser la clé avec le suffixe _other comme solution de repli. Si celle-ci n'est pas non plus trouvée, la traduction pour la clé de base apple_count sera utilisée.",
  "q_faq_examples_5": "La fonction _(\"key\", new { username = \"Alex\" }) utilise un type anonyme. Cela ne créera-t-il pas une \"charge\" excessive sur le ramasse-miettes (GC) avec des appels fréquents dans une méthode Update() par rapport au passage d'un Dictionary<string, object> pré-créé ?",
  "a_faq_examples_5": "Oui, il le fera. Chaque appel à new { ... } alloue de la mémoire sur le tas géré, ce qui crée un travail supplémentaire pour le ramasse-miettes. Pour le texte qui est mis à jour à chaque image (dans Update ou LateUpdate), il est nettement plus performant de créer un Dictionary<string, object> une fois dans Start(), et de ne mettre à jour ses valeurs dans Update() qu'avant de le transmettre à la fonction _().",
  "q_faq_examples_6": "Ma méthode marquée de [OnLanguageChange] n'est pas appelée. Pourquoi ?",
  "a_faq_examples_6": "Vérifiez si votre méthode a des paramètres. L'attribut <code>[OnLanguageChange]</code> ne fonctionne que sur les méthodes **sans paramètres** (par exemple, <code>void UpdateUI()</code>). Si votre méthode nécessite des arguments, enveloppez-la dans une méthode sans paramètres.",
  "q_faq_notes_1": "La documentation recommande d'ajouter LanguageSelector à la liste d'ignorés. Qu'est-ce qui se brisera exactement si j'oublie de le faire ? Des clés supplémentaires seront-elles créées pour \"Option A, Option B\" ?",
  "a_faq_notes_1": "Oui. Si vous n'ajoutez pas LanguageSelector à la liste d'ignorés, l'analyseur traitera son TMP_Dropdown comme une liste déroulante ordinaire. Il trouvera le \"Option A, Option B, Option C\" par défaut qu'Unity crée et ajoutera des clés pour eux à vos fichiers de traduction. Cela encombrera vos fichiers de clés inutiles, car LanguageSelector supprimera ces options au moment de l'exécution et créera les siennes de toute façon.",
  "q_faq_notes_2": "Si j'oublie d'ajouter un LocalizedText vide avec la case à cocher isStyleOnly activée sur le Label à l'intérieur du TMP_Dropdown utilisé par LanguageSelector, la police ne changera-t-elle pas ? Pourquoi est-ce nécessaire ?",
  "a_faq_notes_2": "Oui, la police ne changera pas. C'est nécessaire car LanguageSelector modifie directement la propriété label.text. Sans un LocalizedText sur cet objet, le système de localisation ne sait pas que cet élément a besoin de styles (police, RTL) appliqués lorsque la langue change. Un LocalizedText vide avec isStyleOnly sert de \"marqueur\" pour le système, disant : \"Surveillez cet objet et appliquez-lui des styles, mais ne touchez pas à son texte\".",
  "q_faq_notes_3": "L'appel de _() dans la méthode Update() n'est pas recommandé. Mais que se passe-t-il si je dois mettre à jour le texte à chaque image (par exemple, un minuteur) ? Quelle est la manière la plus performante de le faire, en mettant en cache uniquement la chaîne de format ?",
  "a_faq_notes_3": "L'approche la plus performante consiste à mettre en cache la chaîne de format dans Start() ou dans une méthode [OnLanguageChange], et à utiliser string.Format régulier dans Update(). Exemple : private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } Cela évite de rechercher la clé dans le dictionnaire à chaque image, ce qui est nettement plus rapide.",
  "q_faq_extending_1": "Mon analyseur personnalisé sera-t-il appelé automatiquement après chaque Update Keys ? Dois-je l'enregistrer quelque part, ou suffit-il d'avoir une classe qui implémente ITextComponentParser dans le projet ?",
  "a_faq_extending_1": "Avoir la classe suffit. Lorsque TextParser s'exécute, il utilise la réflexion pour trouver toutes les classes du projet qui implémentent l'interface ITextComponentParser et appelle automatiquement leur méthode Parse() pour chaque GameObject. Aucune inscription manuelle n'est requise.",
  "q_faq_extending_2": "Que se passe-t-il si une exception se produit dans mon analyseur personnalisé ? Cela interrompra-t-il l'ensemble du processus d'analyse, ou l'outil continuera-t-il en toute sécurité avec d'autres analyseurs ?",
  "h2_faq_addressables": "Addressables et Migration",
  "q_faq_addressables_1": "J'ai activé le mode Addressables, mais les ressources ne se chargent pas. Que dois-je vérifier ?",
  "a_faq_addressables_1": "Assurez-vous que le package Addressables est installé, que les paramètres sont créés et que vous avez cliqué sur \"Scan Assets & Generate Tables\" pour enregistrer les clés dans les groupes.",
  "q_faq_addressables_2": "Comment ajouter le support pour DeepL/Google ?",
  "a_faq_addressables_2": "Créez un <code>Translation Profile</code> dans le dossier des ressources, sélectionnez le type de service, entrez la clé API et attribuez ce profil dans la fenêtre <code>Settings</code>.",
  "q_faq_addressables_3": "Le migreur affiche des erreurs de compilation après la suppression d'I2/UnityLoc. Comment puis-je résoudre ce problème ?",
  "a_faq_addressables_3": "Dans la fenêtre Migration (Onglet 0), il y a un bouton \"Enable Stubs\" qui active la fonctionnalité Emergency Stubs. Cela crée de fausses classes de placeholder pour I2 Localization ou Unity Localization afin que votre projet puisse compiler immédiatement après la suppression de ces plugins. La fonctionnalité fonctionne en basculant le symbole de définition ANKO_ENABLE_MIGRATION_STUBS. Cela empêche les erreurs \"Le nom de type 'Localize' est introuvable\" et vous donne le temps de refactoriser correctement votre code pour utiliser le nouveau système. Activer les Stubs vous permet de corriger les erreurs de compilation après la suppression de l'ancien plugin de localisation.",
  "a_faq_extending_2": "Une exception dans votre analyseur personnalisé interrompra le processus. La boucle d'analyse principale n'enveloppe pas les appels aux analyseurs personnalisés dans un bloc try-catch. Si votre méthode Parse() lève une exception non gérée,",
  "h2_faq_audio": "Audio IA / Synthèse Vocale (Text-to-Speech)",
  "q_faq_audio_smart_update": "Comment l'outil économise-t-il les crédits API lors de la régénération des fichiers audio ?",
  "a_faq_audio_smart_update": "L'outil utilise le regroupement intelligent avec hachage MD5 pour ne régénérer les fichiers audio que lorsque le texte source a changé. Il calcule un hachage MD5 de votre contenu textuel et le compare aux fichiers audio précédemment générés. Si le texte n'a pas changé, il saute la régénération, économisant ainsi vos crédits API. Cela empêche les appels API inutiles et réduit les coûts lors de la régénération audio. L'outil hache votre texte et ne régénère les fichiers audio que si le texte source a changé, économisant ainsi vos crédits API.",
  "toggle_notes_title": "Basculer les Notes",
  "mindmap_toggle_title": "Afficher la Carte Mentale",
  "on_this_page_title": "Sur Cette Page",
  "my_notes_title": "Mes Notes",
  "no_notes_message_new": "Passez la souris sur le texte pour ajouter une note.",
  "notes_add_title": "Ajouter une note à ce bloc",
  "notes_placeholder": "Votre note...",
  "notes_close_title": "Fermer",
  "notes_goto_title": "Aller au texte",
  "notes_edit_title": "Modifier la note",
  "notes_delete_title": "Supprimer la note",
  "notes_edit_text": "Modifier",
  "copy_code_copy": "Copier",
  "copy_code_copied": "Copié !",
  "copy_code_error": "Erreur",
  "error_loading_title": "Erreur de Chargement",
  "error_loading_message": "Veuillez vérifier votre connexion et actualiser.",
  "lightbox_aria_close": "Fermer la visionneuse d'images",
  "lightbox_image_alt": "Vue agrandie",
  "mindmap_preset_full": "Vue Complète",
  "mindmap_preset_quick_start": "Démarrage Rapide",
  "mindmap_preset_dev": "Flux de Travail du Développeur",
  "mindmap_preset_translator": "Flux de Travail du Traducteur",
  "mindmap_edge_configure": "1. Configurer",
  "mindmap_edge_specify_content": "2. Spécifier le Contenu",
  "mindmap_edge_parse_project": "3. Analyser le Projet",
  "mindmap_edge_creates_components": "Crée des Composants",
  "mindmap_edge_generates": "Génère",
  "mindmap_edge_opens": "Ouvre",
  "mindmap_edge_manages_assets": "Gère les ressources pour",
  "mindmap_edge_defines_rules": "Définit des règles pour",
  "mindmap_edge_reports_on": "Rapports sur",
  "mindmap_edge_enables_reaction": "Active la réaction via",
  "mindmap_edge_processed_by": "Traité par",
  "mindmap_edge_edited_in": "Édité dans",
  "mindmap_edge_extends": "Étend",
  "mindmap_edge_warns_about": "Avertit de",
  "mindmap_edge_relates_to": "Se rapporte à",
  "mindmap_edge_recommends_for": "Recommande pour",
  "mindmap_edge_see_faq": "Voir FAQ"
}