{
  "page_title": "Documentação da Ferramenta de Localização da Unity",
  "toc_title": "Sumário",
  "toc_search_placeholder": "Pesquisar documentação...",
  "nav_introduction": "1. Introdução",
  "nav_quick_start": "2. Início Rápido",
  "nav_components": "3. Componentes Principais",
  "nav_loc_tool_window": "4. Janela \"Localization Tool\"",
  "nav_translation_editor": "5. Editor de Tradução",
  "nav_ai_profiles": "6. Perfis de IA e Tradução (Novo v1.1)",
  "nav_usage_examples": "7. Exemplos de Uso",
  "nav_important_notes": "8. Notas Importantes",
  "nav_extending": "9. Estendendo a Funcionalidade",
  "nav_faq": "10. FAQ e Solução de Problemas",
  "nav_migration_tool": "11. Ferramenta de Migração",
  "nav_font_glyph_manager": "12. Gerenciador de Fontes e Glifos",
  "nav_pseudo_tool": "13. Ferramenta de Pseudo-Localização",
  "nav_ai_audio": "14. Áudio AI / Text-to-Speech",
  "nav_key_features": "Principais Recursos",
  "nav_installation": "2.1. Instalação",
  "nav_initial_setup": "2.2. Configuração Inicial",
  "nav_localizedtext": "3.1. LocalizedText",
  "nav_localizedasset": "3.2. LocalizedAsset",
  "nav_localizedprefab": "3.3. LocalizedPrefab",
  "nav_uitklocalization": "3.4. UITKLocalization",
  "nav_localizeddropdown": "3.5. LocalizedDropdown",
  "nav_localizedbehaviour": "3.6. LocalizedBehaviour",
  "nav_context_menu": "3.7. Menu de Contexto",
  "nav_in_editor_preview": "4.1. Pré-visualização em Editor e Prefab",
  "nav_tab_settings": "4.2. Aba \"Settings\" (Configurações)",
  "nav_tab_content": "4.3. Aba \"Content\" (Conteúdo) (Redesenhada)",
  "nav_tab_actions": "4.4. Aba \"Actions\" (Ações)",
  "nav_tab_assets": "4.5. Aba \"Assets\" (Ativos)",
  "nav_tab_report": "4.6. Aba \"Report\" (Relatório)",
  "nav_ai_profiles_overview": "6.1. Perfis de Tradução",
  "nav_custom_ai": "6.2. IA e Modelos Personalizados",
  "nav_ai_context": "6.3. Contexto e Glossário",
  "nav_ai_assistant": "6.4. Comandos do Assistente de IA",
  "nav_example_components": "7.1. Componentes Prontos",
  "nav_example_attribute": "7.2. Atributo [LocalizableField]",
  "nav_example_function": "7.3. Função _()",
  "nav_example_plurals": "7.4. Plurais e Gênero",
  "nav_custom_parser": "9.1. Criando um Parser (Analisador) Personalizado",
  "nav_faq_installation": "10.1. Instalação e Início Rápido",
  "nav_faq_components": "10.2. Componentes Principais",
  "nav_faq_window": "10.3. Janela \"Localization Tool\"",
  "nav_faq_window_actions": "10.3. Janela \"Localization Tool\" - Aba \"Actions\"",
  "nav_faq_window_assets": "10.3. Janela \"Localization Tool\" - Aba \"Assets\"",
  "nav_faq_window_report": "10.3. Janela \"Localization Tool\" - Aba \"Report\"",
  "nav_faq_editor": "10.4. Editor de Tradução",
  "nav_faq_examples": "10.5. Exemplos de Uso e Código",
  "nav_faq_notes": "10.6. Nuances e Avisos Importantes",
  "nav_faq_extending": "10.7. Estendendo a Funcionalidade",
  "h1_introduction": "Introdução",
  "p_intro_1": "Esta ferramenta é uma solução abrangente para a localização de jogos e aplicações na Unity. Ela automatiza o processo de coleta de texto e ativos, gerencia traduções através de uma interface poderosa, integra-se com serviços de tradução automática (incluindo IA Personalizada) e atualiza dinamicamente o conteúdo localizado no jogo.",
  "h2_key_features": "Principais Recursos",
  "li_feature_1": "<strong>Análise Avançada (Advanced Parsing):</strong> Varredura automática de cenas, prefabs, UI Toolkit (UXML) e scripts C#, incluindo campos marcados com o atributo <code>[LocalizableField]</code>, bem como classes e listas aninhadas.",
  "li_feature_2": "<strong>Localização de Qualquer Ativo:</strong> Gerencie sprites, áudio, prefabs, materiais, etc.",
  "li_feature_3": "<strong>Editor de Tradução Poderoso:</strong> Uma interface centralizada com salvamento automático, suporte completo a Desfazer/Refazer (Undo/Redo), agrupamento inteligente de chaves e <strong>Novo na v1.1:</strong> ações de multi-seleção.",
  "li_feature_4": "<strong>IA e Tradução Automática (v1.1):</strong> Novo sistema de Perfis suportando DeepL, Google, Microsoft e <strong>IA Personalizada (OpenAI, Gemini, Claude, Ollama)</strong> com reconhecimento de contexto.",
  "li_feature_5": "<strong>Importação/Exportação Flexível:</strong> Suporte para CSV, XML, YAML, XLIFF e importação direta do Google Sheets.",
  "li_feature_6": "<strong>Pré-visualização ao Vivo:</strong> Pré-visualize qualquer idioma na Scene View ou no <strong>Prefab Mode</strong> sem rodar o jogo.",
  "li_feature_7": "<strong>Suporte a Plural e Gênero:</strong> Tratamento correto de formas plurais (com regras para idiomas eslavos, árabes e outros) e gênero.",
  "li_feature_8": "<strong>Suporte Completo a RTL:</strong> Exibição correta de idiomas da direita para a esquerda.",
  "li_feature_9": "<strong>Atualizações ao Vivo:</strong> Carregue traduções atualizadas de um servidor remoto no início do jogo.",
  "li_feature_10": "<strong>Gerenciador de Backup:</strong> Uma ferramenta embutida para criar e restaurar backups.",
  "li_feature_11": "<strong>Alimentado por IA:</strong> Suporte para OpenAI, Anthropic (Claude), Google Gemini e LLMs locais (Ollama) através de perfis personalizáveis.",
  "li_feature_12": "<strong>Text-to-Speech (TTS):</strong> Geração de arquivos de áudio para strings localizadas usando IA (OpenAI, ElevenLabs).",
  "li_feature_13": "<strong>Ferramentas de Migração:</strong> Ferramentas para transição automática dos plugins I2 Localization e Unity Localization.",
  "li_feature_14": "<strong>Gerenciador de Fontes e Glifos:</strong> Ferramenta para analisar caracteres utilizados e encontrar glifos ausentes em fontes.",
  "li_feature_15": "<strong>Depuração Visual:</strong> Ícones na hierarquia e rótulos na Scene View para depuração rápida.",
  "h1_quick_start": "Início Rápido e Configuração",
  "h2_installation": "2.1. Instalação",
  "li_install_1": "Copie o ativo (asset) para a pasta do seu projeto Unity.",
  "li_install_2": "A ferramenta verificará automaticamente as dependências necessárias. Confirme a instalação na caixa de diálogo que aparecer.",
  "li_install_3": "As dependências necessárias (<code>Newtonsoft Json</code>, <code>Editor Coroutines</code>) são essenciais para a funcionalidade básica.",
  "li_install_4": "As dependências opcionais (<code>Arabic Support</code>, <code>CsvHelper</code>, <code>YamlDotNet</code>) ativam recursos adicionais.",
  "li_install_5": "Clique em <strong>Install Selected</strong> para instalar os pacotes recomendados.",
  "li_install_6": "Após a instalação, abra a janela principal da ferramenta através do menu <strong>Tools -> Localization Tool</strong>.",
  "li_install_7": "Se você planeja usar o carregamento assíncrono de ativos, instale o pacote <strong>Addressables</strong> via Package Manager.",
  "h2_initial_setup": "2.2. Configuração Inicial",
  "li_setup_1": "<strong>Criar Configurações:</strong> Na primeira abertura, a ferramenta criará um arquivo <code>LocalizationSettings.asset</code> na pasta <code>Assets/Resources</code>.",
  "li_setup_2": "<strong>Configurar Idiomas:</strong> Na aba <strong>Settings</strong> em <strong>Language Management</strong>, certifique-se de que seu idioma principal (por exemplo, <code>en</code> para Inglês) esteja selecionado como <strong>Source Language</strong> (Idioma Fonte). Habilite todos os idiomas que você planeja suportar.",
  "li_setup_3": "<strong>Especificar Conteúdo para Análise (Parsing):</strong> Na aba <strong>Content</strong>, adicione todas as cenas para análise à lista <strong>Scenes to Parse</strong>. Se você usa prefabs com texto, certifique-se de que suas pastas estejam adicionadas em <strong>Prefab Folders</strong>.",
  "li_setup_4": "<strong>Primeira Execução do Parser:</strong> Vá para a aba <strong>Actions</strong> e clique no botão <code>Update Keys</code>. A ferramenta fará a varredura do seu projeto, criará arquivos de tradução e adicionará automaticamente os componentes necessários (<code>LocalizedText</code>, <code>LocalizedAsset</code>, etc.) aos objetos de jogo.",
  "li_setup_5": "<strong>Configurações e Builds (CRÍTICO):</strong> A ferramenta adiciona automaticamente <code>LocalizationSettings.asset</code> a <code>Project Settings -> Player -> Preloaded Assets</code>. <br>⚠️ <strong>Verificação de Segurança:</strong> Se as configurações estiverem ausentes dos Preloaded Assets e não estiverem em uma pasta Resources, a ferramenta <strong>bloqueará a build</strong> com uma <code>BuildFailedException</code> para evitar que o jogo trave na inicialização.",
  "h1_components": "Componentes Principais (atribuídos automaticamente)",
  "warning_box_components": "<strong>Nota Importante:</strong> Todos os componentes descritos abaixo são adicionados aos objetos de jogo automaticamente durante a análise (quando você clica no botão <code>Update Keys</code>). Você não precisa adicioná-los manualmente.",
  "p_components_intro": "Estes componentes são a \"ponte\" entre seus objetos na cena e o banco de dados de tradução. Eles \"ouvem\" as mudanças de idioma e substituem automaticamente o texto ou ativo correto.",
  "h2_localizedtext": "3.1. LocalizedText",
  "p_localizedtext_1": "O componente principal para exibir texto traduzido. É colocado em objetos com <code>Text</code>, <code>TMP_Text</code> e <code>TextMesh</code>.",
  "li_localizedtext_1": "<code>localizationKey</code>: A chave usada para encontrar a tradução. Gerada automaticamente.",
  "li_localizedtext_2": "<code>isStyleOnly</code>: Se <code>true</code>, o componente aplicará apenas estilos (fonte, RTL), mas não mudará o próprio texto. Útil para elementos cujo texto é gerenciado por outro script (por exemplo, <code>LanguageSelector</code>).",
  "li_localizedtext_3": "<code>originalSourceText</code>: O texto original no idioma base. Usado como fallback.",
  "h2_localizedasset": "3.2. LocalizedAsset",
  "p_localizedasset_1": "Usado para trocar ativos com base no idioma. Detecta automaticamente o tipo de componente. Suporta: <ul><li><strong>2D:</strong> Sprites (<code>Image</code>, <code>SpriteRenderer</code>), Texturas (<code>RawImage</code>).</li><li><strong>Áudio/Vídeo:</strong> <code>AudioSource</code>, <code>VideoPlayer</code>.</li><li><strong>3D/Animação:</strong> <code>MeshFilter</code> (Meshes), <code>Renderer</code> (Materials), <code>Animator</code> (Controller), <code>PlayableDirector</code> (Timeline).</li></ul>",
  "p_localizedasset_2": "Para componentes com a opção <strong>Play on Awake</strong> (como <code>AudioSource</code>, <code>VideoPlayer</code>), <code>LocalizedAsset</code> intercepta corretamente a reprodução automática, troca o ativo e, em seguida, inicia a reprodução para evitar a execução de conteúdo não localizado.",
  "h2_localizedprefab": "3.3. LocalizedPrefab",
  "p_localizedprefab_1": "Um componente para localizar prefabs inteiros. Funciona de forma não destrutiva: não modifica o prefab original, mas cria uma instância da versão localizada como um objeto filho, desabilitando todos os scripts (<code>MonoBehaviour</code>), renderizadores (<code>Renderer</code>) e colliders (<code>Collider</code>) no objeto original. Isso evita a execução de lógica dupla e artefatos visuais. Para o correto funcionamento em tempo de execução, sua ordem de execução é definida como -100 (<code>[DefaultExecutionOrder(-100)]</code>) para garantir que ele seja executado antes de outros scripts.",
  "h2_uitklocalization": "3.4. UITKLocalization",
  "p_uitklocalization_1": "Adicionado a objetos com um <code>UIDocument</code>. Suporta localização de Labels, Buttons, <strong>TextField Placeholders, DropdownField choices, RadioButtonGroup e ToggleButtonGroup options</strong>. Os identificadores são estáveis em caso de renomeações se os IDs forem definidos no UI Builder.",
  "h2_localizeddropdown": "3.5. LocalizedDropdown",
  "p_localizeddropdown_1": "Adicionado a <code>Dropdown</code> e <code>TMP_Dropdown</code> para traduzir suas opções.",
  "h2_localizedbehaviour": "3.6. LocalizedBehaviour",
  "p_localizedbehaviour_1": "Um componente utilitário que permite que seus scripts reajam a mudanças de idioma. Ele encontra e chama automaticamente métodos marcados com o atributo <code>[OnLanguageChange]</code>.",
  "h2_context_menu": "3.7. Menu de Contexto \"Analyze for Localization\"",
  "p_context_menu_1": "Para adicionar rapidamente um <code>LocalizedAsset</code> a um objeto, você pode clicar com o botão direito no componente desejado (por exemplo, <code>Image</code>, <code>AudioSource</code>) no inspector e selecionar <strong>Analyze for Localization</strong>. A ferramenta adicionará e configurará o componente por si mesma. (Isso é opcional, mas pode ser usado para adição manual).",
  "h1_loc_tool_window": "Janela \"Localization Tool\"",
  "h2_in_editor_preview": "4.1. Pré-visualização em Editor e Prefab",
  "p_preview_1": "Diretamente abaixo do cabeçalho está a lista suspensa <strong>Preview Language</strong>. Este recurso poderoso permite que você veja como a localização ficará em qualquer idioma diretamente na janela <strong>Scene</strong> ou no <strong>Prefab Mode</strong>, sem rodar o jogo.",
  "li_preview_1": "<strong>Como funciona:</strong> Selecione um idioma na lista, e a ferramenta aplicará instantaneamente as traduções, fontes, configurações RTL e ativos correspondentes a todos os objetos localizáveis na cena ativa ou prefab aberto.",
  "li_preview_2": "<strong>Placeholders:</strong> Se um estilo de placeholder (por exemplo, <strong>Accents</strong> ou <strong>Brackets</strong>) for selecionado na aba <strong>Settings</strong>, esses placeholders serão exibidos no modo de pré-visualização em vez das traduções reais. Isso é ideal para testar o layout e encontrar elementos não localizados.",
  "li_preview_3": "<strong>Segurança:</strong> Todas as alterações feitas no modo de pré-visualização são temporárias. A ferramenta reverterá automaticamente tudo para o estado original quando você selecionar \"<strong>Revert to Original</strong>\", fechar a janela, mudar de cena ou antes de salvar uma cena/prefab (graças ao componente <code>LocalizationPreviewProtector</code>).",
  "li_preview_4": "<strong>Proteção contra Crash:</strong> O sistema faz backup automático do estado da cena na pasta <code>Library</code> antes da pré-visualização. Se o Unity travar ou você forçar o fechamento durante a pré-visualização, a ferramenta detecta o arquivo de recuperação na próxima inicialização e oferece a restauração do estado original da cena.",
  "h2_tab_settings": "4.2. Aba \"Settings\" (Configurações)",
  "p_settings_1": "Seu centro de controle. Aqui você define regras globais para todo o processo de localização.",
  "li_settings_1": "<strong>Modo de Geração de Chave:</strong> Escolha como as chaves serão criadas.<ul><li><code>UseTextAsKey</code>: O próprio texto se torna a chave. Ideal para protótipos.</li><li><code>AutoGenerateKeysOnly</code>: A chave é gerada com base na hierarquia e nome do objeto. Confiável para produção.</li><li><code>Manual</code>: O parser NÃO gerará chaves automaticamente. Ele apenas atualizará objetos que já possuem uma chave atribuída.</li><li><code>UseTextAsKeyWithCustomPriority</code> / <code>AutoGenerateWithCustomKeys</code>: Modos híbridos que permitem chaves personalizadas via atributos de código.</li><li><strong>Migração Segura:</strong> Você pode mudar o modo a qualquer momento; a ferramenta tenta migrar as traduções existentes.</li></ul>",
  "li_settings_2": "<strong>Gerenciamento de Idiomas:</strong><ul><li><strong>Source Language:</strong> O idioma usado em suas cenas/prefabs do Unity (idioma de desenvolvimento).</li><li><strong>Default Language:</strong> O idioma selecionado no primeiro lançamento do jogo se o idioma do sistema do usuário não for suportado.</li><li><strong>Lista:</strong> Gerencie os idiomas suportados, atribua <strong>Font Assets</strong> específicos e habilite o suporte a <strong>RTL</strong>.</li></ul>",
  "li_settings_3": "<strong>Configurações Gerais:</strong><ul><li><code>Parse Prefabs</code>: Habilita a análise de prefabs.</li><li><code>Split files by language</code>: Determina como armazenar as traduções (um arquivo grande ou um arquivo por idioma).</li><li><code>Translations Path</code>: O caminho para armazenar os arquivos de tradução <code>.json</code>. Importante: a pasta deve estar dentro de <code>Assets/StreamingAssets/</code>.</li></ul>",
  "li_settings_4": "<strong>Depuração e Testes:</strong><ul><li><code>Placeholder Style</code>: Escolha o estilo para exibir placeholders no modo de pré-visualização.</li></ul>",
  "li_settings_5": "<strong>Atualizações ao Vivo:</strong> Configurações para carregar traduções de um servidor remoto.",
  "li_settings_6": "<strong>Runtime API Key:</strong> Armazena com segurança sua chave de API para tradução automática no jogo. A chave é <strong>ofuscada</strong> (criptografada) na build para evitar fácil extração via pesquisa de strings, mas lembre-se: nenhum segredo do lado do cliente é 100% seguro.",
  "li_settings_7": "<strong>Estratégia de Carregamento de Ativos:</strong> Escolha entre <code>Resources (Legacy)</code> (carregamento síncrono, método antigo) e <code>Addressables (Async)</code> (carregamento assíncrono, recomendado para projetos grandes).",
  "li_settings_8": "<strong>Tradução Automática:</strong> Agora usa o sistema <strong>Translation Profiles</strong>. Você deve criar um ativo de perfil (Botão direito -> Create -> Localization -> Translation Profile) ou selecionar um preset na pasta <code>Localization/Presets</code>. Os perfis suportam: Google Translate, DeepL, Microsoft, OpenAI, Claude, Gemini, Ollama. Nas configurações, selecione <strong>Active Text Profile</strong> (para texto) e <strong>Active Audio Profile</strong> (para TTS).",
  "li_settings_9": "<strong>Melhorias de Depuração:</strong><ul><li><code>Show Hierarchy Icons</code>: Exibe ícones de status (Tique Verde / Aviso Amarelo) na hierarquia. <strong>Desempenho Otimizado:</strong> Usa cache para garantir latência zero mesmo em cenas grandes.</li><li><code>Show Scene View Labels</code>: Depuração visual diretamente na Scene View. Os rótulos são interativos: Clique com o botão direito em qualquer rótulo de cena para copiar instantaneamente a chave de localização para a área de transferência.</li><li><code>Pseudo-Localization</code>: Teste a expansão do layout da UI sem traduções.</li></ul>",
  "li_settings_10": "<strong>Ferramentas de Desenvolvedor:</strong> Na parte inferior da aba Configurações, você pode encontrar botões utilitários como <strong>Clear Saved Language Pref</strong> (reinicia o idioma salvo no PlayerPrefs para que o jogo inicie novamente com o idioma Padrão).",
  "li_settings_11": "<strong>Opções Dropdown Técnicas:</strong> Uma lista de valores de string (padrões: 'Option A', 'Option B', 'Option C') que o parser <strong>ignorará</strong> ao varrer Dropdowns. Isso mantém sua tabela de tradução limpa do texto placeholder padrão da UI do Unity.",
  "li_assistant_3": "<strong>Comandos Personalizados:</strong> Você não está limitado a presets! Abra o inspetor do seu ativo <strong>Translation Profile</strong> para adicionar seus próprios prompts (por exemplo, 'Reescrever em estilo pirata', 'Verificar ortografia'). Eles aparecerão automaticamente no menu de contexto do editor.",
  "li_font_glyph_workflow": "<strong>Fluxo de Trabalho para TMP:</strong> 1. Execute a Varredura (Scan). 2. Selecione um idioma com glifos ausentes. 3. Clique em <strong>'Copy Character Set'</strong>. 4. Abra Window -> TextMeshPro -> Font Asset Creator. 5. Cole o conteúdo da área de transferência no campo 'Character Sequence (Custom Range)' para gerar um atlas contendo exatamente os caracteres que seu jogo precisa.",
  "li_assets_addressables_naming": "<strong>Convenção de Nomenclatura:</strong> Ao varrer, a ferramenta define automaticamente os Endereços Addressable para o formato <code>{Category}/{Language}/{Key}</code>. <strong>Não renomeie</strong> esses endereços manualmente, pois o LocalizationManager depende deste formato específico para carregar ativos em tempo de execução.",
  "p_ai_audio_economy": "<strong>Economia de Custo:</strong> A ferramenta calcula um hash MD5 do seu texto e só regenera arquivos de áudio se o texto fonte tiver mudado, economizando seus créditos de API. Se você mudar uma tradução, o sistema sinaliza apenas aquele arquivo de áudio específico como 'Outdated' (Desatualizado). Use 'Generate Missing/Outdated' para regenerar apenas o que mudou, economizando créditos de API. A ferramenta faz o hash do seu texto e só regenera arquivos de áudio se o texto fonte tiver mudado, economizando seus créditos de API através de agrupamento inteligente (smart batching).",
  "li_content_regex_example": "<strong>Exemplo de Wrapper Personalizado:</strong> Se você usa uma função personalizada como <code>MyGame.Loc(\"KEY\")</code>, adicione uma Regra de Análise de Script com o regex: <code>\\bMyGame\\.Loc\\s*\\(\\s*\"([^\"]*)\"</code>. O parser agora capturará chaves do seu código personalizado.",
  "li_settings_icons_legend": "<strong>Legenda dos Ícones da Hierarquia:</strong><br>🟢 (Tique Verde): Localizado e Chave definida.<br>🔴 (Erro Vermelho): Componente localizado presente, mas <strong>Chave ausente</strong>.<br>🟡 (Aviso Amarelo): Componente Text/Image encontrado, mas <strong>nenhum componente de Localização</strong> anexado.<br>🐛 (Bug): Objeto é <strong>Ignorado</strong> pelas configurações.",
  "h2_tab_content": "4.3. Aba \"Content\" (Conteúdo) (Redesenhada na v1.1)",
  "p_content_1": "Aqui você informa à ferramenta onde exatamente procurar por texto. A interface foi completamente redesenhada para melhor usabilidade.",
  "li_content_1": "<strong>Scenes to Parse:</strong> Arraste e solte todas as cenas para análise aqui.",
  "li_content_2": "<strong>Prefab Folders:</strong> Especifique pastas com prefabs. Agora suporta paginação e pesquisa para projetos grandes.",
  "li_content_3": "<strong>Dynamic Texts:</strong> Insira strings que são criadas exclusivamente em código aqui (por exemplo, \"Game Over\").",
  "li_content_4": "<strong>Configuração de Análise (Parsing):</strong> Especifique scripts/objetos a serem ignorados. Em <strong>Attributes to Scan</strong>, você pode adicionar nomes de atributos personalizados (por exemplo, <code>[Header]</code>, <code>[TermsPopup]</code>) para que o parser trate esses campos como texto localizável.",
  "li_content_5": "<strong>Pin:</strong> Este recurso permite que você \"fixe\" um objeto da cena na lista de ignorados. Em vez de uma referência temporária ao objeto, a ferramenta salvará seu caminho completo na hierarquia, tornando a regra de ignorar persistente entre as sessões.",
  "li_content_6": "<strong>Script Parsing Rules:</strong> Defina regras de Regex personalizadas para encontrar chaves em seu código. <br>🔥 <strong>Novo:</strong> Use o botão <strong>'Add Preset'</strong> para adicionar instantaneamente regras para ativos de terceiros (I2 Localization, Unity Localization) ou wrappers padrão.",
  "li_content_7": "<strong>Dynamic Key Prefixes:</strong> Lista de prefixos para chaves (por exemplo, <code>Item_</code>) que não serão excluídas durante a limpeza (Remove Missing Keys), mesmo que o parser não as tenha encontrado na cena.",
  "h2_tab_actions": "4.4. Aba \"Actions\" (Ações)",
  "p_actions_1": "A principal aba de trabalho.",
  "li_actions_1": "<strong>Análise (Parsing):</strong><ul><li><strong>Update Keys:</strong> Varredura completa do projeto definida pelas configurações da aba 'Content'.</li><li><strong>Scan Selected Assets:</strong> Varre APENAS os arquivos/pastas atualmente selecionados na Project View. Mais seguro para atualizações parciais, pois desabilita automaticamente 'Remove Missing Keys'.</li></ul>",
  "li_actions_2": "<strong>Open Translation Editor:</strong> Abre uma janela separada e mais conveniente para editar todas as traduções.",
  "li_actions_3": "<strong>Gerenciamento de Dados:</strong> Use para troca de dados com tradutores (Exportar/Importar para CSV/XML/YAML/XLIFF, importar do Google Sheets).",
  "li_actions_4": "<strong>Tradução Automática:</strong> Preenche automaticamente todas as strings de tradução vazias usando o <strong>Translation Profile</strong> ativo.",
  "li_actions_5": "<strong>Zona de Perigo:</strong> Contém botões para remover completamente todos os componentes de localização do projeto. Use com cautela!",
  "h2_tab_assets": "4.5. Aba \"Assets\" (Ativos)",
  "p_assets_1": "Esta aba é inteiramente dedicada à localização de recursos não textuais.",
  "li_assets_1": "<strong>Crie uma estrutura de pastas (opcional):</strong> Na seção <strong>2. Asset Folder Generation</strong>, clique em <strong>Create Asset Folders Now</strong>.",
  "li_assets_2": "<strong>Configure categorias e regras de nomenclatura:</strong> Na seção <strong>3. Asset Categories & Scanning</strong>, certifique-se de que a <strong>Naming Rule</strong> (<code>{key}_{lang}</code>) corresponda aos seus arquivos (por exemplo, <code>button_ok_en.png</code>).",
  "li_assets_3": "<strong>Coloque seus ativos:</strong> Coloque os ativos localizados nas pastas.",
  "li_assets_4": "<strong>Varredura de ativos:</strong> Na seção <strong>4. Automation</strong>, clique em <strong>Scan Assets & Update Tables</strong>. O processo de limpeza se tornou mais seguro: agora apenas arquivos de tabela antigos (<code>.asset</code>) são excluídos, não a pasta inteira.",
  "li_assets_5": "<strong>Vincular ativos a objetos:</strong> Clique em <strong>Analyze Project & Attach Components</strong>.",
  "li_assets_6": "<strong>Integração Addressables:</strong> Se o modo <strong>Addressables</strong> estiver habilitado, os ativos serão registrados automaticamente em grupos Addressables com endereços no formato <code>{Category}/{Language}/{Key}</code> durante a varredura.",
  "h2_tab_report": "4.6. Aba \"Report\" (Relatório)",
  "p_report_1": "Após cada análise, este relatório mostra o panorama completo do seu status de localização.",
  "li_report_1": "<strong>Categorias:</strong> All Keys (Todas as Chaves), Added (Adicionadas), Updated (Atualizadas - texto alterado), Removed (Removidas), Duplicates (Duplicatas), Migrated (Migradas), Skipped (Ignoradas - inalteradas).",
  "li_report_2": "<strong>Busca Avançada (Advanced Find):</strong> Clique no botão <strong>Find</strong> ao lado de qualquer entrada para encontrar instantaneamente o objeto correspondente no projeto. A busca funciona de forma assíncrona, não bloqueando o editor, e pesquisa em todas as cenas e prefabs.",
  "h1_translation_editor": "Editor da Tabela de Tradução",
  "p_editor_1": "Abre via <strong>Tools -> Localization -> Translation Table Editor</strong>. Esta é a principal ferramenta para edição manual de traduções.",
  "li_editor_1": "<strong>Agrupamento Inteligente:</strong> Chaves para plurais e gênero (por exemplo, <code>apple_count_one</code>, <code>apple_count_few</code>) são automaticamente combinadas em grupos recolhíveis.",
  "li_editor_2": "<strong>Edição Avançada:</strong> Clique em uma célula para abrir o popup <strong>MultiLineEditWindow</strong>. Ele mostra o texto fonte para comparação e valida placeholders.",
  "li_editor_3": "<strong>Seleção Avançada (Novo):</strong> Suporta seleção de células individuais, linhas ou colunas inteiras (idiomas).",
  "li_editor_4": "<strong>Ações em Massa (Novo):</strong> Clique com o botão direito em uma seleção para realizar operações em massa: Auto-Traduzir células selecionadas, Limpar conteúdo ou Excluir chaves.",
  "li_editor_5": "<strong>Navegação Inteligente (Novo):</strong> Navegue na tabela usando as setas do teclado e atalhos (Ctrl+S para salvar, Ctrl+Z/Y para Desfazer/Refazer).",
  "li_editor_6": "<strong>Filtros de Validação:</strong> Use filtros avançados para auditar seu projeto: <ul><li><strong>Has Length Issues:</strong> Aviso se a tradução for significativamente mais longa que a fonte (+X%).</li><li><strong>Outdated Audio:</strong> Mostra chaves onde o texto mudou, mas o áudio não foi regenerado.</li><li><strong>Missing Placeholders:</strong> Detecta se {0} está presente na fonte, mas ausente na tradução.</li></ul>",
  "li_editor_7": "<strong>Status do Áudio:</strong> A tabela agora exibe o status dos arquivos de áudio. Se o texto mudou, mas o arquivo de áudio permanece antigo (hash incompatível), um aviso (ícone amarelo) aparecerá.",
  "li_editor_8": "<strong>Menu de Contexto Aprimorado:</strong> Comandos adicionados: <strong>Generate Audio</strong> (criar narração para células selecionadas) e <strong>AI Assistant</strong> (executar comandos como \"Fix Grammar\" ou \"Shorten\" usando o perfil de IA selecionado).",
  "h1_ai_profiles": "Perfis de IA e Tradução (Novo v1.1)",
  "h2_ai_profiles_overview": "6.1. Perfis de Tradução",
  "p_ai_intro": "A Versão 1.1 introduz um novo sistema de <strong>Translation Profile</strong> (ScriptableObject). Isso move as configurações do serviço de tradução das configurações globais para ativos de perfil individuais, permitindo que você alterne as configurações facilmente.",
  "li_ai_1": "<strong>Criar Perfil:</strong> Clique com o botão direito na Project view -> Create -> Localization -> Translation Profile.",
  "li_ai_2": "<strong>Serviços:</strong> Suporta DeepL, Google Translate, Microsoft Azure e <strong>Custom AI</strong>.",
  "li_ai_3": "<strong>Configurações:</strong> Cada perfil armazena sua própria Chave de API, limites (tamanho do lote, máx. de caracteres) e configurações de modelo.",
  "li_ai_4": "<strong>AIPresetsGenerator:</strong> Use o gerador embutido para criar rapidamente perfis para serviços populares (OpenAI, Gemini, Claude, Ollama).",
  "h2_custom_ai": "6.2. IA e Modelos Personalizados",
  "p_custom_ai": "O tipo de serviço <strong>Custom AI</strong> permite que você conecte qualquer LLM via API REST.",
  "li_custom_ai_1": "<strong>GenericAIService:</strong> Uma implementação flexível que pode se comunicar com APIs compatíveis com OpenAI (incluindo LLMs locais via Ollama).",
  "li_custom_ai_2": "<strong>Templates:</strong> Personalize o template JSON do corpo da requisição para corresponder aos requisitos da sua API.",
  "li_custom_ai_3": "<strong>Recursos de Segurança Integrados:</strong> Repara automaticamente tags de formatação quebradas (como <ph0>) frequentemente retornadas por modelos de IA, garantindo traduções confiáveis e consistentes.",
  "h2_ai_context": "6.3. Contexto e Glossário",
  "p_ai_context": "Para melhorar a qualidade da tradução, a IA agora recebe contexto adicional:",
  "li_context_1": "<strong>Notas do Desenvolvedor:</strong> Comentários da tabela de tradução são passados para a IA como contexto.",
  "li_context_2": "<strong>Caminho do Objeto:</strong> Se não houver comentário, o caminho da hierarquia do objeto (por exemplo, <code>MainMenu/Canvas/StartButton</code>) é usado como contexto de fallback.",
  "li_context_3": "<strong>Glossário:</strong> Você pode carregar um glossário CSV no perfil para forçar traduções específicas para termos e nomes.",
  "h2_ai_assistant": "6.4. Comandos do Assistente de IA",
  "p_ai_assistant": "No Editor da Tabela de Tradução, você pode agora executar comandos de IA personalizados em células selecionadas através do menu de contexto (Botão Direito -> AI: ...).",
  "li_assistant_1": "<strong>Configurável:</strong> Defina comandos no seu Translation Profile (por exemplo, \"Fix Grammar\", \"Make Formal\", \"Shorten for UI\").",
  "li_assistant_2": "<strong>Processamento em Lote:</strong> Selecione várias células para aplicar o comando a todas elas de uma vez.",
  "h1_usage_examples": "Exemplos de Uso",
  "h2_example_components": "7.1. Componentes e Exemplos Prontos",
  "p_example_components_1": "O projeto inclui scripts prontos para uso que servem como excelentes exemplos.",
  "li_example_components_1": "<strong><code>LanguageSelector.cs</code>:</strong> Um componente pronto para criar uma lista suspensa de UI para troca de idioma. Ele encontra automaticamente todos os idiomas disponíveis e gerencia sua troca.<br><strong>Como usar:</strong> Basta adicionar o componente <code>LanguageSelector</code> à sua cena (por exemplo, em um GameObject vazio) e especificar seu <code>TMP_Dropdown</code> no inspector.",
  "li_example_components_2": "<strong>Exemplos de Código:</strong> Para aprender técnicas avançadas, como trabalhar com <code>[LocalizableField]</code>, a função <code>_()</code>, plurais e gênero, estude os arquivos <code>StatPurchaseTest.cs</code> e <code>TestLocalization.cs</code>. Eles demonstram claramente a implementação de todos os principais recursos da ferramenta em código.",
  "h2_example_attribute": "7.2. Atributo [LocalizableField]",
  "p_example_attribute_1": "The most powerful way to localize script variables. It works with <strong>private, protected, and public</strong> fields. The parser recursively handles <strong>Arrays, Lists</strong>, and <strong>Nested Serializable Classes</strong>. It can even generate keys for other attributes (like <code>[Header]</code> or <code>[Tooltip]</code>) if configured in Settings.",
  "code_example_attribute": "using Ankonoanko.Localization;\nusing UnityEngine;\nusing System.Collections.Generic;\n\npublic class HeroDialog : MonoBehaviour\n{\n    // 1. Private fields work perfectly\n    [LocalizableField]\n    private string secretWhisper = \"It's a secret to everybody.\";\n\n    // 2. Custom Key Override\n    [LocalizableField(\"hero_greeting_main\")]\n    public string greeting = \"Welcome, traveler!\";\n\n    // 3. Lists and Arrays (Keys become: inventory_header_0, inventory_header_1...)\n    [LocalizableField]\n    public string[] inventoryHeaders = new string[] { \"Weapons\", \"Potions\", \"Armor\" };\n\n    // 4. Nested Serializable Classes (Recursion supported)\n    [System.Serializable]\n    public class BossInfo\n    {\n        [LocalizableField] public string name;\n        [LocalizableField] public string title;\n    }\n    public BossInfo currentBoss; // Parser drills down into this\n\n    // 5. List of Nested Objects\n    [LocalizableField]\n    public List<BossInfo> bossList = new List<BossInfo>();\n\n    // 6. Custom Key on List (Keys: dungeon_hints_list_0, dungeon_hints_list_1...)\n    [LocalizableField(\"dungeon_hints_list\")]\n    public List<string> dungeonHints = new List<string>\n    {\n        \"Beware of traps.\",\n        \"Use fire against trolls.\"\n    };\n\n    // 7. Interpolated Strings (Parser reads the raw format string)\n    [LocalizableField(\"fire_sword_name\")]\n    public string ItemName1 = $\"Fire Sword {0}\";\n}",
  "h2_example_function": "7.3. Função _() e Atributo [OnLanguageChange]",
  "p_example_function_1": "Use a função <code>_()</code> para texto dinâmico que muda durante o jogo. O método que atualiza a UI deve ser marcado com o atributo <code>[OnLanguageChange]</code> para que seja chamado automaticamente quando o idioma for alterado. Um componente <code>LocalizedBehaviour</code> será adicionado automaticamente ao objeto para essa finalidade.",
  "code_example_function": "// Para usar a chamada abreviada _(), adicione estas linhas\nusing static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization; // Necessário para [OnLanguageChange]\nusing UnityEngine;\nusing TMPro;\nusing System.Collections.Generic;\npublic class PlayerHUD : MonoBehaviour\n{\n    [SerializeField] private TMP_Text scoreText;\n    private int score = 100;\n    private string playerName = \"Alex\";\n    \n    void Start()\n    {\n        UpdateUI(); // Atualização inicial\n    }\n    \n    // Este método será chamado automaticamente quando o idioma mudar\n    [OnLanguageChange]\n    void UpdateUI()\n    {\n        // 1. Placeholders indexados (como em string.Format)\n        // Chave: \"score_label\", Texto no arquivo: \"Score: {0}\"\n        scoreText.text = _(\"score_label\", score); // Resultado: \"Score: 100\"\n        \n        // 2. Placeholders nomeados (recomendado para legibilidade)\n        // Chave: \"welcome_message\", Texto: \"Welcome, {username}!\"\n        string welcomeText = _(\"welcome_message\", new { username = playerName });\n        \n        // Para casos complexos ou alto desempenho\n        var args = new Dictionary<string, object> { { \"username\", playerName } };\n        string welcomeText2 = _(\"welcome_message\", args);\n    }\n}",
  "h2_example_plurals": "7.4. Plurais e Gênero",
  "p_example_plurals_1": "A ferramenta agora usa regras mais precisas para diferentes grupos de idiomas.",
  "code_example_plurals": "using static Ankonoanko.Localization.LocalizationManager;\nusing Ankonoanko.Localization;\nusing UnityEngine;\npublic class ItemCounter : MonoBehaviour\n{\n    void DisplayItemCount(int count)\n    {\n        // Chaves: \"apple_count_one\", \"apple_count_few\", \"apple_count_many\"\n        // Textos: \"{0} apple\", \"{0} apples\", \"{0} apples\"\n        string appleText = _(\"apple_count\", count); \n        Debug.Log(appleText); // Seleciona automaticamente a forma correta\n    }\n    \n    void GreetUser(Gender userGender)\n    {\n        // Chaves: \"user_greeted_male\", \"user_greeted_female\"\n        // Textos: \"He has arrived.\", \"She has arrived.\"\n        string greeting = _(\"user_greeted\", userGender);\n        Debug.Log(greeting);\n    }\n}",
  "h1_important_notes": "Notas e Avisos Importantes",
  "li_notes_1": "<strong>Backups:</strong> Sempre crie um backup através de <strong>Translation Table Editor -> Manage Backups</strong> antes de grandes alterações. Os backups são armazenados na pasta <code>LocalizationBackups</code> <strong>na raiz do projeto (fora da pasta Assets)</strong> para manter seu projeto Unity limpo e reduzir os tempos de importação.",
  "li_notes_2": "<strong>Segurança da Chave de API:</strong> A chave para trabalhar no editor é armazenada localmente em sua máquina (em <code>EditorPrefs</code>) e não entra no repositório. Para chaves necessárias na build do jogo, use a seção <strong>Runtime API Key</strong>.",
  "li_notes_3": "<strong>Pasta <code>StreamingAssets</code>:</strong> Os arquivos de tradução devem estar em uma subpasta de <code>Assets/StreamingAssets/</code> para serem incluídos na build do jogo.",
  "li_notes_4": "<strong>\"À Prova de Falhas\":</strong> A ferramenta o protege automaticamente de salvar acidentalmente dados temporários do modo de pré-visualização em uma cena ou prefab.",
  "li_notes_5": "<strong>Desempenho:</strong> A chamada <code>_()</code> é rápida, mas em loops que rodam a cada frame (por exemplo, em <code>Update</code>), tente armazenar o resultado em cache em uma variável.",
  "li_notes_6": "<strong>Excluindo <code>LanguageSelector</code> da análise:</strong> O objeto com o componente <code>LanguageSelector</code> e seu <code>TMP_Dropdown</code> devem ser adicionados à lista <strong>Ignore Specific Objects</strong> na aba <strong>Content</strong>. Isso é necessário para evitar que o parser crie chaves extras para as opções do dropdown, pois o script <code>LanguageSelector</code> as preenche dinamicamente em tempo de execução. Ignorar evita conflitos e mantém os arquivos de tradução limpos.",
  "li_notes_7": "<strong>Fontes para <code>LanguageSelector</code>:</strong> Para que o idioma selecionado no <code>TMP_Dropdown</code> atualize corretamente sua fonte, adicione manualmente um componente <code>LocalizedText</code> vazio ao objeto <strong>Label</strong> filho do Dropdown e marque a caixa <code>isStyleOnly</code>.",
  "li_notes_addressables_code": "<strong>Código e Addressables:</strong> Se você mudar para o modo <strong>Addressables (Async)</strong>, você DEVE usar <code>GetLocalizedAssetAsync<T>()</code> em seus scripts. Chamar o síncrono <code>GetLocalizedAsset<T>()</code> retornará nulo e registrará um aviso para evitar travamentos do thread principal.",
  "li_content_regex_presets": "<strong>Padrões Regex Ignorados:</strong> Clique em <strong>'Add Common Pattern'</strong> para excluir rapidamente conteúdo dinâmico como *URLs, Emails, Datas, Preços e UUIDs* da tradução sem escrever Regex manualmente.",
  "li_notes_addressables_sync_warning": "<strong>Síncrono vs Assíncrono:</strong> Se você mudar para o modo <strong>Addressables (Async)</strong>, você DEVE atualizar seu código para usar <code>GetLocalizedAssetAsync<T>()</code>. Chamar o método síncrono retornará nulo e registrará um aviso para evitar o congelamento do thread principal.",
  "q_faq_custom_keys_attribute": "Posso usar meu próprio atributo para chaves em vez de [LocalizableField]?",
  "a_faq_custom_keys_attribute": "Sim. Na <strong>Content Tab</strong> em 'Attributes to Scan', você pode adicionar qualquer nome de atributo (por exemplo, <code>[Header]</code>, <code>[TermsPopup]</code>). O parser tratará qualquer campo de string com esse atributo como localizável.",
  "q_faq_tts_voices": "Como atribuo vozes específicas a personagens?",
  "a_faq_tts_voices": "No seu <strong>Translation Profile</strong> (Inspector), use a lista 'Voice Mappings'. Você pode mapear um padrão Regex (por exemplo, <code>^hero_.*</code>) para um ID de Voz específico. O gerador escolherá automaticamente a voz correta com base no nome da chave.",
  "h1_extending": "Estendendo a Funcionalidade",
  "h2_custom_parser": "9.1. Criando um Parser (Analisador) Personalizado",
  "p_custom_parser_1": "Você pode estender facilmente o sistema para suportar componentes personalizados criando sua própria classe de parser.",
  "li_custom_parser_1": "Crie um novo script C# na pasta <strong>Editor</strong> do seu projeto.",
  "li_custom_parser_2": "Copie o template abaixo para ele.",
  "li_custom_parser_3": "Modifique a lógica para corresponder ao seu componente.",
  "code_custom_parser": "#if UNITY_EDITOR\nusing System.Collections.Generic;\nusing UnityEngine;\nusing Ankonoanko.Localization;\n\n// TEMPLATE para criar um parser para um componente personalizado.\npublic class CustomComponentParser_Template : ITextComponentParser\n{\n    public IEnumerable<(string text, string key, string source)> Parse(\n        GameObject gameObject,\n        LocalizationSettings settings)\n    {\n        // 1. Verifique se o objeto tem o componente personalizado que precisamos.\n        var component = gameObject.GetComponent<AwesomeComponentFromAssetStore>();\n        if (component == null)\n        {\n            yield break; // Saia se o componente não for encontrado\n        }\n        \n        // 2. Obtenha o texto dos campos do componente personalizado.\n        string titleText = component.Title;\n        \n        // 3. Verifique se o texto é válido para localização.\n        if (TextParser.IsValidLocalizableText(titleText))\n        {\n            // 4. Gere a chave e a fonte usando helpers do TextParser.\n            string key = TextParser.GenerateKeyForObject(gameObject, titleText, settings.keyGenerationMode);\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            \n            // 5. Retorne o resultado.\n            yield return (titleText, key, source);\n        }\n        \n        // 6. Repita para outros campos...\n        // (um sufixo pode ser adicionado para tornar as chaves únicas)\n        string descriptionText = component.Description;\n        if (TextParser.IsValidLocalizableText(descriptionText))\n        {\n            string key = TextParser.GenerateKeyForObject(gameObject, descriptionText, settings.keyGenerationMode) + \"_description\";\n            string source = TextParser.GetSourceStringForObject(gameObject);\n            yield return (descriptionText, key, source);\n        }\n    }\n}\n#endif",
  "h1_faq": "FAQ e Solução de Problemas",
  "h1_migration_tool": "Ferramenta de Migração",
  "p_migration_tool_desc": "Ferramenta para transição de outros sistemas de localização (I2 Localization, Unity Localization).",
  "p_migration_tool_access": "Acesse via <strong>Tools -> Anko Localization Tool -> Migration Tool</strong>.",
  "h2_migration_tool_features": "Recursos",
  "li_migration_tool_setup": "<strong>Passo 0: Configuração:</strong> Configure nomes de componentes (por exemplo, <code>Localize</code> para I2) e campos onde a chave é armazenada. Presets estão disponíveis.",
  "li_migration_tool_import": "<strong>Passo 1: Importação de Dados:</strong> Importe arquivos CSV (I2) ou XLIFF (Unity Loc) para criar um banco de dados de chaves.",
  "li_migration_tool_converter": "<strong>Passo 2: Conversor de Componentes:</strong> Varra cenas e prefabs. Substitui automaticamente componentes antigos (por exemplo, <code>Localize</code>) por <code>LocalizedText</code> / <code>LocalizedAsset</code>, transferindo chaves.",
  "li_migration_tool_safemode": "<strong>Modo Seguro e Stubs de Emergência:</strong> Os componentes são desabilitados em vez de excluídos. Inclui o recurso crítico <strong>Emergency Stubs</strong> (ativado através do símbolo de definição ANKO_ENABLE_MIGRATION_STUBS): gera classes placeholder falsas para I2 Localization ou Unity Localization para que seu projeto possa compilar imediatamente após remover esses plugins. Isso evita erros de \"The type name 'Localize' could not be found\" e lhe dá tempo para refatorar corretamente seu código para usar o novo sistema. Habilitar Stubs permite que você corrija erros de compilação após excluir o plugin de localização antigo.",
  "h1_font_glyph_manager": "Gerenciador de Fontes e Glifos",
  "p_font_glyph_manager_access": "Acesse via <strong>Tools -> Anko Localization Tool -> Font & Glyph Manager</strong>.",
  "h2_font_glyph_manager_features": "Recursos",
  "li_font_glyph_analyze": "Analisa todas as traduções e verifica se a fonte atribuída (TMP_FontAsset) suporta todos os caracteres usados.",
  "li_font_glyph_missing": "Mostra uma lista de glifos ausentes.",
  "li_font_glyph_copy": "Permite copiar todos os caracteres exclusivos do idioma para geração do atlas de fontes.",
  "h1_pseudo_tool": "Ferramenta de Pseudo-Localização",
  "p_pseudo_tool_desc": "Ferramenta para testar layouts de UI com texto expandido para simular idiomas com texto mais longo.",
  "p_pseudo_tool_access": "Acesse via <strong>Tools -> Anko Localization Tool -> Pseudo-Localization Generator</strong>.",
  "h2_pseudo_tool_features": "Recursos",
  "li_pseudo_tool_setup": "<strong>Pseudo-Localization Generator:</strong> Gere um idioma falso (por exemplo, [E-x-p-a-n-d-e-d]) para testar o estresse do seu layout de UI. Suporta expansão do comprimento do texto por um fator (por exemplo, +40%) para simular a expansão de texto em alemão/russo.",
  "h1_ai_audio": "Áudio AI / Text-to-Speech",
  "h2_ai_audio_setup": "Configuração",
  "li_ai_audio_profile": "Em <strong>Settings</strong>, selecione o <strong>Active Audio Profile</strong> (por exemplo, OpenAI TTS ou ElevenLabs).",
  "h2_ai_audio_usage": "Uso",
  "li_ai_audio_generate": "No <strong>Translation Table Editor</strong>, selecione linhas/células -> Botão Direito -> <strong>Generate Audio</strong>.",
  "li_ai_audio_save": "Os arquivos são salvos na pasta especificada no perfil.",
  "li_ai_audio_hash": "<strong>Atualização Inteligente e Hashing:</strong> A ferramenta calcula um hash MD5 do seu conteúdo de texto e só regenera arquivos de áudio se o texto fonte tiver mudado, economizando seus créditos de API. Ela detecta se a tradução mudou desde a última geração de áudio. O editor destaca essas linhas com um ícone 'Outdated' (amarelo), permitindo que você atualize APENAS as linhas alteradas. Este recurso de agrupamento inteligente evita chamadas desnecessárias de API e reduz custos ao regenerar áudio. A ferramenta faz o hash do seu texto e só regenera arquivos de áudio se o texto fonte tiver mudado, economizando seus créditos de API.",
  "li_ai_audio_voice_mapping": "<strong>Voice Mapping (Multi-Speaker):</strong> Atribua diferentes vozes de IA a diferentes personagens automaticamente. No <strong>Translation Profile</strong>, use a lista 'Voice Mappings' para vincular um padrão Regex (por exemplo, <code>^hero_.*</code>) a um ID de Voz específico. A ferramenta usará automaticamente a voz correta com base no nome da chave.",
  "h2_example_components_updated": "LanguageSelector.cs Atualizado",
  "p_example_components_updated": "O código mudou. O carregamento do idioma (especialmente ao usar Addressables) agora é assíncrono.",
  "li_example_components_old": "<strong>Antigo:</strong> <code>LocalizationManager.Instance.SetLanguage(lang)</code> (síncrono/void).",
  "li_example_components_new": "<strong>Novo:</strong> <code>StartCoroutine(LocalizationManager.Instance.SetLanguage(lang))</code> (assíncrono/Coroutine).",
  "h2_localizedasset_updated": "Carregamento Assíncrono de LocalizedAsset",
  "p_localizedasset_updated": "O componente agora suporta carregamento assíncrono. Note que pode haver um pequeno atraso ao mudar de idioma se os ativos forem carregados da nuvem/disco (Addressables).",
  "h2_faq_installation": "10.1. Instalação e Início Rápido",
  "q_faq_installation_1": "O que acontece se meu projeto já tiver o pacote com.unity.nuget.newtonsoft-json de outro ativo? O instalador de dependência tentará atualizar ou ignorá-lo?",
  "a_faq_installation_1": "O instalador verifica a existência do tipo Newtonsoft.Json.JsonConvert. Se o tipo existir, ele considera a dependência satisfeita e não tentará instalar ou atualizar o pacote. Isso é feito para evitar conflitos de versão.",
  "q_faq_installation_2": "Eu acidentalmente cliquei em \"Skip for Now\" (Pular por Enquanto) e marquei \"Don't ask again\" (Não perguntar novamente) para dependências opcionais (por exemplo, para suporte a CSV). Como posso abrir a janela do instalador novamente para instalá-las?",
  "a_faq_installation_2": "Você pode acionar manualmente uma verificação de dependência a qualquer momento através do menu Tools -> Localization -> Check Dependencies. Isso redefinirá a flag \"Don't ask again\" e mostrará a janela com todos os pacotes opcionais ausentes novamente.",
  "q_faq_installation_3": "A ferramenta não criou LocalizationSettings.asset em Assets/Resources. Por que isso pode ter acontecido, e posso criá-lo manualmente via Assets -> Create menu?",
  "a_faq_installation_3": "Isso pode acontecer se você não tiver uma pasta Assets/Resources. A ferramenta tentará criá-la, mas as permissões do sistema de arquivos podem impedir. Sim, você pode criar o ativo manualmente: clique com o botão direito na pasta Resources, selecione Create -> Localization -> Settings. A ferramenta o encontrará automaticamente.",
  "q_faq_installation_4": "Posso mover o arquivo LocalizationSettings.asset para outra pasta Resources, por exemplo, Assets/MyGame/Resources? A ferramenta ainda o encontrará?",
  "a_faq_installation_4": "Sim. A ferramenta usa Resources.Load(), que procura por um ativo pelo nome em todas as pastas chamadas Resources em seu projeto. O importante é que o arquivo mantenha seu nome LocalizationSettings.asset.",
  "q_faq_installation_5": "O instalador de dependência travou ou deu um erro. Posso instalar as dependências (Newtonsoft Json, Editor Coroutines) manualmente através do Unity Package Manager?",
  "a_faq_installation_5": "Sim. Você pode abrir Window -> Package Manager, clicar no ícone \"+\" e selecionar \"Add package by name...\". Digite os nomes dos pacotes: com.unity.nuget.newtonsoft-json e com.unity.editorcoroutines.",
  "h2_faq_components": "10.2. Componentes Principais",
  "q_faq_components_1": "O componente LocalizedPrefab desabilita MonoBehaviours no objeto original. E se o objeto original tiver um script que cria outros objetos ou se inscreve em eventos em Awake()? Este código será executado?",
  "a_faq_components_1": "Não, não será. Desabilitar um MonoBehaviour impede que todos os métodos \"mágicos\" do Unity sejam chamados, incluindo Awake(), OnEnable() e Start(). Isso é intencional para evitar a execução de lógica duplicada. Toda a inicialização deve ocorrer em scripts nas versões localizadas do prefab.",
  "q_faq_components_2": "Se o prefab original (LocalizedPrefab) tiver um Rigidbody ou outro componente de física, ele será desabilitado? Isso afetará a física se o prefab localizado não o tiver?",
  "a_faq_components_2": "Sim, o comportamento de física do objeto original será neutralizado. O componente LocalizedPrefab encontra todos os componentes Rigidbody e Rigidbody2D em seu GameObject e define sua propriedade isKinematic como true. Isso os remove efetivamente dos cálculos de física dinâmica, evitando comportamentos indesejados, como um objeto invisível caindo ou reagindo a colisões. Ainda é recomendado que a versão localizada do prefab contenha todos os componentes de física necessários para o comportamento correto.",
  "q_faq_components_3": "O componente LocalizedAsset armazena o nome do componente de destino como uma string (_targetComponentTypeName). O que acontece se eu renomear um script de componente personalizado ou movê-lo para outro assembly (Assembly Definition)? O LocalizedAsset deixará de funcionar para ele?",
  "a_faq_components_3": "Sim, deixará de funcionar. O componente armazena o nome completo do tipo, incluindo o namespace e o assembly. Renomear o script ou movê-lo para outro .asmdef mudará esse nome, e o LocalizedAsset não conseguirá encontrar o componente de destino. Você precisará executar outra análise via Analyze Project & Attach Components para que ele atualize o nome.",
  "q_faq_components_4": "Se houver dois componentes Image no mesmo GameObject, como o LocalizedAsset sabe qual localizar? Ele funcionará com ambos ou apenas com o primeiro que encontrar?",
  "a_faq_components_4": "Um LocalizedAsset é criado para uma instância de componente específica. Ele mantém uma referência a esse componente em código. Se você adicionar manualmente um segundo LocalizedAsset e usar o menu de contexto \"Analyze for Localization\" para direcionar o segundo Image, você terá dois componentes LocalizedAsset, cada um gerenciando seu próprio Image. O analisador automático só criará um componente para o primeiro Image com um ativo localizável que ele encontrar.",
  "q_faq_components_5": "A documentação afirma que LocalizedPrefab tem uma ordem de execução de -100. E se eu tiver outro script com uma ordem de execução de -110 que tenta encontrar um objeto filho criado por LocalizedPrefab em seu Awake()? O LocalizedPrefab terá instanciado sua instância a tempo?",
  "a_faq_components_5": "Sim, terá. LocalizedPrefab cria a instância do prefab localizado em seu método OnEnable(). A ordem de execução do Unity garante que todos os métodos Awake() sejam executados antes de todos os métodos OnEnable(). Assim, seu script com ordem -110 executará seu Awake(), então LocalizedPrefab com ordem -100 executará seu Awake(), e só depois disso seus métodos OnEnable() serão chamados em ordem. Seu script não encontrará o objeto porque ele ainda não terá sido criado.",
  "q_faq_components_6": "O componente LocalizedText tem uma opção isStyleOnly. Se eu habilitá-lo e depois chamar myLocalizedText.SetFormattedText(\"new_key\") em código, o texto mudará, ou apenas o estilo (fonte/RTL)?",
  "a_faq_components_6": "Tanto a chave quanto o texto mudarão. Chamar SetFormattedText programaticamente substitui o comportamento isStyleOnly para aquela atualização específica. A opção isStyleOnly é destinada a impedir que o componente reaja a mudanças globais de idioma, mas ele sempre reagirá a uma mudança direta de chave através de código.",
  "q_faq_components_7": "LocalizedBehaviour encontra automaticamente métodos com o atributo [OnLanguageChange]. Ele encontrará métodos privados e protegidos, ou eles devem ser públicos?",
  "a_faq_components_7": "Ele encontrará métodos com qualquer modificador de acesso (public, private, protected, internal). A Reflexão no Unity permite a descoberta de todos os métodos de instância, independentemente do seu nível de acesso.",
  "q_faq_components_8": "O componente LocalizedAsset intercepta Play on Awake. O que acontece se outro script no mesmo objeto tentar acessar o ativo (por exemplo, audioSource.clip.length) em Awake() ou Start() antes que LocalizedAsset o tenha trocado? É possível uma NullReferenceException ou o uso do ativo antigo?",
  "a_faq_components_8": "O uso do ativo antigo (não localizado) é possível. LocalizedAsset executa a troca em seu OnEnable(). Os métodos Awake() de todos os scripts são executados antes de OnEnable(). Se seu script acessar audioSource.clip em Awake(), ele obterá o clipe original. Se ele o acessar em Start(), o resultado dependerá da ordem de execução do script. Para garantir o acesso ao ativo localizado, defina uma ordem de execução posterior para seu script ou acesse o ativo em um método marcado com [OnLanguageChange].",
  "h2_faq_window": "10.3. Janela \"Localization Tool\"",
  "h3_faq_window_preview": "Pré-visualização em Editor",
  "q_faq_window_preview_1": "Eu abri um prefab no Prefab Mode, apliquei o In-Editor Preview e pressionei Ctrl+S. Os dados temporários de pré-visualização serão salvos no ativo prefab? Como o LocalizationPreviewProtector lida com este caso?",
  "a_faq_window_preview_1": "Não, não serão salvos. LocalizationPreviewProtector intercepta o evento de salvamento de ativo (OnWillSaveAssets) e chama automaticamente RevertEditorPreview() antes que o Unity grave as alterações no disco. Assim, o prefab será salvo em seu estado original, não localizado.",
  "q_faq_window_preview_2": "Se eu habilitar o In-Editor Preview e o editor do Unity travar, e o arquivo Temp/localization_preview_recovery.json for corrompido (por exemplo, JSON vazio ou inválido), o que acontecerá na próxima inicialização?",
  "a_faq_window_preview_2": "O PreviewCrashProtector é envolvido em um bloco try-catch. Se a desserialização JSON falhar, um erro será registrado no console sobre a incapacidade de recuperar, e o processo será encerrado silenciosamente. Sua cena permanecerá no estado \"quebrado\" em que estava no momento do crash. Neste caso, você precisará selecionar manualmente \"Revert to Original\" na janela da ferramenta para forçar um rollback das alterações.",
  "q_faq_window_preview_3": "No modo In-Editor Preview para LocalizedPrefab, uma instância temporária é criada. Os métodos Awake() e Start() serão executados nesta instância? Isso pode causar erros se eles não forem projetados para rodar no Edit Mode?",
  "a_faq_window_preview_3": "Sim, serão. PrefabUtility.InstantiatePrefab no Edit Mode chama Awake() e OnEnable(). Se esses métodos contiverem lógica que não deve ser executada no editor (por exemplo, acessar singletons que só existem no Play Mode), isso pode causar erros. É recomendado usar if (Application.isPlaying) ou #if UNITY_EDITOR para proteger tal código.",
  "h3_faq_window_settings": "Aba \"Settings\" (Configurações)",
  "q_faq_window_settings_1": "Posso mudar o Key Generation Mode de UseTextAsKey para AutoGenerateKeysOnly no meio do projeto. O que exatamente acontecerá com minhas traduções existentes? Elas serão mapeadas para as novas chaves?",
  "a_faq_window_settings_1": "Sim, serão. Ao mudar o modo, a ferramenta executa uma \"migração segura\": ela re-analisa todo o projeto, cria novas chaves de acordo com as novas regras, mas mapeia as chaves antigas e novas através do texto original. Em seguida, transfere todas as suas traduções e comentários existentes das chaves antigas para as novas. Suas traduções não serão perdidas.",
  "q_faq_window_settings_2": "Se eu adicionar um idioma com um código que não tem regras de pluralização (por exemplo, \"kz\" para Cazaque) à lista Supported Languages, qual regra será usada por padrão?",
  "a_faq_window_settings_2": "Será usada a DefaultPluralRule, que é adequada para inglês e a maioria dos idiomas europeus (formas para \"one\" e \"other\").",
  "q_faq_window_settings_3": "E se eu especificar o Translations Path não em StreamingAssets, mas em uma pasta regular como Assets/MyTranslations? Os arquivos json serão incluídos na build do jogo?",
  "a_faq_window_settings_3": "Não, não serão. Apenas ativos localizados em uma pasta StreamingAssets ou Resources têm a garantia de serem incluídos na build. Se você especificar um caminho diferente, a localização funcionará no editor, mas não funcionará no jogo compilado, pois os arquivos de tradução não farão parte da build.",
  "q_faq_window_settings_4": "A chave de API de tradução automática é armazenada em EditorPrefs. Se eu estiver trabalhando no projeto em dois computadores diferentes, preciso inserir a chave em cada máquina separadamente?",
  "a_faq_window_settings_4": "Sim. EditorPrefs é armazenamento local para cada computador. Você precisará inserir a chave de API em cada máquina da qual planeja usar o recurso de tradução automática.",
  "h3_faq_window_content": "Aba \"Content\" (Conteúdo)",
  "q_faq_window_content_1": "E se eu adicionar uma cena a Scenes to Parse que não está incluída nas Build Settings? Isso afetará algo além do próprio processo de análise?",
  "a_faq_window_content_1": "Não, não afetará. A lista Scenes to Parse é usada exclusivamente para informar à ferramenta quais cenas abrir e analisar em busca de texto. Ela não está de forma alguma relacionada às cenas que farão parte da build final do seu jogo.",
  "q_faq_window_content_2": "Eu adicionei um objeto a Ignore Specific Objects (a lista temporária). Se eu fizer um prefab a partir deste objeto, a instância deste prefab também será ignorada?",
  "a_faq_window_content_2": "Não, não será. A lista temporária armazena uma referência direta ao objeto na cena. Ao criar um prefab, ele é um novo ativo. Suas instâncias são objetos diferentes, e a regra de ignorar não se aplicará a elas. Para ignorar prefabs permanentemente, eles devem ser adicionados à lista de ignorados como um ativo prefab.",
  "q_faq_window_content_3": "Se eu adicionar o componente TMPro.TMP_Text a Parsing Ignores -> Ignore Component Types, mas houver um objeto na cena com um LocalizedText que já referencia este TMP_Text, o que acontecerá na próxima Atualização de Chaves? A chave será excluída?",
  "a_faq_window_content_3": "Sim, será. Ao clicar em Update Keys, o parser re-varre o projeto inteiro. Ele verá que o tipo TMPro.TMP_Text deve ser ignorado e não gerará uma chave para ele. Durante o processo de comparação de chaves antigas e novas, ele determinará que a chave antiga não está mais sendo usada e a marcará como \"Removed\" (Removida).",
  "q_faq_window_content_4": "A documentação diz que \"Pin\" salva o caminho completo para o objeto e será quebrado se for renomeado. E se eu fizer um prefab a partir do objeto e depois renomear o objeto original — o \"Pin\" continuará a funcionar para as instâncias do prefab?",
  "a_faq_window_content_4": "Não, não continuará. \"Pin\" salva o caminho absoluto na hierarquia da cena no momento em que o botão é clicado (por exemplo, Canvas/Panel/Button). Este caminho não está relacionado à lógica do prefab. As instâncias do prefab terão o mesmo caminho, mas se você renomear o objeto pai na cena, o \"Pin\" deixará de funcionar tanto para o original quanto para as instâncias.",
  "q_faq_window_content_5": "Se eu usar \"Pin\" para um objeto filho dentro de uma instância de prefab, qual caminho será salvo: relativo à raiz do prefab ou à raiz da cena? Funcionará em outras cenas?",
  "a_faq_window_content_5": "O caminho completo a partir da raiz da cena será salvo. Por exemplo, MyPrefab(Clone)/Content/Icon. Este caminho \"fixado\" só funcionará na cena onde você o criou. Em outras cenas, é improvável que tal caminho seja encontrado.",
  "h3_faq_window_actions": "Aba \"Actions\" (Ações)",
  "h3_faq_window_assets": "Aba \"Assets\" (Ativos)",
  "h3_faq_window_report": "Aba \"Report\" (Relatório)",
  "h2_faq_editor": "10.4. Editor de Tradução",
  "h2_faq_examples": "10.5. Exemplos de Uso e Código",
  "h2_faq_notes": "10.6. Nuances e Avisos Importantes",
  "h2_faq_extending": "10.7. Estendendo a Funcionalidade",
  "q_faq_window_actions_1": "O que acontece se a conexão com a internet for perdida durante uma tradução automática em lote? A ferramenta tentará reenviar o lote falhado de acordo com a Retry Policy, ou o processo será completamente interrompido?",
  "a_faq_window_actions_1": "A ferramenta tentará reenviar o lote exato que falhou, de acordo com as configurações da Retry Policy (número de tentativas e atraso). Se todas as tentativas para este lote falharem, o processo de tradução para o idioma atual será interrompido, e um erro será registrado no console. A tradução para os próximos idiomas na fila não será iniciada.",
  "q_faq_window_actions_2": "Se eu importar um arquivo CSV que contém chaves que já existem no projeto, mas com valores vazios para alguns idiomas, esses valores vazios substituirão minhas traduções existentes ou serão ignorados?",
  "a_faq_window_actions_2": "Valores vazios substituirão as traduções existentes. O processo de importação considera o arquivo CSV como a \"fonte da verdade\". Se o valor para a chave welcome_message na coluna ru estiver vazio, a tradução russa atual para esta chave será sobrescrita.",
  "q_faq_window_actions_3": "A seção \"Danger Zone\" permite excluir todos os componentes. Isso removerá componentes de prefabs que estão em pastas não especificadas nas Prefab Folders na aba Content?",
  "a_faq_window_actions_3": "Sim, removerá. As funções na \"Danger Zone\" varrem todos os prefabs no projeto (AssetDatabase.FindAssets(\"t:Prefab\")), não apenas aqueles especificados na lista de análise, para garantir a limpeza mais completa possível.",
  "q_faq_window_actions_4": "Ao importar do Google Sheets, como devo formatar a coluna de comentários para que a validação de placeholder usando a diretiva @placeholders: funcione?",
  "a_faq_window_actions_4": "No seu documento Google Sheets, a coluna deve ser intitulada \"Developer Notes\". Nas células desta coluna, você pode escrever comentários como de costume. Para especificar placeholders, basta adicionar uma linha como @placeholders: {username}, {score} no texto do comentário. A ferramenta reconhecerá automaticamente esta diretiva na importação.",
  "q_faq_window_actions_5": "A ferramenta pode importar dados de várias planilhas de um único documento Google Sheets, ou só funciona com uma planilha por GID?",
  "a_faq_window_actions_5": "A ferramenta só funciona com uma planilha por vez. O URL de importação inclui um parâmetro gid=..., que identifica exclusivamente uma planilha específica no documento. Para importar dados de outra planilha, você precisa copiar seu URL (com um gid diferente) e realizar a importação novamente.",
  "q_faq_window_assets_1": "E se eu tiver dois ativos com a mesma chave, mas tipos diferentes, na mesma pasta de varredura (por exemplo, sound_effect_en.mp3 e sound_effect_en.wav)? Qual acabará na tabela de ativos?",
  "a_faq_window_assets_1": "O scanner de ativos os carrega especificando o tipo esperado (AssetDatabase.LoadAssetAtPath(path, expectedType)). Para a categoria AudioClip, ele só buscará e carregará arquivos que o Unity reconhece como AudioClips. Se ambos os arquivos forem clipes de áudio válidos, o que for processado por último será incluído na tabela, sobrescrevendo efetivamente o anterior. É recomendado evitar tais duplicatas.",
  "q_faq_window_assets_2": "Se eu clicar em Scan Assets & Analyze Project, e houver um objeto Image na cena para o qual um sprite localizado já existe, mas o objeto Image em si ainda não tem um componente LocalizedAsset, a ferramenta adicionará o componente e inserirá automaticamente a chave?",
  "a_faq_window_assets_2": "Sim, é exatamente assim que funciona. \"Analyze Project\" encontra o componente Image, olha o nome do sprite atribuído a ele (por exemplo, icon_play_en), extrai a chave (icon_play) e o idioma (en) dele, e então adiciona um componente LocalizedAsset a esse GameObject e escreve a chave icon_play nele.",
  "q_faq_window_assets_3": "Posso usar a mesma Naming Rule para diferentes categorias de ativos se elas tiverem diferentes Scan Folders? Isso causará conflitos?",
  "a_faq_window_assets_3": "Sim, você pode. Não haverá conflitos, pois uma tabela de ativos separada (LocalizedAssetTable) é criada para cada categoria. As chaves da categoria \"Sprites\" não se sobrepõem às chaves da categoria \"AudioClips\", mesmo que tenham o mesmo nome.",
  "q_faq_window_assets_4": "Se um ativo localizável (por exemplo, button_ok_en.png) não estiver na raiz da Scan Folder, mas em uma subpasta, o scanner o encontrará?",
  "a_faq_window_assets_4": "Sim, encontrará. O scanner usa a opção SearchOption.AllDirectories, o que significa que ele verificará recursivamente todas as subpastas dentro da Scan Folder que você especificar.",
  "q_faq_window_report_1": "O botão \"Find\" (Buscar) procura o objeto assincronamente. E se eu iniciar uma busca e depois clicar imediatamente em Update Keys? A busca será interrompida?",
  "a_faq_window_report_1": "Sim, será interrompida. Qualquer nova ação que exija bloqueio de UI (como Update Keys) interromperá a corrotina de busca atual. Uma caixa de diálogo aparecerá, solicitando que você pare a busca atual para iniciar uma nova.",
  "q_faq_window_report_2": "Se uma chave for usada em vários lugares (por exemplo, em dois botões diferentes em cenas diferentes), como isso será exibido no relatório na categoria \"Duplicates\"?",
  "a_faq_window_report_2": "A categoria \"Duplicates\" mostrará todas as fontes para essa chave. Você verá uma entrada para a chave, e o campo \"Source\" listará todos os caminhos (na cena 1 e na cena 2). O botão \"Find\" neste caso abrirá uma lista suspensa, permitindo que você escolha para qual objeto navegar.",
  "q_faq_window_report_3": "Se eu clicar em \"Find\" para uma chave que é usada apenas em código (via função _()), o que acontecerá? A ferramenta será capaz de encontrar e destacar o script C#?",
  "a_faq_window_report_3": "Sim. O sistema de busca é especificamente treinado para reconhecer fontes como script MyScript.cs. Ao clicar em \"Find\", ele buscará o ativo MyScript.cs no projeto e o destacará (ping) na janela Project.",
  "q_faq_editor_1": "O que tem maior prioridade para validação de placeholder: a diretiva @placeholders: no comentário ou os placeholders encontrados no texto do idioma fonte? Por exemplo, se o texto fonte tem {name} e o comentário diz @placeholders: {username}.",
  "a_faq_editor_1": "A diretiva @placeholders: no comentário tem prioridade. Ela é considerada uma instrução explícita do desenvolvedor e a \"fonte da verdade\". No seu exemplo, o editor exigirá {username} na tradução e ignorará {name} do texto fonte.",
  "q_faq_editor_2": "Se eu cometer um erro de digitação na diretiva (por exemplo, @placeholder: em vez de @placeholders:), ela será ignorada ou a ferramenta emitirá um aviso?",
  "a_faq_editor_2": "Ela será simplesmente ignorada. A ferramenta procura por uma correspondência exata de @placeholders:. Se a diretiva estiver incorreta, ela será tratada como parte de um comentário regular, e a validação funcionará da maneira antiga - com base nos placeholders do texto fonte.",
  "q_faq_editor_3": "O sistema de salvamento automático cria arquivos na pasta Backups/AutoSaves. Esses arquivos serão excluídos automaticamente após um salvamento manual bem-sucedido ou ao fechar a janela?",
  "a_faq_editor_3": "Sim. Após um salvamento manual bem-sucedido ou fechamento normal da janela (quando você salva as alterações), todos os arquivos de salvamento automático são excluídos para evitar o prompt de recuperação na próxima inicialização. Eles só permanecem em caso de crash do editor.",
  "q_faq_editor_4": "Se eu mudar as larguras das colunas no editor, essas configurações serão salvas entre as sessões do Unity?",
  "a_faq_editor_4": "Sim. As larguras das colunas são salvas no EditorPrefs toda vez que você fecha a janela do editor de tradução e serão restauradas na próxima vez que você a abrir.",
  "q_faq_editor_5": "A janela pop-up de edição de texto (MultiLineEditWindow) suporta sua própria pilha de Desfazer/Refazer (via Ctrl+Z) para alterações feitas dentro dela?",
  "a_faq_editor_5": "Sim. A MultiLineEditWindow tem sua própria pilha temporária de Desfazer/Refazer que funciona enquanto a janela está aberta. Isso permite que você desfaça e refaça alterações de texto dentro dessa janela. Assim que você salva o resultado (fechando a janela), essa alteração é registrada como uma única ação na pilha global de Desfazer/Refazer do editor principal.",
  "q_faq_examples_1": "O que acontece se os nomes das propriedades no tipo anônimo passado para a função _() não corresponderem aos placeholders na string? Por exemplo, _(\"Hello, {username}\", new { user_name = \"Bob\" }). Haverá um erro, ou o placeholder simplesmente não será substituído?",
  "a_faq_examples_1": "Não haverá erro. O placeholder {username} simplesmente não será substituído, e você obterá a string \"Hello, {username}\" como resultado. A substituição só ocorre com uma correspondência exata de nome.",
  "q_faq_examples_2": "O atributo [LocalizableField] funciona para campos privados. Ele funcionará para campos estáticos?",
  "a_faq_examples_2": "Sim, funcionará. O parser usa reflexão para encontrar campos com as flags BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance | BindingFlags.Static, então ele encontrará e processará campos estáticos.",
  "q_faq_examples_3": "Se eu colocar o atributo [OnLanguageChange] em um método com parâmetros (por exemplo, void UpdateUI(string newLang)), o que acontecerá? Haverá um erro de compilação ou um aviso em tempo de execução?",
  "a_faq_examples_3": "Não haverá erro de compilação, mas um aviso do LocalizedBehaviour aparecerá no console do Unity em tempo de execução. Ele relatará que encontrou um método com o atributo, mas o ignorou porque o método tem parâmetros. Tal método não será chamado.",
  "q_faq_examples_4": "Eu estou usando _(\"apple_count\", count). Se não houver uma chave apple_count_one para o idioma atual (para count = 1), qual forma o sistema escolherá? Ele usará apple_count_other como fallback?",
  "a_faq_examples_4": "Sim. Se uma forma específica (_one, _few, etc.) não for encontrada, o sistema tentará usar a chave com o sufixo _other como fallback. Se isso também não for encontrado, a tradução para a chave base apple_count será usada.",
  "q_faq_examples_5": "A função _(\"key\", new { username = \"Alex\" }) usa um tipo anônimo. Isso não criará uma \"carga\" excessiva no coletor de lixo (GC) com chamadas frequentes em um método Update() em comparação com a passagem de um Dictionary<string, object> pré-criado?",
  "a_faq_examples_5": "Sim, criará. Cada chamada para new { ... } aloca memória no heap gerenciado, o que cria trabalho extra para o coletor de lixo. Para texto que é atualizado a cada frame (em Update ou LateUpdate), é significativamente mais performático criar um Dictionary<string, object> uma vez em Start(), e apenas atualizar seus valores em Update() antes de passá-lo para a função _().",
  "q_faq_examples_6": "Meu método marcado com [OnLanguageChange] não está sendo chamado. Por quê?",
  "a_faq_examples_6": "Verifique se seu método tem parâmetros. O atributo <code>[OnLanguageChange]</code> só funciona em métodos <strong>sem parâmetros</strong> (por exemplo, <code>void UpdateUI()</code>). Se seu método requer argumentos, envolva-o em um método sem parâmetros.",
  "q_faq_notes_1": "A documentação recomenda adicionar LanguageSelector à lista de ignorados. O que exatamente será quebrado se eu esquecer de fazer isso? Serão criadas chaves extras para \"Option A, Option B\"?",
  "a_faq_notes_1": "Sim. Se você não adicionar LanguageSelector à lista de ignorados, o parser tratará seu TMP_Dropdown como um dropdown regular. Ele encontrará o padrão \"Option A, Option B, Option C\" que o Unity cria e adicionará chaves para eles em seus arquivos de tradução. Isso poluíra seus arquivos com chaves desnecessárias, pois o LanguageSelector removerá essas opções em tempo de execução e criará as suas de qualquer maneira.",
  "q_faq_notes_2": "Se eu esquecer de adicionar um LocalizedText vazio com a caixa de seleção isStyleOnly habilitada no Label dentro do TMP_Dropdown usado pelo LanguageSelector, a fonte não mudará? Por que isso é necessário?",
  "a_faq_notes_2": "Sim, a fonte não mudará. Isso é necessário porque o LanguageSelector altera diretamente a propriedade label.text. Sem um LocalizedText neste objeto, o sistema de localização não sabe que este elemento precisa de estilos (fonte, RTL) aplicados quando o idioma muda. Um LocalizedText vazio com isStyleOnly serve como um \"marcador\" para o sistema, dizendo: \"Observe este objeto e aplique estilos a ele, mas não toque em seu texto\".",
  "q_faq_notes_3": "A chamada _() no método Update() não é recomendada. Mas e se eu precisar atualizar o texto a cada frame (por exemplo, um cronômetro)? Qual é a maneira mais performática de fazer isso, armazenando em cache apenas a string de formato?",
  "a_faq_notes_3": "A abordagem mais performática é armazenar a string de formato em cache em Start() ou em um método [OnLanguageChange], e usar string.Format regular em Update(). Exemplo: private string timerFormat; [OnLanguageChange] void UpdateTimerFormat() { timerFormat = _(\"timer_format\"); } void Update() { myTextComponent.text = string.Format(timerFormat, timeLeft); } Isso evita procurar a chave no dicionário a cada frame, o que é significativamente mais rápido.",
  "q_faq_extending_1": "Meu parser personalizado será chamado automaticamente após cada Update Keys? Eu preciso registrá-lo em algum lugar, ou basta ter uma classe que implemente ITextComponentParser no projeto?",
  "a_faq_extending_1": "Basta ter a classe. Quando o TextParser é executado, ele usa reflexão para encontrar todas as classes no projeto que implementam a interface ITextComponentParser e chama automaticamente o método Parse() delas para cada GameObject. Nenhum registro manual é necessário.",
  "q_faq_extending_2": "E se ocorrer uma exceção no meu parser personalizado? Isso interromperá todo o processo de análise, ou a ferramenta continuará com segurança com outros parsers?",
  "h2_faq_addressables": "Addressables e Migração",
  "q_faq_addressables_1": "Eu habilitei o modo Addressables, mas os ativos não estão carregando. O que devo verificar?",
  "a_faq_addressables_1": "Certifique-se de que o pacote Addressables esteja instalado, as configurações criadas e você clicou em \"Scan Assets & Generate Tables\" para registrar as chaves nos grupos.",
  "q_faq_addressables_2": "Como adiciono suporte para DeepL/Google?",
  "a_faq_addressables_2": "Crie um <code>Translation Profile</code> na pasta de ativos, selecione o tipo de serviço, insira a chave de API e atribua este perfil na janela <code>Settings</code>.",
  "q_faq_addressables_3": "O migrador mostra erros de compilação após remover I2/UnityLoc. Como posso corrigir isso?",
  "a_faq_addressables_3": "Na janela Migration (Aba 0), há um botão \"Enable Stubs\" que ativa o recurso Emergency Stubs. Isso cria classes placeholder falsas para I2 Localization ou Unity Localization para que seu projeto possa compilar imediatamente após remover esses plugins. O recurso funciona alternando o símbolo de definição ANKO_ENABLE_MIGRATION_STUBS. Isso evita erros de \"The type name 'Localize' could not be found\" e lhe dá tempo para refatorar corretamente seu código para usar o novo sistema. Habilitar Stubs permite que você corrija erros de compilação após excluir o plugin de localização antigo.",
  "a_faq_extending_2": "Uma exceção no seu parser personalizado interromperá o processo. O loop principal de análise não envolve chamadas para parsers personalizados em um bloco try-catch. Se o seu método Parse() lançar uma exceção não tratada,",
  "h2_faq_audio": "Áudio AI / Text-to-Speech",
  "q_faq_audio_smart_update": "Como a ferramenta economiza créditos de API ao regenerar arquivos de áudio?",
  "a_faq_audio_smart_update": "A ferramenta usa agrupamento inteligente (smart batching) com hashing MD5 para regenerar arquivos de áudio apenas quando o texto fonte tiver mudado. Ela calcula um hash MD5 do seu conteúdo de texto e o compara com arquivos de áudio gerados anteriormente. Se o texto não mudou, ela ignora a regeneração, economizando seus créditos de API. Isso evita chamadas desnecessárias de API e reduz custos ao regenerar áudio. A ferramenta faz o hash do seu texto e só regenera arquivos de áudio se o texto fonte tiver mudado, economizando seus créditos de API.",
  "toggle_notes_title": "Alternar Notas",
  "mindmap_toggle_title": "Mostrar Mapa Mental",
  "on_this_page_title": "Nesta Página",
  "my_notes_title": "Minhas Notas",
  "no_notes_message_new": "Passe o mouse sobre o texto para adicionar uma nota.",
  "notes_add_title": "Adicionar uma nota a este bloco",
  "notes_placeholder": "Sua nota...",
  "notes_close_title": "Fechar",
  "notes_goto_title": "Ir para o texto",
  "notes_edit_title": "Editar nota",
  "notes_delete_title": "Excluir nota",
  "notes_edit_text": "Editar",
  "copy_code_copy": "Copiar",
  "copy_code_copied": "Copiado!",
  "copy_code_error": "Erro",
  "error_loading_title": "Erro de Carregamento",
  "error_loading_message": "Verifique sua conexão e atualize.",
  "lightbox_aria_close": "Fechar visualizador de imagem",
  "lightbox_image_alt": "Visualização ampliada",
  "mindmap_preset_full": "Visualização Completa",
  "mindmap_preset_quick_start": "Início Rápido",
  "mindmap_preset_dev": "Fluxo de Trabalho do Desenvolvedor",
  "mindmap_preset_translator": "Fluxo de Trabalho do Tradutor",
  "mindmap_edge_configure": "1. Configurar",
  "mindmap_edge_specify_content": "2. Especificar Conteúdo",
  "mindmap_edge_parse_project": "3. Analisar Projeto",
  "mindmap_edge_creates_components": "Cria Componentes",
  "mindmap_edge_generates": "Gera",
  "mindmap_edge_opens": "Abre",
  "mindmap_edge_manages_assets": "Gerencia ativos para",
  "mindmap_edge_defines_rules": "Define regras para",
  "mindmap_edge_reports_on": "Informa sobre",
  "mindmap_edge_enables_reaction": "Permite reação via",
  "mindmap_edge_processed_by": "Processado por",
  "mindmap_edge_edited_in": "Editado em",
  "mindmap_edge_extends": "Estende",
  "mindmap_edge_warns_about": "Avisa sobre",
  "mindmap_edge_relates_to": "Relaciona-se a",
  "mindmap_edge_recommends_for": "Recomenda para",
  "mindmap_edge_see_faq": "Ver FAQ",
  "li_attr_feat_5": "<strong>Strings Formatadas:</strong> Suporta strings interpoladas (<code>$\"Text {0}\"</code>) e strings verbatim (<code>@\"Text\"</code>). O analisador extrai o padrão de formato bruto.",
  "li_cheat_unattached": "<strong>Scripts Não Anexados:</strong> Os scripts devem estar em um GameObject em uma Cena ou Prefab",
  "li_cheat_base_private": "<strong>Campos Privados da Classe Base:</strong> campos <code>private</code> em uma Classe Pai (limitação de herança)",
  "li_attr_feat_1": "<strong>Coleções:</strong> Suporta <code>List&lt;string&gt;</code> e <code>string[]</code>. As chaves são geradas com sufixos <code>_0</code>, <code>_1</code>, etc. Você pode até usar uma chave personalizada no próprio campo da lista para prefixar todos os itens.",
  "li_cheat_serializable": "Classes <code>[Serializable]</code> Aninhadas (Itens de inventário, nós de diálogo)",
  "li_cheat_structs": "<strong>Structs</strong> (Apenas Classes são suportadas para recursão)",
  "code_example_attribute_limitations": "[LocalizableField] \npublic string Prop { get; set; } // FALHA: Propriedade\n\n[LocalizableField]\npublic static string St = \"X\"; // FALHA: Estático\n\n[LocalizableField]\npublic string Head = \"A\" + \"B\"; // FALHA: Concatenação",
  "li_cheat_non_literals": "<strong>Variáveis & Constantes:</strong> Atribuições como <code>string s = MyConst;</code> (Deve ser um Literal de String)",
  "h3_attribute_limitations": "Limitações",
  "li_cheat_headers": "Atributos como <code>[Header(\"...\")]</code> (se adicionado às Configurações)",
  "li_cheat_static": "<strong>Campos Estáticos:</strong> <code>public static string</code> (O analisador escaneia apenas instâncias)",
  "li_cheat_private": "Campos <code>private</code> / <code>protected</code> (O analisador usa Reflexão)",
  "li_attr_feat_2": "<strong>Modificadores de Acesso:</strong> Funciona com campos <code>private</code>, <code>protected</code>, <code>internal</code> e <code>public</code>.",
  "li_attr_limit_3": "<strong>Campos Estáticos:</strong> Suportados via análise estática (regex) em arquivos de código, mas geralmente é recomendado usar campos de instância para uma detecção robusta em GameObjects.",
  "li_attr_feat_3": "<strong>Atributos Personalizados:</strong> Nas configurações da <em>Guia de Conteúdo</em>, você pode adicionar <code>HeaderAttribute</code>, <code>TooltipAttribute</code> ou qualquer nome de atributo personalizado. O analisador tratará então os campos com esses atributos (por exemplo, <code>[Header(\"Text\")]</code>) como strings localizáveis!",
  "li_cheat_ternary": "<strong>Lógica/Ternário:</strong> <code>cond ? \"A\" : \"B\"</code> (O analisador não consegue determinar o valor)",
  "li_cheat_concatenation": "<strong>Concatenação de String:</strong> <code>\"A\" + \"B\"</code> (Regex captura apenas a primeira parte: \"A\")",
  "li_attr_limit_1": "<strong>Propriedades são Ignoradas:</strong> O analisador escaneia apenas <code>Campos</code>. Código como <code>[LocalizableField] public string Name { get; set; }</code> <strong>não funcionará</strong>.",
  "li_attr_limit_2": "<strong>Dicionários:</strong> <code>Dictionary&lt;T, string&gt;</code> não é diretamente suportado para análise.",
  "li_cheat_dictionaries": "<strong>Dicionários</strong> (Não são serializáveis pelo inspetor do Unity naturalmente)",
  "li_cheat_properties": "<strong>Propriedades</strong> <code>{ get; set; }</code> (Apenas campos!)",
  "h3_attribute_features": "Tipos e Recursos Suportados",
  "h3_attribute_cheat_sheet": "Referência Rápida: O Que Fazer e o Que Não Fazer",
  "li_attr_feat_4": "<strong>Objetos Aninhados:</strong> Verifica recursivamente campos dentro de classes ou structs marcados com <code>[System.Serializable]</code>. Isso inclui instâncias únicas e listas de objetos aninhados.",
  "li_cheat_collections": "<code>List&lt;string&gt;</code>, <code>string[]</code> Arrays",
  "li_cheat_scriptable_objects": "<strong>ScriptableObjects</strong> (Deve ser referenciado por um MonoBehaviour)",
  "li_cheat_constructor_args": "<strong>Argumentos de Construtor Complexos:</strong> <code>new Item(\"Name\" + index)</code>",
  "lbl_supported": "Totalmente Suportado",
  "li_cheat_nested_lists": "<strong>Listas de Objetos Aninhados</strong> (ex: <code>List&lt;ItemData&gt;</code>)",
  "tip_best_practice": "<strong>Dica Profissional:</strong> Se você precisar localizar uma Propriedade, crie um campo de suporte com <code>[LocalizableField]</code> e exponha a propriedade separadamente.",
  "lbl_not_supported": "NÃO Suportado"
}